[{"SimCorpReference":"D-80571","ChangeNote":"fix failing APL L1 tests","Products":["Business-GroupAccounting","CsCode-AplInterface","CsCode-UP","Framework-Database"]},{"SimCorpReference":"S-179608","ChangeNote":"Change return form AxiomStressTestApi from entity to info string","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-78607","ChangeNote":"Adding ComplianceFree Comment to render to enable it again","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-80518","ChangeNote":"No change","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-80677","ChangeNote":"In the case of APL Unit Test SQL statement to string was converter to upper case.","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-80795","ChangeNote":"On changing to empty put default value","Products":["Reconciliation"]},{"SimCorpReference":"S-182672","ChangeNote":"change note."},{"SimCorpReference":"S-182145"},{"SimCorpReference":"D-81091","ChangeNote":"Reduce memory consumption. Benchmarks","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81007","ChangeNote":"Some exceptions from UP are now propagated to the client side.","Products":["CsCode-UP"]},{"SimCorpReference":"D-80902","ChangeNote":"BM incremental upload job: Fixed an error, where we could end up doing a full upload, if no recent benchmark calculation executions were found.","Products":["Performance"]},{"SimCorpReference":"D-80891","ChangeNote":"Solæved a number of test findings:  F5 did not work\nMissing check for empty Destination type\nShould be possible to save storage destination, when the referenced bus destination is not loaded.\nWhen deleting a destination, ensure there are no references to it in database or in the grid.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80788","ChangeNote":"Before inserting into general reconciliation log table all data will be trimmed according to the max allowed length.","Products":["Business-Collateral","Business-Reconciliation"]},{"SimCorpReference":"D-80395","ChangeNote":"Code refactoring of Corporate Actions core for improving performance of Corporate Action WEB API. No changes visible for users.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80855","ChangeNote":"Correction of program error reported in the Match screen when APL FX Option exercise transactions are being matched.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78694","ChangeNote":"An error in updating order amounts after a high-level transaction was deleted during a booking stop has been fixed","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80407","ChangeNote":"Change type of field PFCFRMLRESIK to big integer on database","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-80815","ChangeNote":"A crash could happen in Batch Jobs of type \u0022Benchmark Calculation - Upload Results \u0022 if running a full upload on a limited time period and uploading data for a constituent based index, where components were disappearing on the start date.","Products":["Performance"]},{"SimCorpReference":"D-80842","ChangeNote":"Remove pLAEADATE  from tables \u002B Patch","Products":["Business-Connectivity","Business-EquityAccounting","Business-GeneralTransactions","Business-GroupAccounting","Business-PeriodClosure","Business-Reporting","Business-Risk","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting","Business-Transactions","Business-ViewPositions"]},{"SimCorpReference":"D-80913","ChangeNote":"Transformation service correctly monitors message broker"},{"SimCorpReference":"D-80725","ChangeNote":"Fields described as ZeroAsNull on database, will we wrapped in a NVL","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80970","ChangeNote":"Handled Operation canceled exception for post draining op","Products":["CsCode-UP"]},{"SimCorpReference":"D-80225","ChangeNote":"Remove redundant error messages from Risk Measurement, when we are using imported sensitivities when pricing CDS, CDS Option and XpressInstrument","Products":["Business-Risk"]},{"SimCorpReference":"D-80805","ChangeNote":"Carried mark to market adj QC/PC are specially treated in the Tax Lot Corrections form regarding their access","Products":["Business-Transactions"]},{"SimCorpReference":"D-80667","ChangeNote":"Front Office Options: During configuration import we should allow for empty compliance clean-up dates.","Products":["Business-Compliance","CsCode-Compliance","Framework-Configuration"]},{"SimCorpReference":"D-80928","ChangeNote":"Fix error in specified configuration path for NATS port number"},{"SimCorpReference":"D-80657","ChangeNote":"It should be visible on a holding that it has participated in the duration hedging step both as \u0022Duration hedging\u0022 holding and as \u0022Exposure increasing\u0022. We will indicate this in the Selection column via the \u0022mark\u0022 \u0027HD\u0027","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-79297","ChangeNote":"Fix disappearing  BM positions (client specific) in Portfolio sheet while the job is being executed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80296","ChangeNote":"Fix issues with AM formulas in Current Position API","Products":["CsCode-Basic","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80764","ChangeNote":"Capton should be taken into account on updating grid column."},{"SimCorpReference":"D-80821","ChangeNote":"There is the technical change that does not effect any customer installations."},{"SimCorpReference":"D-80787","ChangeNote":"Fi x refresh AM SAAM data by batch job groups","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80158","ChangeNote":"Capability to override max page size for ims-api","Products":["Business-Match","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-80698","ChangeNote":"Special characters in the property values of the Formula Attribute are now  escaped properly by the compiler","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80719","ChangeNote":"CDS-specific fields for simulations and orders did not contain any values when used from the Current Positions-Api","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80200","ChangeNote":"Fixes crash by importing Report Properties","Products":["Business-Reporting"]},{"SimCorpReference":"D-80723","ChangeNote":"The length of the literals vector determines if multiple datasets are used or a single query is issued","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80827","ChangeNote":"Change Axioma View Id title","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-80530","ChangeNote":"Fixed issue with autonomous inserts  in APL using UP DBI (outside transaction scope)","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80369","ChangeNote":"Fixed issue with logging incidents with long header having space at position 80","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80769","ChangeNote":"Fix for TaskCanceledException during Draining of Session","Products":["CsCode-UP"]},{"SimCorpReference":"D-80552","ChangeNote":"Fix problems with message broker discovery when message broker is restarted"},{"SimCorpReference":"D-80836","ChangeNote":"Technical/3T: If there was a mix of \u00222T rows\u0022 and \u00223T rows\u0022, changing a value in a newly created  \u00223T row\u0022 could cause wrong data updates from BL code.","Products":["Framework-InternalApplicationFramework"]},{"SimCorpReference":"D-80516","ChangeNote":"Accept outer join as valid field path join","Products":["CsCode-UP"]},{"SimCorpReference":"D-80536","ChangeNote":"Fixed discrepancy between the old and new stack for dbInsert2Sql","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80427","ChangeNote":"Fix the inability to run parallel load plans with a fund scope being applied","Products":["Business-DWH","CsCode-Reporting"]},{"SimCorpReference":"D-79910","ChangeNote":"changing the loading data approach while opening strategy in Amend  to show correct data state"},{"SimCorpReference":"D-80335","ChangeNote":"Updates for log message creation.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80088","ChangeNote":"Change exception to a more self-explanatory one.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-80671","ChangeNote":"Handled issue with selecting empty blobs","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-79500","ChangeNote":"Fixed calculation of I-spread for forward started bonds/swaps and/or bonds/swaps which are interest only or have non-bullet redemption structure. For bonds/swaps priced with zero coupon yield curve, swap rate on bond/swap maturity is calculated from zero coupon yield curve using syntethic swap which has the same payment dates and coupon terms as original one, but bullet redemption. For forward started bonds/swaps, swap rate is calculated on bond/swap effective(start) date.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-80688","ChangeNote":"3T/Technical: As a unintended side effect of D-80390, dynamic popup menus were not included the first time a popup menu was requested.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80831","ChangeNote":"When sending blob id\u0027s to azure service bus, no bus was defined, leading to a crash.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80519","ChangeNote":"Fixed issue with nested aggregate functions","Products":["CsCode-UP"]},{"SimCorpReference":"D-80606","ChangeNote":"There was an error, when after applying autofill rules \u0027Show manual changes\u0027 pop-up showed changes for the field \u0027Reconciliation free code 5\u0027, even when there were no changes for that field (Previous value = New Value = \u0027\u0027(empty)). This error has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-80136","ChangeNote":"Optimize cash bucket assignment when booking new holdings in FO holdings.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-79295","ChangeNote":"Optimizing database queries in the AI Manager area.","Products":["CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-80512","ChangeNote":"Complex matching for e.g. Swaps cold wrongly fail with the error message \u0027Identifier fields do not match or match setup details were not found for an instrument specific match field.\u0027\u0027. This has been fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-80803","ChangeNote":"Fixed integrated Order service discovery of Message  broker"},{"SimCorpReference":"D-79861","ChangeNote":"Auto-allocation fails for CDS block orders with \u0022Allocation will result in an over-allocation\u0022"},{"SimCorpReference":"D-80459","ChangeNote":"To fix a program error that occurred in CAM/Elections if to use Audit trail functionality","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80485","ChangeNote":"\u0027Aux. message sub-type\u0027 caption has been made more understandable.","Products":["Business-Match"]},{"SimCorpReference":"D-79989","ChangeNote":"To fix an issue when not all transaction legs are removed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80126","ChangeNote":"The Performance Calculation now creates synthetic payments for CDS positions that have Position Netting CDS transactions. The transaction closes the positions that should be netted and creates a single new netted position. The transaction does not create any real payments and thus synthetic payments should be created to account for the change in market value.","Products":["Performance"]},{"SimCorpReference":"D-80564","ChangeNote":"GetOrders API can now use roles authorization","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80390","ChangeNote":"3T: Not all type of grid popup menus were handled correctly.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80568","ChangeNote":": Update to the code that initializes cached objects for the Securities Finance Manager. The fields from tTRANSFACILITY for loan facilities data are already excluded in this context but the field ‘Unsettled Trade External Link’ (fpUNSETTRADEEXLINK) was forgotten (S-164336). It should be excluded for the time being.","Products":["Business-SecuritiesFinanceForecast"]},{"SimCorpReference":"D-80475","ChangeNote":"When running the \u0027Corporate Actions Manger\u0027 dashboard service ORA Integrity constraint error could appear. This has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80678","ChangeNote":"A program crash occurred when trying to import a entry of type INVSTRDEFS. This has been corrected.","Products":["Business-Modelling"]},{"SimCorpReference":"D-80524","ChangeNote":"Use HelpUtilities to create a help URL.","Products":["CsCode-Framework","CsCode-HelpUtilities","Framework-GuiFramework"]},{"SimCorpReference":"D-80440","ChangeNote":"When trying to delete a \u0027Payments Security Defaults\u0027 transaction having \u0027Forced Closed transactions\u0027 an error could occur. This has been fixed.","Products":["Business-Cash"]},{"SimCorpReference":"D-79095","ChangeNote":"What are the problems/motivations for the changes?\nWhen making partial reallocations for positions with a high number of tax lots then a rounding check could end up putting a too big correction on single tax lot. By too big it is meant above 2 times the smallest unit of the currency e.g. 0.02 for EUR or USD). This would cause the golden equation to fail for the corrected tax lot.\nSecondly reallocation values for Initial Premium and Discount values could become incorrect.\nThirdly if a tax lot had an incorrect value for Balance Initial Premium and Discount and was fully sold a check would be made which could cause Balance Initial Premium and Discount not to go to zero on the tax lot.\n\nWhat is the proposed solution?\nFirst the rounding check has been improved so a single lot will not get more than 2 times the smallest unit of the currency. Then later golden equation checks on individual tax lot level will be able to ensure that the golden equation holds per tax lot. As a consequence the rounding check for reallocations will affect more tax lots.\nSecondly a correction has been made to ensure correct reallocation values for Initial Premium and Discount values.\nThirdly a correction has been made so a check on Initial Premium and Discount values is not executed for fully sold tax lots.","Products":["Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-80692"},{"SimCorpReference":"D-80510","ChangeNote":"Fixed length of message being displayed in popup window from scd.exe as it would be truncated"},{"SimCorpReference":"D-80507","ChangeNote":"The use of tax lot characteristic formulas for formula finance fields did not work for elimination accounting. The error has been corrected.","Products":["Business-GeneralLedger","Business-InitialMarginRequirement"]},{"SimCorpReference":"D-80520","ChangeNote":"Do not use APL tool function in application code.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-80299","ChangeNote":"AM cache should not return simulations when IncludeSimulations is not specified in the create job request","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80173","ChangeNote":"Fix several bugs in processing of programs in OM AzSB messaging"},{"SimCorpReference":"S-179854","ChangeNote":"Fields domain"},{"SimCorpReference":"D-77030","ChangeNote":"An error could occur in the \u0027Covariance Manager\u0027 in case \u0027Merger\u0027 \u0027Corporate Actions\u0027 existed for at least one of the by the \u0027Risk Factor\u0027 implied securities. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-80186","ChangeNote":"Checking for connection string format and content type when destination type is storage and display errors","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80593","ChangeNote":"SystemCapabilities results contain only commands, excluding requests. In this defect we\u0027re introducing to the response the missing requests."},{"SimCorpReference":"D-80489","ChangeNote":"3T: Cleanup ReceivingTimerEvent flay if handling of the timer event crash.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80070","ChangeNote":"Calculation of Amortised currency correction PC is no longer expected for Equity Accounting Business Model Reclassifications.","Products":["Business-EquityAccounting"]},{"SimCorpReference":"D-80141","ChangeNote":"For CDS block orders Ready to Allocate flag calculation need to take into account only lines with non zero quantity as Confirmation and Allocation reports are being sent only for those portfolios."},{"SimCorpReference":"S-180559"},{"SimCorpReference":"D-79224","ChangeNote":"Apply change for distributions with effect on negative book value in 24.10","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-80356","ChangeNote":"No change in user facing functionality.  Updated various unit tests to make them more stable","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-181030","ChangeNote":"For XpressInstruments, the calculation of Equivalent Life, WAL, and WADP has been improved such that instruments with payoffs in the form of a ratio (like S_t/S_0) are handled better.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-80360","ChangeNote":"Investigate and locate unit tests with an issue.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement","XpressInstruments"]},{"SimCorpReference":"D-80155","ChangeNote":"Minor corrections to Messaging Endpoint Configuration window","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-79643","ChangeNote":"When \u0027executing\u0027 \u0027Risk Measurement\u0027  on a \u0027Calculation Service\u0027 an assertion error could occur in case specific errors occurred during the risk calculation and if no alerts to be written were available. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-79912","ChangeNote":"Relevant FX Swap quantities are calculated during import fills process."},{"SimCorpReference":"D-80190","ChangeNote":"Add case for Cancel/Cancel Replace"},{"SimCorpReference":"S-179906","ChangeNote":"Changed \u0027Max. age of expired portfolios to be shown in the hierarchy\u0027 to \u0027Max. age of expired portfolios and entities to be shown in the hierarchy\u0027 in \u0027Front office options - Compliance\u0027.  This to reflect that this field is also applicable to business entities.","Products":["Business-Compliance"]},{"SimCorpReference":"D-80319","ChangeNote":"Use TiF from portfolio order for FX allocation instructions"},{"SimCorpReference":"D-80143","ChangeNote":"Fix for an unhandled AppDomain exception was caught.","Products":["CsCode-UP"]},{"SimCorpReference":"D-80104","ChangeNote":"Adding new menu for Messaging Endpoint Configuration window","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData","Framework-MenuTree"]},{"SimCorpReference":"D-80521","ChangeNote":"correct OracleDbType","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-79800","ChangeNote":"Ensure that the Message Broker Host URL field on the Order Manager Configuration Window is optional"},{"SimCorpReference":"D-80197","ChangeNote":"Added mapping for additional quote price types on allocation message for repo orders","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80293","ChangeNote":"Close Security group code name field for modification on group code values form.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80534","ChangeNote":"Fix reading query and query parameters","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80359","ChangeNote":"Investigate L1 unit test  in  PortfolioManagement.ManagersWorkBench.Common.Application.Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80358","ChangeNote":"Reenable unit test in Common.GUI.Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80500","ChangeNote":"After D-80298 was fixed we can enable required properties at MPV editor list to run UT VerifyContributionFieldCanBeSelected successfully \u002B enable a few other UTs","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80282","ChangeNote":"Pre-calculation on Front Office Data services causes WS FULL crash in some cases. Fixed.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80260","ChangeNote":"Fix condition of pop-up showing","Products":["Business-Swift"]},{"SimCorpReference":"D-80357","ChangeNote":"Activate disabled L0 in Common GUI Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80189","ChangeNote":"When different \u0027Performance Measurements\u0027 ran on \u0027Calculation services\u0027 in parallel and contained/processed the same holdings in rare cases a DB error could appear. This has been fixed.","Products":["Performance"]},{"SimCorpReference":"D-79964","ChangeNote":"Program auto-aggregation check now considers AllowAggregationOfWorkingOrders option"},{"SimCorpReference":"D-80448","ChangeNote":"This change fixes single prefix given in \u0022Track And Analyse\u0022 functionality. This functionality is available to SimCorp consultant only and has no impact on business functionality.","Products":["Framework-Trace"]},{"SimCorpReference":"D-80298","ChangeNote":"Code generator for editorlist has been updated to define the property object once.","Products":["CsCode-Framework","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80439","ChangeNote":"3T: Running e.g. Transaction Status and trying to request \u0022New Status\u0022 on a transaction, and while running Cancel button were pressed, a crash could occur.","Products":["Framework-Calculations","Framework-GuiFramework"]},{"SimCorpReference":"D-79908","ChangeNote":"Fix booking transactions in case of Return Security, Deliver Security of Cassini substitution","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80066","ChangeNote":"Forecast are split pro rata to the individual positions for the case when the JSON doesn\u0027t contain information about underwriting/model portfolio.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-80002","ChangeNote":"Rollback attempt to fix view update order","Products":["CsCode-Accounting","CsCode-Framework"]},{"SimCorpReference":"D-80503","ChangeNote":"Remove using Name in Id field in some transporters, using Key instead","Products":["CsCode-Framework","CsCode-MiddleOffice","CsCode-PortfolioManagement","CsCode-OrderManager"]},{"SimCorpReference":"D-80058","ChangeNote":"AutocompleteEnumerator doesn\u0027t count start by and sorting featues. These are implemented in GetNext() method","Products":["CsCode-Framework"]},{"SimCorpReference":"D-79638","ChangeNote":"Put needed UCRT DLLs to installation back","Products":["Valuation","Framework-CompFiles","Tools-Repository"]},{"SimCorpReference":"D-80138","ChangeNote":"N/A Fix of internal method for tests purposes - testBrick_DataInsMargManDefaults_Insert","Products":["Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-80092","ChangeNote":"The issue with the erroneous exclusion of instruments with missing MID is fixed.  Descriptive models without MID applied. Plus models are proxied to cash if the underlying MID is missing.","Products":["Business-Risk"]},{"SimCorpReference":"D-80102","ChangeNote":"Some issue was found after test of S-177616 Api finalization strory. Fix on this defect","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-80101","ChangeNote":"Added missed validation for correct Margin Call Process","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80172","ChangeNote":"Added better error message in case APL property is null.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80176","ChangeNote":"Redesign user managing process not to have unnecessary logs in Appinsight.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80028","ChangeNote":"Add Log info to Cash Transfer","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80219","ChangeNote":"The \u0027Position Calculation\u0027 could crash in case it was calculating  \u0027Accounting analytics\u0027 for \u0027FX Forwards\u0027 and in case not all \u0027Balance fields\u0027 were to be calculated and we were not calculating \u0027restricted analytics for reinvestment\u0027. This has been fixed.","Products":["Business-PortfolioCalculation","Business-Risk"]},{"SimCorpReference":"D-78731","ChangeNote":"Roll back of fix by D-75584 that was based on an wrong assumption of how portfolio booking date should work in portfolio calculation.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"S-176348","ChangeNote":"Process the forward starting coupons at HE, pass the new Effective rate from inception date to the scecKeysLog for p2p prices. Move discard fixings to the 2nd loop of hedgeKeyRatGetKeyRat, just before the p2p prices are calculated - corrected side effect. And process the special case when the designation date is before the \u00271st coupon from\u0027 date","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-79981","ChangeNote":"Fix the communication error","CustomerApplyNote":"Fix the communication error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80112","ChangeNote":"Certain SimCorp types caused Oracle errors on inserts. This error have now been fixed.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80492","ChangeNote":"merge to 25.01","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80278","ChangeNote":"In very rear cases Night job was running instead of Date rolling on FOH services. It happens, when the check is running very close to mid night. The issue is fixed.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80041","ChangeNote":"No Business logic changes. Updates for test setups.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80217","ChangeNote":"When saving an already existing e.g. \u0027LendSec\u0027 transaction one more time in the \u0027Dealer Securities Lending\u0027 window the \u0027Elm. Trans. No\u0027 of one leg was wrongly overwritten with the \u0027Elm. Trans. No\u0027 of another leg. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-79831","ChangeNote":"[TECH/3T] - handled data requests in 3T that occur at the same time with timer events - the request is ignored when triggered by a timer function","Products":["Business-FundAccounting","Framework-ApplicationFramework","Framework-CoreFramework"]},{"SimCorpReference":"D-80285","ChangeNote":"Changing of branch that is used in imsVcsRoot.kt in closed version"},{"SimCorpReference":"D-80149","ChangeNote":"Technical 3T","Products":["Business-PortfolioCalculation","Framework-GuiFramework"]},{"SimCorpReference":"D-80154","ChangeNote":"BJ auto allocate collateral: address the issue during BJ execution. BJ was completely stooped if run against invalid RecallReceive margin call.","Products":["Business-Collateral","Business-Match","CsCode-Collateral"]},{"SimCorpReference":"D-79943","ChangeNote":"Fixed Benchmark IDs and Names not being displayed for not compressed BM lines when Benchmark Compression is On","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80306","ChangeNote":"Updated the column so empty fields are treated as the \u0022None\u0022 type.","Products":["Business-Modelling"]},{"SimCorpReference":"S-179559","ChangeNote":"rename Front Office subj area to Order Management","Products":["Business-DWH"]},{"SimCorpReference":"D-80251","ChangeNote":"Remove Broker List type restriction from BR service","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-80372","ChangeNote":"3T: If several tabs were open, system could loose track of which form has focus, e.g. when updating data in a field that already had focus when the tab was selected in the browser.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80135","ChangeNote":"3T: Second level tabs were visible even when they shouldn\u0027t (e.g. due to authorization).","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80196","ChangeNote":"3T: Output grids without append rows allowed, should not show any rows in the grid","Products":["Framework-GuiFramework","Framework-InternalGuiFramework"]},{"SimCorpReference":"D-80233","ChangeNote":"3T: Grids with dynamically created fields could fail for some specific applications (e.g. \u0022Payment Reconciliation\u0022)","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-80281","ChangeNote":"Fixed issue with scrolling and focus in Select Fields panel"},{"SimCorpReference":"D-80177","ChangeNote":"For \u0027Call money\u0027 positions, if the last interest payment did not fall on the same date as the maturity date, and if the forecast in \u0027Portfolio Calculation\u0027 the \u0027started on a date after the trade date of the last interest date, the expected CloseCallM transaction was not simulated. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-80140","ChangeNote":"Adding support for ≥, ≤ and ≠ operators","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-Trading","CsCode-UP"]},{"SimCorpReference":"D-80228","ChangeNote":"Margin Manager =\u003E Margin Call Tracer applet: Allocation status field of Margin Call result with RecallReceive action was not properly updated after execution of Allocate via Simplex has been done.","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-180073"},{"SimCorpReference":"S-179357","ChangeNote":"Move data to AIDE_MASTER, corrected AggregationResults.Integration tests results"},{"SimCorpReference":"S-179779"},{"SimCorpReference":"S-178329"}]