[{"SimCorpReference":"D-93543","ChangeNote":"When working with Multiple payment screen the settlement defaults with other bank accounts are shown. Has been fixed.\n\nThis was earlier working for other screens where bank account is an instrument, but not for Multiple payments.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"D-93458","ChangeNote":"UDKR contributions/distributions could be calculated incorrectly in the AM Cache if the setup specified that weights should be calculated per mandate/portfolio and the set of requested fields did not contain any regular contribution and distribution fields.  Only an issue if the none of the rows in the data selection has \u0027Treat as one mandate\u0022 checked","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92831","ChangeNote":"Corrected issue where put/call dates used for key ratio calculations were not generated properly","Products":["Valuation"]},{"SimCorpReference":"D-93161","ChangeNote":"Fixes a potential crash that could happen in the Calculation service when called through the STP service.","Products":["Business-Transactions"]},{"SimCorpReference":"S-218637","ChangeNote":"CDS single name: do not validate termination date against tenor when reusing Security ID","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-93447","ChangeNote":"The performance when calculating \u0027Key Ratio mapping Formulas\u0027 was very slow. This has been fixed.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-93348","ChangeNote":"Bring back application of SSI during Recalculating Closing Transactions job","Products":["Business-AdministrativeSecurityTransactions","Business-DealerOTCTransactions","Business-Transactions","Framework-CoreFramework"]},{"SimCorpReference":"D-92025","ChangeNote":"Fixing historical VaR aggregating issue.","Products":["Business-Risk"]},{"SimCorpReference":"D-93623","ChangeNote":"portalIdAvailable did not return the right results","Products":["Framework-Authorisation"]},{"SimCorpReference":"S-187178","ChangeNote":"A new batch task named \u0027Generic Decomposition - Upload Results\u0027 is now available in the Batch Job window. The new batch task prepares data files with decomposition data that enables decomposition of funds in the Investment Analytics Platform. The data is based on the \u0027Generic Decomposition - Calculate\u0027 batch job."},{"SimCorpReference":"D-93066","ChangeNote":"Guard fetching data and add trace statement if exception happens for DeltaVectors","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92906","ChangeNote":"Fixing problem with CustomAttributes Values for PortfolioGroup were not populated when there is no initial balance in the CashViewer Applet.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92403","ChangeNote":"It has been corrected to not crash on zero or close to zero discount factors.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-93564","ChangeNote":"Parametric VaR was not calculated due to not existing setting \u0022Disable FX Option adjustments\u0022 in Asset  Manager and Compliance Manager. Crash has been fixed, and now Parametric VaR is calculated","Products":["Business-Risk"]},{"SimCorpReference":"D-93468","ChangeNote":"Only relevant STP service configurations are displayed when \u0027Explain Unmatched\u0027 button is clicked in \u0027Match\u0027 window; specific service instances won\u0027t be present in the list.","Products":["Business-Swift"]},{"SimCorpReference":"D-93546","ChangeNote":"CDS Security IMW Dimension - condition for CDS moved to extra tab in DEX"},{"SimCorpReference":"D-92799","ChangeNote":"To fix an error with incorrect General Approval status in CAM when there is one of the holdings with blocking. Relevant for UBS only","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-92678","ChangeNote":"Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation could use old Model Portfolio Components after they were released from Asset Manager and MPC comments are used. Latest components are always used after this change. Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation is performed after MPC comments are saved.","Products":["Business-Modelling","Business-PortfolioManagement","CsCode-FrontOfficeData"]},{"SimCorpReference":"S-214356","ChangeNote":"Migrate SQL Server to the new landing zone."},{"SimCorpReference":"D-93372","ChangeNote":"Orders auto-allocated outside of schedule when automation service is running for multiple days. fixed"},{"SimCorpReference":"D-93495","ChangeNote":"After doing \u0027Truncate business data\u0027 some database constraints could be missing (disabled). This has been corrected.","Products":["Business-TruncateBusinessData","Framework-Database"]},{"SimCorpReference":"D-93340","ChangeNote":"In case of reversals Reconciliation result is updated with new payment reference. Now a reference to active transaction is updated as well.","Products":["Business-Cash","Business-Reconciliation"]},{"SimCorpReference":"D-92664","ChangeNote":"Assign \u0027Undefined\u0027 value in case when Group code value is empty","Products":["Business-Risk"]},{"SimCorpReference":"D-93074","ChangeNote":"Use the same rounding rule for the Price field in the Amend Allocation form as in Allocation."},{"SimCorpReference":"D-91993","ChangeNote":"Only active messages that take into account  the \u0027Official CA Event Reference\u0027, are considered as the basis for MT565 creation","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86254","ChangeNote":"Search for Apl core during DEX in BPAAS infrastructure.","Products":["Framework-CoreFramework","Business-TransactionBookingAccounting","Framework-Database","Framework-XML"]},{"SimCorpReference":"D-92402","ChangeNote":"Fixed pricing of swaps with payment lag in yield curve estimation using  Bootstrap method.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-93044","ChangeNote":"The system performance in the Compliance Manager was improved by avoiding unnecessary database queries in the Rule Entry and Lists window. Opening rules with lists should now be faster.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92647","ChangeNote":"Show execution Plan was not working in some cases when using an OAuth schema","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-93451","ChangeNote":"The batch job \u0022OTC Instruments - Validate All\u0022 will process transactions, which have some data in at least 1 of 5 grids: Payment Business Centre, Valuation Business Centre, Fixing Business Centre, FX fixing Business Centre, FX Convention Fixing Business Centre","Products":["CsCode-Trading"]},{"SimCorpReference":"D-90039","ChangeNote":"Fixed a crash that occurred when both legs of an FX position were not present while using an advanced accounting view","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92069","ChangeNote":"Adding MDST calculation data for Market Data Stress Test Import Configuration","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-93270","ChangeNote":"Update of autotest. This will not affect any customers.","Products":["Framework-Services"]},{"SimCorpReference":"D-92670","ChangeNote":"Summation of weight fields were not calculated when doing subtotals via the Asset Manager Cache Api when the setting \u0022Distribution figures per portfolio/mandate\u0022 were on and the group contained multiple portfolios.  Weight fields are fields like distribution- and contributionfields (including the UDKR-variants). The calculation has now been aligned to use the same simpler principle across the Asset Manager and its API\u0027s","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92704","ChangeNote":"Decrease memory consumption in MO Aggregation Calculation for case of total aggregations and non relative analytics","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-92625","ChangeNote":"Correct the issue with erroneous error message in RAM when the Stress test scenarios has been changed (for example, added new one) and recalculated at RF Scenarios and Risk Measurement","Products":["Business-Risk"]},{"SimCorpReference":"D-92643","ChangeNote":"Add tags 9610. 9611, 9612 and 9613 to the Quickfix dictionary used in NOMA."},{"SimCorpReference":"D-93301","ChangeNote":"A crash happened when saving the order after selecting a predefined comment via F4 in the \u0027Multiple Portfolio Orders\u0027 window. This has now been corrected.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"S-217357","ChangeNote":"There was an error in the calculation  of the clean price from dirty price used in the calculation of YTM key ratios on the main contract for inflation swaps. This was corrected.\n\nTrade Manager: Swaptions could get redundant validation error on save:  \u0022Direction is a mandatory field and must be specified\u0022. It was fixed.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-93180","ChangeNote":"Compliance Post-trade calculation: \u0027Nothing to check\u0027 results falsely returned when validating rules with Year-to-Data P/L cost attribute together with other rules, without this property - or when validating transaction rules with a different accounting framework defined than the \u0022default\u0022 framework. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-93256","ChangeNote":"fix npm audit"},{"SimCorpReference":"D-88777","ChangeNote":"Fix deadlock during multiple block trade allocations coming.","Products":["Business-PortfolioManagement","TradeManager","Framework-MessageQueue"]},{"SimCorpReference":"D-91690","ChangeNote":"Additional validation for Data Extraction Definition Formulas has been added","Products":["Business-DEX"]},{"SimCorpReference":"D-93080","ChangeNote":"API Gateway\u0027s embedded .net runtime was upgraded to version 8.0.21"},{"SimCorpReference":"D-93103","ChangeNote":"After appearance of new CDS orders in AM all applets refresh custom fields information except Cash Viewer applet.\nAs a result, custom fields in cash viewer might be empty in some specific cases. Fixed. Now we refresh custom fields in Cash Viewer applet after new CDS orders event.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92415","ChangeNote":"Alternative investment asset fields relating to currently disabled functionality could be mapped for import in the \u0027Data import rules\u0027 window. The fields are now hidden.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-92619","ChangeNote":"Handling Lock not obtained db error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-93205","ChangeNote":"Correction to the code that calculates values on basket and TRS level for adjustment transactions. The identification of the relevant security data adjustments is updated for the calculation of closed notional.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-92545","ChangeNote":"Batch task = Performance Calculation - Upload Results: Improved system performance during initialization phase.","Products":["Performance"]},{"SimCorpReference":"D-93017","ChangeNote":"Flaky test ignored"},{"SimCorpReference":"S-213624","ChangeNote":"Patch of enabling SWIFT MX for Securities Netting","Products":["Business-Netting"]},{"SimCorpReference":"D-92404","ChangeNote":"Correction to the definition of interest periods for straight repos having a repo interest type ‘Variable’ in certain scenarios.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-90845","ChangeNote":"New random method - random by risk factor for MC generation option were added. This new method is considered to be applied for scenarios where the MC scenarios have to be preserved for the same risk factor IKs with the same seed value and the same risk factor selection ID.","Products":["Business-Risk","Valuation","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-91934","ChangeNote":"When reconciliation copies break ids from previous execution it uses several lines in case of funnel instead of using just one line id.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-92716","ChangeNote":"The log warning issued by the Business rules alert service when more than 10,000 open alerts exists across all domains has been ensured","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-92095","ChangeNote":"Corporate action dashboard service: add logging in case of retries due to deadlock","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-92827","ChangeNote":"Fix for a compliance-related error regarding missing external values in rules assigned to model portfolios.\nExternal value definitions with \u0022Scope = Model Portfolio\u0022 were not included in compliance validations when the rule was assigned to a model portfolio.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92758","ChangeNote":"Make database selects in Aggregation calculation Init phase faster.","Products":["Business-Risk"]},{"SimCorpReference":"D-92560","ChangeNote":"A fix for the Create Future Transactions window so that special close out transactions use the number of fixing days from static data as the number of settlement days for the transaction","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-92680","ChangeNote":"Classic FX Forward should not show FixingDate value instead of ValueDate"},{"SimCorpReference":"D-92700","ChangeNote":"Position Calculation: Make WS requirements lower in residual loop","Products":["Business-Risk"]},{"SimCorpReference":"D-92956","ChangeNote":"The Business rules alert service now updates the timestamp for last processing time more frequently to avoid the Business rules alert service wrongly being shutdown by the Service Platform","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-92951","ChangeNote":"After removing the configuration parameter \u0027Nominal framework methods enabled\u0027 in \u0027Show Installation Parameters\u0027 =\u003E \u0027\u0027Transactions\u0027 in 26.01, the CBU error was revealed when testing an upgrade to 26.01 as a preview drop. To avoid it, the usage of the configuration parameter is now disregarded in the lower versions. This will not affect the customers installation, since the functionality has been already enabled by default earlier.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-92751","ChangeNote":"Fixed problem with missing benchmark data for rules assigned to model portfolio node s beneath funds","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92864","ChangeNote":"It was not possible to auto-allocate options with default counterparty. This is fixed now."},{"SimCorpReference":"D-92744","ChangeNote":"Extend the scope of custids","CustomerApplyNote":"Extend the scope of custids","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-92595","ChangeNote":"improve performance of webclient using cache of icons"},{"SimCorpReference":"D-75745","ChangeNote":"This is a customer specific correction, which will NOT affect other customers.","Products":["Business-Connectivity"]},{"SimCorpReference":"S-212403","ChangeNote":"Added Managed Identity connection type for AM cache services","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-91918","ChangeNote":"DWH: Optimize DML statements used for loading versioned tables in Snowflake","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-92116","ChangeNote":"In rare cases it could happen that when distributing ccy adjustments to multiple payments, large values would appear in the \u0022Ccy adjustment PC\u0022 column of the \u0022Payment reconciliation\u0022 form. This was due to wrong rounding logic and has been resolved.","Products":["Business-Cash","Framework-CoreFramework"]},{"SimCorpReference":"D-92674","ChangeNote":"Do not create extraction definitions for standard base marts if subject areas of those are not installed.","Products":["Business-DWH"]},{"SimCorpReference":"D-92630","ChangeNote":"Enhance error message about problem with reading file with error returned by operating system","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-92633","ChangeNote":"Fixed an issue in handling of group code changes that could cause a freeze of the Asset Manager or Asset Manager Cache","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92644","ChangeNote":"Added a hint to the main query used by the Asset Manager Calculation service to read holding data.  In some situation it did not pick the correct execution plan which could lead to slow database queries","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92392","ChangeNote":"Stock loan fee transactions for CFD positions wrongly updated the holding field date latest coupon. This caused issues when trying to create a  proceed transaction at an earlier date than the stock loan fee transaction. The error has been corrected.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-92771","ChangeNote":"change source for EFFECTIVE_DATE in BF_TRANSACTION to indicate TRANSMAIN.INTBEGDATE"},{"SimCorpReference":"D-92741","ChangeNote":"The Valuation date was not updated by the \u0027OTC-Validate all\u0027 batch job when an additional holiday day appears in the relevant holiday calendar, in case more than one Index swap TM  transaction exists per security. Transactions for update are now searched using the transaction number field (instead of the security ID) (Changed key field (Security ID -\u003E Transaction Number) to process transactions)","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92525","ChangeNote":"Client specific change which prevents the STP flow to be interrupted by errors that client wants to ignore, when using Calculation Services.","Products":["Business-ToolsTransactions","Business-Transactions"]},{"SimCorpReference":"D-91867","ChangeNote":"Hide Fixing date for non deliverable FX Allocate"},{"SimCorpReference":"D-90429","ChangeNote":"The Rule entry - Credit Risk fields Collateral, issuer risk and Collateral, cpt. risk have now been re-enabled for holding base rules.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92561","ChangeNote":"Holdings missing in results when assignment units with different PKR setting/FX rate price type are calculated together post-trade. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91932","ChangeNote":"Corrected a UI issue with brokers icons in the Broker selection combo box in the Quick Place window."},{"SimCorpReference":"D-91217","ChangeNote":"Fix auto-filling price for volume-basis simulations","Products":["Business-PortfolioManagement","Business-Transactions"]},{"SimCorpReference":"D-92308","ChangeNote":"The \u0027Transaction Option\u0027 \u0027Use exchange from static data (derivatives)\u0027 wrongly also was enabled for the \u0027Dealer CFD\u0027 window. Even though on CFD static dat it is not possible to define an \u0027Exchange\u0027. This has bene fixed.","Products":["Business-GeneralTransactions"]},{"SimCorpReference":"D-91258","ChangeNote":"Added CR 626037 to the C# mirror of the decomposition fetch functions such that holding key ik is now respected when it comes to filtering potentially redundant hybrids.","Products":["Instruments"]},{"SimCorpReference":"D-92479","ChangeNote":"Changed loading strategy in Reporting Data Pool application to take more data distributions into acccount.","Products":["CsCode-Framework","CsCode-FundAccounting"]},{"SimCorpReference":"D-91086","ChangeNote":"We fix the Cash Viewer displays Dirty Value (DV) during a Deal Allocation stage of the order lifecycle.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92072","ChangeNote":"Fix for Custom Analytics fact to avoid key violation"},{"SimCorpReference":"D-92131","ChangeNote":"In rare cases, the simultaneous update of group codes for the same securities both locally and on the group code service can lead to a deadlock. This has now been corrected.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-91709","ChangeNote":"Implement the request from OTC API in a separate thread with retries"},{"SimCorpReference":"D-92298","ChangeNote":"Removed or updated package dependencies in the LFT client package.","Products":["CsCode-UP"]},{"SimCorpReference":"D-92179","ChangeNote":"Corrected FIX tag 57 for classic single program orders","CustomerApplyNote":"Fix the value sent in tag 57 for Classic Program Single Orders"},{"SimCorpReference":"D-91403","ChangeNote":"Fetch the Model Portfolios from SAAM along with the MPs from the positions","Products":["Business-Risk"]},{"SimCorpReference":"D-92172","ChangeNote":"Fix side effect of S-148979 where it causes the Include Cash option to be greyed out","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92162","ChangeNote":"Use high precision arithmetic  when  calculating order amounts.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-81271","ChangeNote":"If aggregation was equal to None and using performance figures the Asset Manager could crash in some rare situations.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92474","ChangeNote":"Om should ignore bids received for ETF from TS"},{"SimCorpReference":"D-92207","ChangeNote":"We increased risk factor name field length when writing to volatility and correlation files","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-92329","ChangeNote":"Validation should be removed for allocate command."},{"SimCorpReference":"D-92256","ChangeNote":"Created a new batch task to stop all continuous AM cache jobs","Products":["Framework-Batch","Business-PortfolioManagement"]},{"SimCorpReference":"D-92276","ChangeNote":"Solve referenced child record crash in risk alert cleanup","Products":["Business-Risk"]},{"SimCorpReference":"D-91379","ChangeNote":"Making reconnect more robust and not throwing as many error logs","Products":["Framework-Database"]},{"SimCorpReference":"D-92352","ChangeNote":"Incorrect loop creation in Position Calculation in case more than 100.000 holdings","Products":["Business-Risk"]},{"SimCorpReference":"D-88727","ChangeNote":"When streaming data from AM Cache we used to send all rows if there was a group code change or an order fill - now we only send the affected rows","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92176","ChangeNote":"Fix the error where the ExchTraded model was not applied to derivatives, even though ExchTraded is a valid primary model for them.","Products":["Business-Risk"]},{"SimCorpReference":"D-91383","ChangeNote":"Fixed authorization for \u0022Mandate default - Portfolio group\u0022 field in Data Selector","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92056","ChangeNote":"If the shutdown of the AM Cache service took longer that the \u0027grace period\u0027 (normally 5 minutes) a job currently being processed could be left as Executing.  Now it will have state Completed (even if no data has been produced).  Furthermore the Delete (job) api has been extended with an optional Force parameter that allows deletion of any job","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92363","ChangeNote":"No functional changes. fixing tests"},{"SimCorpReference":"S-185384","ChangeNote":"SQLs executed from the Settlement Dashboard are using a lot of resources on the database. This has been optimized","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-90425","ChangeNote":"For Total Return Swaps with quote factor different than 100, the rates were wrong for the sub-fixing of \nthe non-TR leg on the period end date.","Products":["StaticData"]},{"SimCorpReference":"D-87431","ChangeNote":"A code change has been made to improve stability and authentication when testing batch processing of market data validation queues in internal installations. This change will not impact any external clients.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-92157","ChangeNote":"The code checking if a command is installed has been optimized.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-89654","ChangeNote":"Client specific correction that relates to calculation of statistical key ratios in Performance Measurement, Performance Manager and Performance Reports.","Products":["Performance"]},{"SimCorpReference":"D-91700","ChangeNote":"The performance of STP \u0027Matching\u0027 Payments\u0027 has been improved.","Products":["Business-AuxJobTransactions","Business-Match","Business-Swift"]},{"SimCorpReference":"D-92018","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations","Products":["CsCode-SimTest"]},{"SimCorpReference":"D-91722","ChangeNote":"Error on refresh position in CM has been fixed","Products":["Business-Collateral"]},{"SimCorpReference":"D-91936","ChangeNote":"APL is on a single thread, so the static \u0022caches\u0022 are reused on a second call. These caches must be cleared in case of data has been updated by user after the first batch job run.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91926","ChangeNote":"Add hint to database query selecting related pre-trade results for alerts.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91507","ChangeNote":"All authorization profiles that a user has been assigned to via different roles should be taken into account when evaluating if a user has access to a data selection.","Products":["CsCode-Framework","CsCode-FrontOfficeData","CsCode-FundAccounting","Instruments","CsCode-PortfolioManagement","CsCode-Settlement","CsCode-Workflow","Framework-Authorisation","Framework-CoreFramework"]},{"SimCorpReference":"D-92068","ChangeNote":"Providing wrong credentials should not result in an errorlog/crash, but rather a handled exception.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-91987","ChangeNote":"When result monitor applet shows a lot of results (several thousands) and a lot of results were changed in DB (\u003E 5000) then Reconciliation manager froze for several minutes.  This was fixed and now refresh goes much faster","Products":["Reconciliation"]},{"SimCorpReference":"D-90652","ChangeNote":"Improved performance of Alerts Inbox in System Manager by optimizing processing logic of inner DB selects.","Products":["CsCode-Settlement","Reconciliation"]},{"SimCorpReference":"D-91094","ChangeNote":"The \u0027Save effect details\u0027 check box in Performance Measurement controls if risk factor sensitivities and factor changes should be aggregated into the measurement tree and saved to the result tables. The user is asked if existing details data should be deleted when changing the check box selection. But nothing was deleted even if the user chooses to delete. This error has been corrected so the sensitivity and factor change data that is toggled by the check box is deleted if the user chooses to delete.","Products":["Performance"]},{"SimCorpReference":"D-91650","ChangeNote":"In the \u0027Portfolio Calculation\u0027 \u0027Simulated unrealised hedge depreciation QC/PC\u0027  was not calculated in case a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"S-212968","ChangeNote":"NZD Business center was added in 25.10 SCD version. With this change we have patched NZD Busines center to lower versions, down to 24.07. Patch includes the reference to an updated version of ccdsmktdata.dcf in external-files.json. This will update the business centers list with with only one new record for 1 NZBD business center."},{"SimCorpReference":"D-91852","ChangeNote":"When loading an existing AVD setup, if the first line contains a non-default command, the rules were displayed incorrectly. Aso, when saving the AVD setup, the cursor was moved to the last command, which caused the list of rules to be displayed incorrectly. This has been fixed now.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91708","ChangeNote":"Improved performance of Alerts Inbox: updated how the system reads reconciliation runs so the database can find each run in one quick step, speeding up queries and reducing load times.","Products":["Reconciliation"]},{"SimCorpReference":"D-91799","ChangeNote":"Classic FX Forward should not show FixingDate value instead of ValueDate"},{"SimCorpReference":"D-91923","ChangeNote":"Technical changes related to the Compliance Partitioning. The value for CMPLRESTYPE field in the reporting helper table CMPLREPDETAILS has been corrected.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90783","ChangeNote":"We have fixed an issue where the status in the General election status field was incorrectly updated, when a corporate action event was transferred to static data in the Corporate Actions Manager. This is done by removing zero balance holdings when the status in the General election status field is defined.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91201","ChangeNote":"DWH: Fix user marts ignoring cutoff values when being loaded incrementally","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-91408","ChangeNote":"Rounding for Interest in Securities Lending Maturity transaction window was corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91647","ChangeNote":"Fixed  sticky session behavior when connectiontarget is \u0022*\u0022 and downstream service agent was changed"},{"SimCorpReference":"D-91566","ChangeNote":"Technical changes in Compliance calculation. Incorrect holding reference was used for Flex Analytics in Compliance Rules assigned at aggregate levels","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-88825","ChangeNote":"Fixed Nominal in Modify position window to respect current Percentage change on Incremental update","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90975","ChangeNote":"Raise status from Warning to Error for Extraction object is not validated message for Extraction Exporter Definition.","Products":["Business-DEX"]},{"SimCorpReference":"D-91248","ChangeNote":"The summary type for alphanumeric custom fields is now Unique","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91692","ChangeNote":"Crash in Risk Measurement/Performance Calculation/Position calculation in case of decomposing hybrid funds. Was fixed","Products":["Business-Risk"]},{"SimCorpReference":"D-91822","ChangeNote":"Make Workspace size requirement lower for position calculation decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-91593","ChangeNote":"When \u0027Executing \u0027 a \u0027Rebalancing\u0027 setup with \u0027Rebalancing type \u0027Currency overlay\u0027 and having \u0027Decompose funds\u0027 checked the error message \u0027You are trying to rebalance a setup containing unsupported instrument type(s)...\u0027 could wrongly also appear for decomposed positions. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-89842","ChangeNote":"Added more info when an rare occurring error happens","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"S-213433","ChangeNote":"Benchmark Aggr Calc IMW Fact - relationships to Portfolio and Benchmark Dims, added new  join to ETL"},{"SimCorpReference":"D-91438","ChangeNote":"For convertible bonds priced with OneLib only tranform the Quoted price method to Theoretical when the discounting cuve was shocked in market data scenarios.","Products":["MarketData"]},{"SimCorpReference":"D-91511","ChangeNote":"Fixed vulnerable version for vite npm package"},{"SimCorpReference":"D-87687","ChangeNote":"Logic specific to a single client was removed in Performance Measurement. The logic hard coded the benchmark return to 0% on the first day for new dynamic split value nodes in the Performance Measurement tree.","Products":["Performance"]},{"SimCorpReference":"D-85238","ChangeNote":"When a transaction is modified on a high status with a auxiliary job that has Now (outside commit sequence) then there is a timing issue that can trigger that the cancel job on the reversed transaction is triggered twice. This has been corrected.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"S-210532","ChangeNote":"Patches E-39573 to 25.07","Products":["MarketData","Valuation"]},{"SimCorpReference":"D-91618","ChangeNote":"Correction of programm error found while decomposing. Related to IFRS9 purpose inheritance.","Products":["Decomposition"]},{"SimCorpReference":"D-91485","ChangeNote":"Compliance Post-trade batch evaluation: As significant amount of time was spend evaluating assignment units without any rules assigned, in case the compliance configuration \u0022Active/passive determination enabled\u0022 was set to \u0022Yes\u0022. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91297","ChangeNote":"An error could occur when allocating a block order for Trade Manager instruments that was copied from a previous trade. This issue has now been resolved","Products":["TradeManager"]},{"SimCorpReference":"D-91218","ChangeNote":"The system didn\u0027t detect the right dependencies for User Defined Key Ratios so that the subtotal calculation in the AM Cache Api did not calculate the right numbers if not all  QC/PC/RC fields were explicitly stated","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91418","ChangeNote":"When saving new issue of a Japanese government bond in Asset manager (Simulations/Portfolio sheet applet), the 1st coupon payment date is automatically calculated based on issue date and coupon term \u0026 unit.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87335","ChangeNote":"Not possible to import PRICHECKS entities using \u0027Number of days\u0027 property. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-91257","ChangeNote":"Fixed error in the Order Manager Management service following Daily maintenance"},{"SimCorpReference":"D-91425","ChangeNote":"When a SimCorp Dimension installation have too many open alerts (\u003E 10.000) the Business rules alerts service could become unresponsive during processing of alert changes and therefore were shutdown by the service platform. The error has been fixed. In addition the service now logs a warning before every new change processing  in case the SimCorp Dimension installation has more than 10.000 open alerts.","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-91209","ChangeNote":"Load authorisation cache for pre-trade orders API only once","Products":["CsCode-Compliance","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91445","ChangeNote":"Pre-trade results have grown in size because information irrelevant to the performed pre-trade check is included in the results. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90686","ChangeNote":"Ensure grid properties activated because they contain non-empty data stays active when switching to another layout.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91302","ChangeNote":"This regards transactions from the window ‘Exercise FX Options’ and similar transactions  in the Trade Manager. The calculation of the settlement amount as a sum of amount components should not be altered in the classical window.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-91543","ChangeNote":"In some cases reconciliation payments were generated with wrong portfolio currency. It has been fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-90306","ChangeNote":"FX placement now can be auto-allocated when done for day flag is received"},{"SimCorpReference":"D-84825","ChangeNote":"Fix for Performance Investment Structure fact to avoid empty benchmark or portfolio data in some specific situations"},{"SimCorpReference":"D-90839","ChangeNote":"Communication service, mediator: adding more resilience and logging to internalwebrequest CDL command.","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-91249","ChangeNote":"In the \u0027Portfolio Calculation\u0027 wrongly an error message complaining about missing prices could appear, incase a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-91342","ChangeNote":"Feature switch to use the new Front Office Data service is off by default. As a result, for new client Balancer does not work. Fixed. Now new Front Office Data service is used by default.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"S-198635","ChangeNote":"Added BF_PFC_CASH_FLOW to IMW Model"},{"SimCorpReference":"D-90319","ChangeNote":"When finding the settlement date for an XpressInstrument via Capture Trade in the Order Manager, the holiday calendar specified for the instrument was not taken correctly into account.","Products":["Valuation"]},{"SimCorpReference":"D-90621","ChangeNote":"OM Automation service to use unmanaged oracle driver to be consistent with the rest of OM"},{"SimCorpReference":"S-211926","ChangeNote":"In Trade Manager, authorization was not supported for Portfolio Group fields (only for Portfolio fields), which meant that these fields were always available for all users. The problem was fixed, such that Portfolio Group fields now properly respect the authorization setup here.","Products":["TradeManager","Instruments","XpressInstruments","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"S-211255","ChangeNote":"Patch of CAM: New batch job task for make Net All instructions","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-90320","ChangeNote":"When scrolling over templates in AM Settings Template, Cash Viewer tab display is updating.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90498","ChangeNote":"Avoid 0 qty orders in blotter after merging programs"},{"SimCorpReference":"D-90766","ChangeNote":"When calculating risk factor standard predictive and successive scenarios, the inflation curves risk factors were previously shocked in a way that was inconsistent with other yield-based risk factors. This inconsistency has now been corrected.","Products":["Business-Risk"]},{"SimCorpReference":"D-90089","ChangeNote":"Skip redistribution of carried nominal for internal trade, so it will not be recalculated.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-91052","ChangeNote":"It was possible to create Reallocation Security No into security with incomplete static data. It has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91191","ChangeNote":"rename dex for Fra Security and Future Security dimensions which may cause problems in specific situations"},{"SimCorpReference":"D-91115","ChangeNote":"A database error can occur for appendable portfolio calculation using the \u0022Recalculate changed\u0022 setting. The error has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90638","ChangeNote":"In the Asset Manager (Order Outbox applet), data is not displayed when the user changes the default role. The resolution is to consume the User Context in the Authorization Handler Provider class.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91070","ChangeNote":"The \u0027Economic Benefit\u0027 was calculated wrongly on \u0027Settle Loan Facilities\u0027 transactions. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90553","ChangeNote":"During startup of SimCorp Dimnesion an error could occur where no proper error message was displayed, making troubleshooting  difficult. This has been corrected.","Products":["Framework-Database"]},{"SimCorpReference":"D-89895","ChangeNote":"Added function that copying Trading Platform field to the second leg","Products":["Business-Transactions"]},{"SimCorpReference":"D-91016","ChangeNote":"For External and Internal message queues updated a mechanism that check if the data received from DB is correct and non-ambiguous. Add solution for cases when we retrieve only one data row with data info for requested transaction number.","Products":["Business-STP"]},{"SimCorpReference":"S-206807","ChangeNote":"Update OASYS CBU to handle auxiliary job definitions.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-90757","ChangeNote":"Do not check mandatory fields from state controls when passing unsettled trades from Asset Manager to Front office Portfolio calculations copy.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90699","ChangeNote":"In Asset manager (Simulations applet) in FX Single currency window security is now filled after base/price currency is filled. This ensures correct security selection according to FX simulations defaults.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86010","ChangeNote":"Crash in Asset manager after deletion of FX Swap simulation. Fixed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-90758","ChangeNote":"The CBU routine for moving past version 24.07 could report a false positive about 4-Eyes approvals needing changes even when no approvals existed. This has been fixed.","Products":["Framework-Audit"]},{"SimCorpReference":"D-90444","ChangeNote":"Apply price rounding correctly when allocating multiple Future placements from OM","CustomerApplyNote":"Apply price rounding correctly when allocating multiple Future placements from OM"},{"SimCorpReference":"D-90876","ChangeNote":"The error message \u0027It is not allowed to move cash between different portfolio masters\u0027 could wrongly appear when trying to load a transaction into the \u0027Overnight Account Payments\u0027 window. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-90923","ChangeNote":"A save action failed after a final Manual Match in the General Reconciliation workflow due to a program crash. This defect has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-90991","ChangeNote":"In some situations the message queue service did not respect the creation order of messages within a discrete group. This has been corrected.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-90252","ChangeNote":"\u0022Value filled PC absolute\u0022 and \u0022Value filled QC absolute\u0022 was 100x the value as expected in OOB for Finished orders with special currency (like GBp/GBP). This was corrected together with Indicative price.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90775","ChangeNote":"An error could occur when processing \u0027Awaited Fund Events\u0027 on the STP service. This has been fixed.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90194","ChangeNote":"This change is a performance enhancement related to the  Portfolio Calculation when you are using \u0022Recalculation changed\u0022 in the Functions menu. The change reduces the number of holdings and transactions that are handled to those with virements on the holding. By reducing the number of holdings and transactions with a new condition, the calculation time is improved for the portfolio calculations.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90327","ChangeNote":"For  \u0027drawn\u0027 bond positions, no redemption was created when the coinciding coupon already existed on the same date. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-90771","ChangeNote":"When allocating order block allocations from the Order Manager using a CDS Index standard product, an error message saying \u0022Standard Product ID is a mandatory field and must be specified if Security group is defined as False\u0022 could occur. The missing ID is now populated with a Standard Product ID.","Products":["TradeManager"]},{"SimCorpReference":"D-90955","ChangeNote":"Fixed a possible crash in order auxiliary job functionality. The crash could happen during the order update when the aux job fields include some security static data field.","Products":["Business-AuxJobOrders","Business-PortfolioManagement"]},{"SimCorpReference":"D-90618","ChangeNote":"Read ApiBaseURLPrefix dynamically from cnf.ini","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-89082","ChangeNote":"Date repopulation was fixed","Products":["Business-Transactions"]},{"SimCorpReference":"D-89340","ChangeNote":"Remove A_COLLATERAL_SUBRESULTS.MIN_RETURN_AMOUNT field from Standard Reports","Products":["Business-Reporting"]},{"SimCorpReference":"D-90894","ChangeNote":"When the same risk factor was mapped to multiple positions and imported sensitivities were used for pricing risk models (e.g., Monte Carlo, Historical), the imported sensitivities were taken incorrectly from Key Ratios Calculation =\u003ERisk Factor Sensitivities. This issue has now been corrected.","Products":["MarketData"]},{"SimCorpReference":"D-90768","ChangeNote":"A correction is made to the factor based FIPA fair cash flow on decomposed spot legs of IRF positions in Performance Calculation. This affects the fair cash flow itself as well as the factor based FIPA local return, when this is calculated using the TWR based approach. The correction ensures that the cash flow adjustment is consistently based on exposure, which removes spikes in the factor based FIPA local return on decomposed IRF positions on days with buy or sell transactions.","Products":["Performance"]},{"SimCorpReference":"D-90899","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations"},{"SimCorpReference":"D-90915","ChangeNote":"The recalculation of current values and settlement amounts should not be triggered for irrelevant field changes in the truGen or truCostPstChg environment for transactions native to the window Exercise Options.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90448","ChangeNote":"After the CDS reversioning transaction, the new position could not be netted due to inconsistency in the security and original transaction number in the nominal match holdings. Here it has been fixed, the position netting transaction can be successfully saved.","Products":["TradeManager","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-198640","ChangeNote":"1. Added TRANS_PERIOD_CLOSURE_DATES to IMW.                                                               2. D-89404 - CHange Increment By Field for BF_POSITIONS"},{"SimCorpReference":"D-90797","ChangeNote":"Ensure online static data updates are coming through for Workflow service"},{"SimCorpReference":"D-89819","ChangeNote":"CompetingBids now contains quotation type IndexedPrice for received FIX bids with PriceType Price when instrument quotation type is IndexedPrice"},{"SimCorpReference":"D-90791","ChangeNote":"When using the formula function  \u0027gettransfreecom\u0027 an unexpected amount of whitespaces was added. This has been fixed.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-89211","ChangeNote":"Add the missing schdlik pointer to the calcm matrix to resolve the issue and ensure successful figure generation.","Products":["Business-FundAccounting"]},{"SimCorpReference":"S-209418","ChangeNote":"Improvement of calculation time for Modified Value at Risk in Risk Measurement.","Products":["Business-Risk","CsCode-RiskManagement"]},{"SimCorpReference":"D-90558","ChangeNote":"Rounding rules were not applied to the suggested margin amount for Margin Call with Return/Recall actions when the setting in Collateral Manager setup =\u003E Collateral Calculations =\u003E \u0022Ignore MTA and rounding on full return/recall amount\u0022 is On. It was fixed.","Products":["Business-Collateral"]},{"SimCorpReference":"D-90209","ChangeNote":"Reduce workspace requirement during initialisation phase of position calculation during decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-90718","ChangeNote":"A problem with generic payment matching using manual payment reconciliation and external netting was found and fixed","Products":["Business-STP"]},{"SimCorpReference":"D-90774","ChangeNote":"A crash could occur when creating swap orders from simulations via the Asset Manager. This was due to missing swap legs. The error handling has been improved and a proper error message is now provided instead.","Products":["TradeManager"]},{"SimCorpReference":"S-209952","ChangeNote":"Use a different counting mechanism","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90300","ChangeNote":"For External and Internal message queues add a mechanism to check if the data received from DB (that is used to update Int and Ext message queues) represents the correct \u0022Security\u0022 in scope of the requested \u0022Transaction No\u0022.","Products":["Business-STP"]},{"SimCorpReference":"D-90485","ChangeNote":"Two Front office data service load balancers could handle the service queue in case of reconnection to another MUCS and two such services run.  This has now been corrected.","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90525","ChangeNote":"UDKR weight fields were not excluded from calculation and streaming, fixed now.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-209776","ChangeNote":"Trade Manager/OTC API: When missing Security ID field in contracts, one might see an error message that \u0022Standard Product ID\u0022 is mandatory and missing. The error message has been corrected to say \u0022Security ID\u0022 is mandatory and missing.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90035","ChangeNote":"Update InputFieldDefinition fields when a new row is created","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-88458","ChangeNote":"Improved Handling of FX Tics with Division by Zero Risk\n\nIn rare cases, an FX tic may have a value exactly equal to the negative of the FX rate, which would result in a division by zero during pricing calculations.\n\nPreviously, this scenario triggered an error message, causing all FX tics retrieved in the same batch to fail—even those unaffected by the issue.\n\nThis behavior has now been improved: the problematic tic is simply marked as \u0022not found,\u0022 allowing the rest of the tics to be processed successfully without interruption.","Products":["MarketData"]},{"SimCorpReference":"D-90613","ChangeNote":"Patch of D-90292. E.g. a crash would occur in Position Search when right-clicking on a CDS position which has been created on a future date. The error has been fixed.","Products":["TradeManager"]},{"SimCorpReference":"D-89398","ChangeNote":"Implementing retry of Cancel and Correct job for transactions with DB clashes","Products":["Business-Transactions"]},{"SimCorpReference":"D-89337","ChangeNote":"Separate layout for each Trade type in FX single or multi currency pair","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-89512","ChangeNote":"A dead holding showed accrued interest End Of Period balance in the Portfolio Calculation, which should not have been the case. This defect has been fixed. \n\nFor more details: The problem was when linked positions are calculated in the same chunk in the portfolio calculation on a given date, then overlapping agreement and payment dates of the transactions in position A can update the from-date for fetching transactions to an earlier date for this position A, but not for the other position B. This means that a potential linked transaction in position A is fetched based on the earlier from-date, but the corresponding linked transaction leg in position B based on the original from-date is NOT fetched. However, this linked transaction leg in position B will be fetched anyway later on. BUT any transactions booked between this linked transaction in position B and the original from-date were NOT fetched! Usually, this is not a problem, but for the settlement day adjusted PCL holding used to calculate accrued interest this can have an effect. The problem has been fixed by adjusting the from-date for fetching transactions of linked positions to the same from-date in PCL frameworks. Furthermore, only the linked positions of interest-bearing instrument types are considered. And the Calculate interest according to settlement day parameter must be set.","Products":["Performance","Business-PortfolioCalculation","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"S-209423","ChangeNote":"The automatic population order order approval groups causes issues during order allocation. This was fixed.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90394","ChangeNote":"Removed the 0.01 multiplier from shock size calculations for price RFs that use absolute returns to ensure consistency between MC and Parametric VaR results.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"S-209338","ChangeNote":"Fix bug regarding length of final stub period on interest rate swaps.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90132","ChangeNote":"Fix \u0022Cannot access a disposed object\u0022 error in internalwebrequest, that appeared in Mediator Client when \u0022Execute on connected service\u0022 was not selected.","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-89404","ChangeNote":"changed  Increment by variable to check condition on  LASTEXETS"},{"SimCorpReference":"D-89533","ChangeNote":"Increase allowed size of CMPLHLDATTRIBHEADERS in CMPLCALCULATIONS","Products":["Business-Compliance"]},{"SimCorpReference":"D-90443","ChangeNote":"Made a fix to improve error handling for schedule information to ensure that pervious schedule details are correctly included.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90233","ChangeNote":"Auto-allocate processing time was logged incorrectly in automation service"},{"SimCorpReference":"D-89926","ChangeNote":"When it is new data mode or streaming AM cache data to MT, the weight fields should be excluded from calculation but not their dependency fields because MT need them to calculate weights.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90078","ChangeNote":"Buffer size for scdbatchqueue arguments changed from260 to 1000 characters"},{"SimCorpReference":"D-89366","ChangeNote":"Fixed formatting of SWIFT messages via SWIFT Status.\nIt was decided not to display the enhanced information unless the relevant Auxiliary message external ID is used in Match Filter Definitions.\nAdded the check to verify if message has to be enhanced.\nFixed the wrong formatting of additional info (missing new line characters).","Products":["Business-Match"]},{"SimCorpReference":"D-89423","ChangeNote":"Some Trade Manager transactions (like novation step out on a IR Swap, BRL Pre DI) were wrongly considered to be in the  order approval flow. This is corrected.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-89887","ChangeNote":"buffer size for  streamreader for DatabaseTypeConversionUnManagedInternal.ToCharArray() method was increased from 1024 bytes(default) to 16384 bytes to improve performance for PKR Service that uses queue handler worker services","Products":["CsCode-Framework"]},{"SimCorpReference":"S-207391","ChangeNote":"Fixed npm packages\u0027 vulnerabilities"},{"SimCorpReference":"D-90259","ChangeNote":"When modifying a \u0027Reallocation Collateral\u0027 transaction, based on a \u0027Bond\u0027 with \u0027Quotation\u0027 \u0027Dirty price\u0027 it could happen that the \u0027Current Value xC\u0027s were filled wrongly along  with that. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90330","ChangeNote":"When updating a simple SCD installation via the edge service it will fail when trying to get the build. This has been corrected.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-89652","ChangeNote":"In the \u0027Performance Calculation\u0027 the amount shown in the field \u0027Next Coupon QC\u0027 for a TRS leg with an underlying Bond was in the currency of the underlying bond instead of the currency of the TRS leg. This has been fixed.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-90367","ChangeNote":"The generation of a Total Return Swap adjustment transaction must consider existing reset transactions on the same date as the adjustment in the calculation of accrued interest.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-90192","ChangeNote":"Fix for a side effect from another correction related to fully sold Loan Facilities with remaining intraday events. The Intention was to only generate remaining reprices for dead holdings, but it was now generating in other cases without the other  preceding events having been generated. This has been corrected.","Products":["Business-PrivateDebtTransactions"]},{"SimCorpReference":"D-89928","ChangeNote":"Fixed a crash that ocurred if subtotal was calculated for PositionScope in either the Current Positions api or the AM Cache api","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90070","ChangeNote":"Fix for issue where default limits were not populated on not tested results, if the rule used one or more rating conditions.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-89185","ChangeNote":"It was discovered that Consumed and Recovered Currency Depreciation P/L figures were calculated for Capital Reduction transactions. The error occurred when received cash was greater than book value but less than cost value. This also resulted in incorrect  Consumed and Recovered Security Depreciation P/L figures and wrong EoP balances on position or tax lot level.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-89995","ChangeNote":"Fix crashes on mapping counterparty exposure responses on Order Manager - Order service."},{"SimCorpReference":"D-89851","ChangeNote":"Enable functionality for deleting external fund data with successfully imported decomposition data","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-90109","ChangeNote":"When trying too load many records into the \u0027DPG Pool\u0027 window the system could get stuck. This has been fixed.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90023","ChangeNote":"Correction of programm error found when raising fund in status","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90213","ChangeNote":"An error could occur when executing the \u0027Generate Time Series Cash Flow\u0027 \u0027Batch Job\u0027. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-90168","ChangeNote":"Fix and enable date dependent tests","Products":["CsCode-Trading"]},{"SimCorpReference":"D-89890","ChangeNote":"Excluding initial holding record from the scope of the correction made on D-70970. The initial holding record shouldn\u0027t be merged with other holding records if the holding becomes dead.","Products":["Business-FundAccounting","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-90056","ChangeNote":"The storage option \u0027drop all storage\u0027 has been added when truncating tables.","Products":["Framework-Database"]},{"SimCorpReference":"D-90081","ChangeNote":"Implemented the check that no inconsistency in elimination PCL and parent holdings are observed. After this change some clients might get the error about inconsistencies in the PCL elimination holdings. The inconsistencies can often be solved by rebooking the holdings.","Products":["Business-PeriodClosure","Business-ToolsAccounting","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-90041","ChangeNote":"A program error could occur when using formulas for elimination accounting values in the finance booking. The error has been corrected.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-89470","ChangeNote":"Change logic for equity/bond futures override functionality","Products":["Business-Risk"]},{"SimCorpReference":"D-89883","ChangeNote":"Fixed issue that valuation errors are not listed in a batch log when calculating broker statement OUR.","Products":["CsCode-RealTime"]},{"SimCorpReference":"S-198287","ChangeNote":"Create CBU to inform users that OASYS records can no longer be processed.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-89795","ChangeNote":"Add pricingExpression tag for the CDSwaption model","Products":["Business-Risk"]},{"SimCorpReference":"D-89090","ChangeNote":"Allow for longer texts to the function calls","Products":["Framework-Database","Framework-MetaData"]},{"SimCorpReference":"D-89634","ChangeNote":"In the case when SCD language is German, the CreateJob AM cache request fails when it is sent via batch job and contains fields from Additional Accounting Analytics category. This has been fixed now.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-89904","ChangeNote":"Compliance results of party exposure rules showed an inconsistency in regards to Dirty Value and Exposure. The sign was not always the same for certain cash positions, or Exposure was zero Dirty Value wasn\u0027t. This inconsistency has been resolved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-89878","ChangeNote":"The pool factor should remain zero for the irrelevant legs of a ‘Maturity repo’ transaction.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-88615","ChangeNote":"Lock the records in the db until the user finished with his updates and if there is a case of concurent updates notify a user whos changes didn\u0027t pass to redo the operation and the Approval window will be closed","Products":["Business-CorporateActions"]},{"SimCorpReference":"S-206946","ChangeNote":"Added IFRS 9 purpose to base filter 2150, which had been mistakenly left out when that field was added to the fund decomposition components screen."},{"SimCorpReference":"D-89241","ChangeNote":"Risk Measurement. Ignore adjustment factors for FX Options in case of Imported Sensitivities calculation","Products":["Performance","Pkr","Business-PortfolioCalculation","PositionBasedCalculation","Business-Risk","Valuation"]},{"SimCorpReference":"D-89118","ChangeNote":"MUCS outgoing messages only on subscribers for flex pi data numerics table. Reduce MUCS load on flex pi data import","Products":["Business-FlexPi"]},{"SimCorpReference":"D-89789","ChangeNote":"Better error handling of sub formulas.","CustomerApplyNote":"This change affects the way formulas of type \u0022Key Ratio Mapping\u0022 are calculated. Before this change, formulas calling other formulas that returned an error AND the erroneous formula is also called on its own, the formula calling the erroneous formula was not marked as erroneous as it should. Now these kinds of formulas will also return an error.\nThis change can affect the output from “Pricing and Key Ratios Calculations”.\nExample of a case that will work differently. F1 is calling F2. F2 fails (perhaps for some rows only). If the formulas are requested to be calculated in the order F2 then F1, then F1 did not fail even though there were errors in F2.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-90037","ChangeNote":"Added tmp package stable version to overwrites"},{"SimCorpReference":"D-89254","ChangeNote":"Enhanced Create Loan Facilities Transactions window to not generate postponed Interest transactions out of a date range given in the window.","Products":["Business-AdministrativeSecurityTransactions","Business-PrivateDebt","Business-PrivateDebtTransactions","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-89859","ChangeNote":"An error could occur in the \u0027Portfolio Calculation\u0027 in case \u0027Adjustment frequency\u0027 was not set to \u0027\u0027No adj.\u0027 and in case at least one \u0027Hedge\u0027 position with Hedge adjustment\u0027 \u0027Freeze\u0027 and \u0027Hedge risk free price adjustment method\u0027 \u0027Dollar offset - Retrospective (constant spread and curve)\u0027 was supposed to be calculated. This has bene fixed.","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-89627","ChangeNote":"Previously, performance dashboard widget UI\u0027s of type \u0022tree node top/bottom\u0022 would crash when the node internal keys were greater than  ~2.1B. This crash has been fixed by storing the internal keys as long integers (int64) rather than standard integers.","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-90001","ChangeNote":"Flaky test ignored","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-89089","ChangeNote":"Make sure the full error message is returned when an order validation fails via the API","Products":["CsCode-Compliance","CsCode-PortfolioManagement","Business-Compliance","Business-PortfolioManagement"]},{"SimCorpReference":"D-89520","ChangeNote":"Relaxed Private Debt event transactions existence check for dead holdings with unsettled Sells without contract-level accounting of them.","Products":["Business-PrivateDebt","PrivateDebtStaticData","Business-PrivateDebtTransactions","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-88894","ChangeNote":"Enhanced mechanism for filling  \u0022Security\u0022  fields in cases  when transactions from different portfolios with identical \u0022Trans No\u0022 s can be involved in match process for a single SWIFT message","Products":["Business-STP"]},{"SimCorpReference":"D-89960","ChangeNote":"An error could occur when trying to delete \u0027Formula values\u0027 setup via DFS. This has been fixed.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-89699","ChangeNote":"Enable IMW Compare in DWH Developer Mode","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-89826","ChangeNote":"Fixed crash in Alert Inbox caused by recent change of TreeNode id type","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-89866","ChangeNote":"Patched a technical change to 25.07 and 25.04, which is intended to make the sorting of decomposition components - And the resulting Component Number - more consistent for internal funds, by introducing the component holding key as a new sorting field.","Products":["Decomposition"]},{"SimCorpReference":"D-89188","ChangeNote":"Use Directory/Discovery service to select active API gateway instance and retrieve it\u0027s base url in internalwebrequest CDL command","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-89219","ChangeNote":"Customer specific issue and fix for it. There is a separate logic for the \u0022Tax Lot Correction\u0022 transaction. The \u0022Yield for Math. Adj.\u0022  is updated only if it is manually entered into the Tax lot Correction transaction. Otherwise, the current holding value is saved, despite the fact that the values that affect the calculation of the yield were adjusted. Now this logic has been supplemented with saving the \u0022Date latest premium/discount dissolution\u0022  from the holding, in order not to restart depreciation.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-88173","ChangeNote":"Fix SonarQube issue","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-89570","ChangeNote":"Client specific change which prevents the STP services to be interrupted by insignificant errors, when using Calculation Services.","Products":["Business-Transactions"]},{"SimCorpReference":"D-88349","ChangeNote":"The \u0027Changed\u0027 time stamp was wrongly updated in the \u0027Client Portfolio Managers\u0027 sub window of the \u0027Portfolios\u0027  window. This has been fixed.","Products":["Business-ClientManager"]},{"SimCorpReference":"D-89797","ChangeNote":"Remove time span from .WithSelfHandledWindow() to allow wait as muchas needed","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-89683","ChangeNote":"The TAPI APL JSON deserializer expects all the properties defined in tapiFldsListOfFlds to be specified in each node. The TAPI C# serializer must ensure that any property having a null value is included in each node to avoid crashes on the APL side.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-89348","ChangeNote":"Display the correct \u0027Security of exposure\u0027 for cds options.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-89132","ChangeNote":"When a bond was bought at par and had put/call price is also at par, and when Maturity simulation is Put/Call, there was problem with generation of Mathematical adjustment transaction after user manually inserted amounts on the previous Math. Adj. transaction. This error was corrected here. Now for such cases when initially there was no amortisation(a security is bought at par), but a user manually inserts the needed adjustment amounts, the presence of Put/Call data is not preventing generation of subsequent Mathematical Adjustment transactions.","Products":["Business-SystematicAdjustments","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-89485","ChangeNote":"Limit code that was written specifically for internal API for Collateral Reallocation transactions creation to TAPI only.","Products":["Business-Transactions","CsCode-Transaction"]},{"SimCorpReference":"D-89695","ChangeNote":"Fix a crash when enabling \u0022Decompose structured bonds\u0022 in Position Analysis and calculating / updating the data","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-87667","ChangeNote":"Fix the insufficient memory error by splitting the covariance import into chunks.","Products":["Business-Risk"]},{"SimCorpReference":"D-89303","ChangeNote":"A program error could occur when running a portfolio calculation on positions using the deferred gain/loss functionality in period closure frameworks. The error has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"S-187053","ChangeNote":"Formula getparbusclass () requires 9 arguments. The 8th argument is the \u0022classification description field\u0022. When the session language changes to another language than originally the formula has been written, then the formula does not work because the 8th argument uses field header and is not updated following session language. The problem is fixed and now the 8th argument is field IK instead of field header.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-88711","ChangeNote":"Implemented mechanism to avoid filiing the \u0022Portfolio\u0022  fields in cases  when transactions from different portfolios with identical \u0022Trans No\u0022s can be involved in match process for a single SWIFT message.","Products":["Business-STP"]},{"SimCorpReference":"D-89550","ChangeNote":"Patch fix D-87079 and S-200214 to the versions 25.07","Products":["Business-Match","Framework-CoreFramework"]},{"SimCorpReference":"D-89084","ChangeNote":"An issue occurred in the \u0027Position Analysis\u0027. When a \u0027Pricing profile\u0027 with fund decomposition and a \u0027Decomposition profile\u0027 was applied. The order of the \u0027Component types \u0027 was altered after updating the analysis, while other attributes (e.g., the order of the Issuer\u0027) remained unchanged. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-87751","ChangeNote":"Netting manager shows negative amount for some netted transactions. This was fixed","Products":["Business-Netting"]},{"SimCorpReference":"D-89445","ChangeNote":"For Deposit Rollover \u0022New Principal at Rollover\u0022 is now saved and Trade date is calculated based on the value of the \u0022Transactions may have agreement date in the future\u0022 configuration parameter.","Products":["Business-Transactions","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"S-202735","ChangeNote":"Check that there are no duplicate Dividend IDs against existing securities in Capital Events window under Equities static data","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-89339","ChangeNote":"DWH: Use bind variables when executing the SQL extracting data from SCDAT","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-87461","ChangeNote":"Increased timeout for message broker connection from FNS"},{"SimCorpReference":"D-89519","ChangeNote":"Fixes a potential index error crash in batch jobs of type \u0022Performance Calculation - Upload Results\u0022","Products":["Performance"]},{"SimCorpReference":"D-89342","ChangeNote":"We roll back an earlier change to the transactions generated for CDS Cash settlement transactions in the Create Credit Derivative Transactions window. With this rollback, only transactions in the expected date interval are generated.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-89048","ChangeNote":"Extended the Attribute value field in results to 100 characters","Products":["Business-Compliance","CsCode-Compliance"]},{"SimCorpReference":"D-88844","ChangeNote":"Resolved an issue where information messages related to the max age functionality in the decomposition flow would sometimes be incorrectly shown on rows where they did not belong.","Products":["MarketData"]},{"SimCorpReference":"D-89338","ChangeNote":"Fixed an issue in the Investment Structures Assignment screen\u0027s base filter, where a recent technical change to the From date field had broken the base filter."},{"SimCorpReference":"D-87636","ChangeNote":"Value that is saved in \u0022Change date\u0022 is taken by another way.","Products":["Business-Cash","Business-Match","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-205260","ChangeNote":"field id PORTFOLIO_MANAGER in BD_PORTFOLIO is depreciated and removed from standard model"},{"SimCorpReference":"D-88708","ChangeNote":"Resolve the issue by setting username correctly and add logging for better visisbility","Products":["CsCode-Framework"]},{"SimCorpReference":"D-89144","ChangeNote":"When using scd.exe to queue a batch job group and wait for the result exit code 0 is returned if the batch service is terminating during the execution of the batch job. This has been corrected so exit code 2 is now returned.","Products":["CsCode-SystemOperation","Framework-Services"]},{"SimCorpReference":"D-89289","ChangeNote":"Enable IMW Deploy in DWH Developer Mode","Products":["Business-DWH"]},{"SimCorpReference":"D-88956","ChangeNote":"Warning is be issued if the Transaction options - Options 1 “Check that payment/settlement/maturity date is a business day” is ON and date is not a business date, and no warning is shown if the check box is cleared.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-89270","ChangeNote":"removed some auto generated files","Products":["CsCode-Framework"]},{"SimCorpReference":"D-87963","ChangeNote":"Fixed Loan facilities Cash flow forecasting in case of Interest Pay In/Out with other intraday administrative events","Products":["Business-PrivateDebt","Business-Transactions","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-88288","ChangeNote":"Australian CIB: Revert no rounding for Base idx adjustment","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-88583","ChangeNote":"Change criteria for finding Initial FX rate to account for settlement days","Products":["Valuation"]},{"SimCorpReference":"D-89190","ChangeNote":"Improved performance of fix allocation processing"},{"SimCorpReference":"D-87748","ChangeNote":"Fixed issue with UETR re-generating when mix of Swifts is present on transaction","Products":["Business-Swift"]},{"SimCorpReference":"D-88872","ChangeNote":"Changes in the error message text only that appears on the internal trade","Products":["Business-Transactions"]},{"SimCorpReference":"D-88211","ChangeNote":"To fix an issue when currency field in Election Defaults is not considering the Option currency on applying the defaults","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-89059","ChangeNote":"A \u0022DBI ran out of memory\u0022 could occur when loading  names for dimension values in the batch job which uploads files for IAP-Performance (Performance Calculation - Upload Results). The problem has been solved.","Products":["Performance"]},{"SimCorpReference":"D-88862","ChangeNote":"The type conversion has been modified such that the views can be generated.","Products":["XpressInstruments"]},{"SimCorpReference":"D-88035","ChangeNote":"Preliminary transactions for instrument type \u0022Swaptions\u0022 with trans. type \u0022Close\u0022  were raised in status by STP service without a compliance validation when they were validated from \u0022Order Outbox\u0022 applet in Asset Manager in a group with more than one such transactions.","Products":["Business-STP","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-88885","ChangeNote":"Performance improvements for list management that was preventing Rule entry to perform well.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-88804","ChangeNote":"When currency has been cleared for GCA that is a substitute fwk and the change is to be saved, the crash happens. This has been fixed.","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-88640","ChangeNote":"Apply User info","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-87715","ChangeNote":"Fix of the approach of the getting authorized runs","Products":["Reconciliation"]},{"SimCorpReference":"D-88496","ChangeNote":"Hidden pTRAQUOTE field is cleared during sim to transaction flow to prevent logic execution which depends on this field when user modifies transactions in the form","Products":["Business-DealerSecurityTransactions","Business-Transactions"]},{"SimCorpReference":"S-204612","ChangeNote":"No authorisation was applied when selecting Collateral pool under Accounting info in Trade manager. It was fixed.","Products":["TradeManager","Instruments","XpressInstruments","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-87714","ChangeNote":"Handle nullreference exception in apigateway when service is no longer available"},{"SimCorpReference":"D-88332","ChangeNote":"[Modify Position] Trade date is not changed when New Principle At Rollover is changed","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86958","ChangeNote":"NextLink functionality for DWH Apis added","CustomerApplyNote":"NextLink functionality for DWH Apis added","Products":["CsCode-ApiFramework","CsCode-PortfolioManagement","UP-Api","CsCode-UP"]},{"SimCorpReference":"D-89052","ChangeNote":"Adding ORA-42294 to the error handling when creating a role that already exists","Products":["Framework-Database"]},{"SimCorpReference":"D-88905","ChangeNote":"Fix possible crash in PKR server when processing nominals that are very close.","Products":["Pkr"]},{"SimCorpReference":"D-88287","ChangeNote":"Adjustments to the fields’ post-change logic for the ‘Reallocation Collaterals’ window.","Products":["Business-Transactions"]},{"SimCorpReference":"S-200535","ChangeNote":"AM: Add FX rate quote type to modify position of NDS IRS Fixed/Float. This requires that the \u0022Use OTC API\u0022 checkmark is enabled in \u0022Front Office Options\u0022.","Products":["TradeManager"]},{"SimCorpReference":"D-87083","ChangeNote":"FX order update handling in Asset Manager Order outbox applet is optimized. New configuration is added to Asset manager settings template to control Order update events  throttling threshold. Default value is 5 seconds. New configuration is added to SCD 25.10.","Products":["Business-PortfolioManagement","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-88838","ChangeNote":"Fix side effect from refactoring done in S-201082 and wrong field name in meta data for weight fields reported on D-88935.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87669","ChangeNote":"Optimization of database query for transaction list in Alerts Inbox","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87450","ChangeNote":"When calculating Next coupon amount QC/PC on holding level when running a PFC the use of a holding segment in the PFC could cause inconsistent and unclear results","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-87331","ChangeNote":"Fix threading issue when \u0022Goto Order\u0022 is used in conjunction with Accepting multiple orders from inbox"},{"SimCorpReference":"D-88389","ChangeNote":"Patched","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-88161","ChangeNote":"Rule scope filter should work properly in conjunction with another condition in Within clause","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-88697","ChangeNote":"Four eyes approval flow for GlobalRuleAssignments and LegalSetAssignments API should be activated by dedicated Compliance Configuration setting Four eyes approval (rule assignments) and NOT Four eyes approval (rules and fragments)","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-88631","ChangeNote":"It must be possible to close a TRS position with a trade date before a reset/proceed transaction’s trade date but with a payment date on or after the reset/proceed transaction’s payment date.","Products":["Business-Transactions"]},{"SimCorpReference":"D-87416","ChangeNote":"Client will now show forward-based form when manual allocating spot with non-zero ticks"},{"SimCorpReference":"D-88205","ChangeNote":"API call can disregard the warning and continue CreateReleasedOrdersBegin/CreateReleasedOrdersEnd commands","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-88012","ChangeNote":"The fields Actual value, Fail above \u0026 Fail below are now populated for Warning alerts on Limit rules.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87905","ChangeNote":"Fix for crash in Business Rules Alert Service, on attempting to export a Compliance Post Trade Alert, via the Business Rules Manager.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-88778","ChangeNote":"No visible changes for user. After changing Product Area names update product map file. The changes are:  1. Enrich \u0026 Reconcile -\u003E Reconcile \u0026 Trade Lifecycle\n2. Lifecycle \u0026 Settlement -\u003E Corporate Actions"},{"SimCorpReference":"D-88286","ChangeNote":"Added Originator and ReceivedTimestamp to Portoflio order data in DSL"},{"SimCorpReference":"D-85968","ChangeNote":"Refinitiv interface: Updated Real-Time SDK (EMA) to version 2.2.3.1 and its dependencies to the latest supported versions.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-88387","ChangeNote":"Weights are currently calculated in MT in all cases. So in order to save time, weights will be excluded from calculation when AM cache job is processed. But the meta data for these weight fields will be streamed to MT where it is needed for the calculation.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-84832","ChangeNote":"Added support for bond futures instrument to properly apply shocks in Portfolio calculation when working with User defined key ratios and Market data scenarios","Products":["MarketData","Business-PortfolioCalculation","PositionBasedCalculation","Valuation"]},{"SimCorpReference":"D-87805","ChangeNote":"Added correction to the Cancel and Correct window for the case where the Pool factor is repeatedly updated","Products":["Business-Transactions"]},{"SimCorpReference":"D-87997","ChangeNote":"Fixes an error where an incorrect quote could be used in calculations.","Products":["MarketData"]},{"SimCorpReference":"S-197392","ChangeNote":"Internal testing tool for Alternatives Release Verification Pipeline. Rerun flaky tests to reduce developer time spent on false positives"},{"SimCorpReference":"D-88418","ChangeNote":"AM cache historical job does not return the right FX rates for historical date.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-88337","ChangeNote":"Swift MX LAU validation could fail when incoming message contained  the caret \u0027^\u0027 character. This is now fixed.","Products":["Business-Connectivity","Business-Swift","CsCode-Mediator"]},{"SimCorpReference":"D-84818","ChangeNote":"Correcting interest appreciation to account for Forecast from date.","Products":["Business-Cash","Business-HedgeAccounting","Business-InternationalAccountingStandard","Business-PortfolioCalculation","PositionBasedCalculation","Business-Risk","Business-SystematicAdjustments","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting","Business-Transactions","Valuation","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-87543","ChangeNote":"When \u0027Correct exist. dividends\u0027 was checked in the \u0027Create Dividends\u0027 window, in case it was needed to reverse related transactions along it could happen that the \u0027Dividend\u0027 was deleted, the related transactions were reversed but the \u0027Dividend\u0027 was not recreated. This has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-88562","ChangeNote":"The generation of a Total Return Swap adjustment transaction must consider existing reset transactions on the same date as the adjustment.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-88248","ChangeNote":"Simulation macros can now use UDKR without crash","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87187","ChangeNote":"Fix that makes Swift MT Duplicate work when user use segments in Parties-\u003EInterfaces-\u003ESWIFT","Products":["Business-Swift","CsCode-Framework","Framework-Formulas"]},{"SimCorpReference":"S-201982","ChangeNote":"Default value for seconds to wait for idle service should be 3 minutes","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-87451","ChangeNote":"Update RVPs (tests)","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-87046","ChangeNote":"When creating \u0027MatRepo\u0027 transactions using the \u0027Create Securities Lending Transactions\u0027 window the \u0027Redemption Factor\u0027 was wrongly always determined as 0. This has been fixed.","Products":["Business-AdministrativeOTCTransactions","Business-ReferenceData"]},{"SimCorpReference":"D-88265","ChangeNote":"Fix for a crash that would happen when opening Deal Capture Bonds","Products":["Business-Transactions"]},{"SimCorpReference":"D-87902","ChangeNote":"Accrued interest has been excluded from the list of modified fields during the matching process for Dealer FX Forward transaction codes.","Products":["Business-Match"]},{"SimCorpReference":"D-88359","ChangeNote":"Flaky table unit tests have been made more robust","Products":["CsCode-Framework"]},{"SimCorpReference":"D-88388","ChangeNote":"Fetching aggregation results in within case statements is now supported in configurable flexible analytics","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-87399","ChangeNote":"Enable viewing the Ccy adjustment PC, Ccy adjustment PC2 and payment type fields from the Payment Reconciliation table in ‘View Transactions’ for Cash Management to identify payment components of different payment types","Products":["Business-CashManagement","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-87397","ChangeNote":"Add Pricing Profile IK to source keys to avoid key violation in some specific scenarios"},{"SimCorpReference":"D-87280","ChangeNote":"When saving securities lending like transactions in the Trade Manager period closure dates and definition was not added for underlying legs. It also not possible to apply privileges to a securities lending like transaction in the Trade Manager.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-87577","ChangeNote":"Fixed when AM Browser host widget did not load page after creating a new configuration","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-88208","ChangeNote":"A failed upload of Performance Calculation - Upload results will no longer block Performance Measurement from running. When the Performance Measurement is looking at latest execution of the Performance Calculation it will exclude all executions of type \u0022Upload to PERFaaS\u0022","Products":["Performance"]},{"SimCorpReference":"D-88189","ChangeNote":"For AUTPROFILES PMGIK should be excluded if the installations do not support multiple portfolio masters.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-87409","ChangeNote":"Move order STP processing status check from menu item condition to the validation process","Products":["Business-PortfolioManagement","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87654","ChangeNote":"User Marts load outputs reports in a single file (instead of multiple parts) with correct file extension","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"S-201033","ChangeNote":"Patch  S-197454 to 25.04 and 25.07","Products":["CsCode-DataWarehouse","CsCode-Reporting"]},{"SimCorpReference":"D-87389","ChangeNote":"Introduced an error reason when a fully validated identity is not mappable to a user in the SCD user table.","Products":["CsCode-UP"]},{"SimCorpReference":"D-87759","ChangeNote":"An error could occur in the \u0027Portfolio Workbench\u0027 in case TAA was activated. This has been fixed.","Products":["Business-Modelling","Business-PortfolioManagement"]},{"SimCorpReference":"D-88034","ChangeNote":"Add support of header and cookie elements in internalwebrequest CDL command","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-87703","ChangeNote":"CAE default were skipped for events with holdings when Setting \u0022Allow transfer to static data without holdings\u0022 under Interface Options was active. This has been fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-87619","ChangeNote":"Fixed an issue where getrepdatapool formula function would return a single whitespace instead of an empty string.","Products":["Framework-Formulas"]},{"SimCorpReference":"S-201095","ChangeNote":"Remove is_standard_product from XML import/export of TM instruments","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-84609","ChangeNote":"When Decompose derivatives, Calculate synthetic interest and Decompose index contracts is selected in performance calculation, the cash flow values for constituents also include Decomp synth accrued interest xOD, according to the cash flow timing setting in the performance calculation. Previously that only applied to the component type Spot (decomposed to constituents), but not Constituent from spot.","Products":["Performance","Framework-Database"]},{"SimCorpReference":"D-87605","ChangeNote":"The AM Cache did not use the \u0027Order fill updates event throttling threshold\u0027-value from the setup - it defaulted to 5 seconds","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87959","ChangeNote":"Create manual compliance failure alert in some cases happens where Branch column has no value and it effects directly on the setting up a cause for the alert.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86790","ChangeNote":"From time to time there is crash when running PFC for Deferred P/L results. The error is fixed.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-87125","ChangeNote":"Update current rule tables for importing rule lib folders vis ConfigMgr","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87491","ChangeNote":"Check service config on launching thread"},{"SimCorpReference":"D-87787","ChangeNote":"Fixed a a performance issue: When using grouping from either Current Positions api or AM Cache Get data api with a high number of groups would perform so slow that user would get a timeout","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-85926","ChangeNote":"Fix random selections in Source Fields grid after statement change , scroll and other row selection.","Products":["Business-DEX"]},{"SimCorpReference":"D-87475","ChangeNote":"new formula values added","Products":["Framework-Formulas"]},{"SimCorpReference":"D-87752","ChangeNote":"When reconciliation tries to do a one side matching it could count results that were marked as deleted. This could lead to one side matching when amount is not netted to 0. This error was fixed","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-86849","ChangeNote":"Check on index error in DWA DBI functions.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-87539","ChangeNote":"Crash in cnfTrp service by importing Performance Measurement. Was fixed","Products":["Performance"]},{"SimCorpReference":"S-195498","ChangeNote":"Calculate commission for web allocate"},{"SimCorpReference":"S-200198","ChangeNote":"Do not show standard product related information on CDS Single Name templates","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-87537","ChangeNote":"Crash when applying order defaults \nwith dynamic bank account to a large number of orders is fixed.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"S-196702","ChangeNote":"New Check Before Upgrade","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-86855","ChangeNote":"Add opportunity to create empty bm files, even if on uncalculated date","Products":["Business-Risk"]},{"SimCorpReference":"D-87343","ChangeNote":"If more than one column is passed to insert values column by column.","Products":["CsCode-PortfolioManagement","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-87314","ChangeNote":"Fixing of possible sorting issue leading to incorrect data read and so incorrect data exported with GL Format setup","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-87637","ChangeNote":"The issue is fixed by adding an extra check in the code.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-87212","ChangeNote":"Added the ability to generate and save AOCI amortization transaction via the Create end-of-period transaction window when the amortization amounts for the entire position is zero, but there are amounts ​​for AOCI match  lots.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-87038","ChangeNote":"The sanity check for the loan facilities tables has been revised. Previously, it was incorrectly triggered when the substitution framework functionality was used.","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-87285","ChangeNote":"Fixed incorrect translation of domains on CTM load","Products":["Business-CentralTradeManager","Business-Match"]},{"SimCorpReference":"D-87436","ChangeNote":"Pool factors should only be updated for relevant instruments and transactions.","Products":["Business-Transactions"]},{"SimCorpReference":"D-87651","ChangeNote":"Auxiliary double check job for US MBS Pools didn’t work correctly when creating trade via External client trade window and having parameter ‘only status changed’ set to Yes. It was fixed.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-87614","ChangeNote":"Fixing crash during execution of FX Rate Update fund event while trying to update IQ rate","Products":["Business-Transactions"]},{"SimCorpReference":"D-87074","ChangeNote":"Support F-TIIE(OIS) in Mexican Inflation Curve (Mexican UDI) estimation","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87674","ChangeNote":"Disabled performance tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"S-198624","ChangeNote":"New dimensions - Options Security, FRA Security, new fact for Flex Values Decomposed and fix for Cash Transaction fact"},{"SimCorpReference":"S-199635","ChangeNote":"CDS Index (OTC Core): Adjust CDS Index layout and disable validation relating to trade date vs auction date for CDS Index Credit events","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-87053","ChangeNote":"Fixed extrapolation of volatility for volatility curve given by risk reversal and butterfly spread for Linear int.pol method.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87035","ChangeNote":"Quotes of underlying security are used for Theoretical price, convertible bonds  (OneLib) and Quoted prcie \u002Byield curve, convertible bonds price methods","Products":["Business-Risk"]},{"SimCorpReference":"D-87530","ChangeNote":"Current Positions and AM Cache now respects per-portfolio Load Cash-settings that are set in the data selections.  Previously they were ignored","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87511","ChangeNote":"Add logging to user authorization batch job, such as how many setups, data selections are found in the installation, how many setups are processed every minute.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86832","ChangeNote":"Improved OutOfMemoryException handling to reduce the risk of hanging process.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-87562","ChangeNote":"Standard Product with the Index which had Termination Date = 20-06-2025, was removed from the SpecFlow tests","Products":["CsCode-Trading"]},{"SimCorpReference":"S-197081","ChangeNote":"Before when calling GetDestionationConfig, we got destinationConfig for all entries and a client was created for all of them. Now you can pass in the destiantionIds to GetDestionationConfig and only get the ones you need. \n\nAlso better tracing is added","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87301","ChangeNote":"Added two null guards to protect code from crashing in DataLayerClients","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86933","ChangeNote":"We removed rounding for all estimated  \u0027Correction index\u0027 and ‘Correction additional index’ calculations, including dollar inflation sensitivity","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-86801","ChangeNote":"Added retaining of the \u0022selected\u0022 state of the Use Outbox Selection button when switching layout/setup","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87510","ChangeNote":"User authorization batch job fixing infinite loop due to corrupted data selectors and removing output to local file in case user has no access","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87323","ChangeNote":"In rare cases, it was a group code performance issue related to the group code update via batch job. This has now been corrected.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-87366","ChangeNote":"No longer look at full history of assignments including removed assignments when importing global and legal set assignments via Configuration manager","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87297","ChangeNote":"When decomposing an index contract in the Portfolio Calculation the end of day nominal weights were scaled incorrectly with the effect that among others the \u0027Clean Value QC/PC\u0027 and the \u0027Balance Nominal/Number\u0027 were  incorrectly calculated. This has been fixed.","Products":["Benchmarks"]},{"SimCorpReference":"S-198899","ChangeNote":"S-198899: revert changes to apply the tactical solution only for UBS","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-87139","ChangeNote":"Fixed filtering out direct brokers for FX \u0026 FI orders"},{"SimCorpReference":"D-87195","ChangeNote":"The maturity date is used to select the new security for a Credit Event transaction in cases where there is an ambiguity.","Products":["CsCode-Trading","Business-Transactions"]},{"SimCorpReference":"D-87081","ChangeNote":"Fixed Class field value \u0022Preliminary transactions\u0022 for Orders API V3","Products":["CsCode-FrontOffice","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87344","ChangeNote":"\u0022Permission to establish database connection has not been granted\u0022 was returned when after writing a new password if the password was reset. This has been corrected.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-87447","ChangeNote":"Transaction List in Alerts Inbox can be a huge and that impacts performance. We need to limit how much we can load, max 1000 transactions and not older than 1 month.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86294","ChangeNote":"For \u0027Open ended\u0027  \u0027Securities Lending\u0027 positions with \u0027Fee paid\u0027 set to \u0027Last in month\u0027  and \u0027Underlying\u0027 \u0027Bonds\u0027 was not possible anymore to create the final  \u0027Premium\u0027 transactions after the position was closed on its \u0027Maturity date\u0027. This has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86668","ChangeNote":"Add summary dependency fields to the cache job","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86771","ChangeNote":"Fixed AM crashes while working with Browser host widgets loaded to Dashboards","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-87043","ChangeNote":"The number of instances for APL worker services was increased","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-87215","ChangeNote":"Introducing a popup with the option to halt the generating of special customer tables when selecting this in the portal","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-87163","ChangeNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","CustomerApplyNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","Products":["CsCode-FundAccounting"]},{"SimCorpReference":"D-86435","ChangeNote":"Fixed an error in the fund decomposition area, where the decomposition profiles \u0022Max Age\u0022 functionality would sometimes exclude too many components.","Products":["Decomposition","MarketData"]},{"SimCorpReference":"D-86781","ChangeNote":"Fix missing Audit history on assignment sub-list after transfer configuration","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87259","ChangeNote":"Add IncludeLineBreaksInHeaders option to data export","Products":["CsCode-UpLogicalForms","CsCode-UP"]},{"SimCorpReference":"D-86813","ChangeNote":"Remove SQ code smell","Products":["CorporateActions"]},{"SimCorpReference":"D-87037","ChangeNote":"Trim long message about multiple force finished orders, so that it does not crash the message service","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-87013","ChangeNote":"Fixed the click event propagation in case of the client editor validation error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-86723","ChangeNote":"Calculating Payment amount PC as a sum of its PC constituents when recalculating with MDF fx rate","Products":["Business-Risk"]},{"SimCorpReference":"D-85223","ChangeNote":"In certain specific cases, the user role password could unintentionally be part of a memory dump. This has now been corrected.","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"D-87185","ChangeNote":"The email audit functionality has been reintroduced.","Products":["CsCode-Compliance","CsCode-Framework","CsCode-TestUtility","CsCode-Workflow","Framework-Configuration","Framework-CoreFramework","Framework-Mails"]},{"SimCorpReference":"D-86119","ChangeNote":"Remove default query on active passive determination","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-85842","ChangeNote":"Corrections to the C# NetCore Services build"},{"SimCorpReference":"D-86938","ChangeNote":"Fixed issue with UETR on Swift relay massages","Products":["Business-Swift"]},{"SimCorpReference":"D-87008","ChangeNote":"New setting to control Dynamic bank account behavior is added to Order options. When the setting is unchecked, dynamic bank account is expanded and sorted according to the Show system configuration -\u003E Currency setting.\nWhen the setting is checked, dynamic bank account is expanded to BAs quoted in order\u0027s settlement currency.","Products":["Business-PortfolioManagement","Business-SettlementCostDefault","CsCode-Collateral","Framework-Configuration"]},{"SimCorpReference":"D-86918","ChangeNote":"Fixed Model Portfolio field value on Portfolio Sheet during benchmark compression.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-87252","ChangeNote":"Internal integration tests related change: clients should not be affected.","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-195786","ChangeNote":"Fixed Missing InsType Invalidates IMW Swap Security Dimension"},{"SimCorpReference":"D-87135","ChangeNote":"Database is change to handle numbers the same way as Balance Nominal number Simulation","Products":["Business-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87030","ChangeNote":"Fixed an issue in the Standard Contracts Deposits screen, wherein the three fields \u0022Term is business days\u0022, \u0022Term length\u0022 and \u0022Term unit\u0022 would not be correctly opened by the checkbox \u0022Use standard term structures\u0022.","Products":["MarketData"]},{"SimCorpReference":"D-86877","ChangeNote":"Clean UploadFileEndpointTest and do not run doDelete if fileName is null or empty","Products":["CsCode-UP"]},{"SimCorpReference":"D-86672","ChangeNote":"Only load relevant Shock Structure","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86284","ChangeNote":"The batch job \u0022Corporate Actions - Election Data Preparation\u0022 should update balances even for elections that are not included in the CAE API GET results.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-87186","ChangeNote":"The memory execution of segments when applying settlement defaults for many transactions has been optimized. E.g. when applying settlement defaults for forecasted transactions generated during a portfolio calculation.","Products":["Framework-Segments"]},{"SimCorpReference":"D-85456","ChangeNote":"On this change 3 improvements are implemented to improve strategy analysis application applet performance: (1). Optimize commitment aggregation logic when fetching middle office data; (2) Avoid unnecessary operations when computing IRR; (3) Avoid unnecessary data transformation and lookup when displaying data.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-86001","ChangeNote":"Add performance improvement for Modified Parametric VaR calculation and logs.","Products":["CsCode-RiskManagement"]},{"SimCorpReference":"D-86746","ChangeNote":"Fix result of DX_PKG.KEYEXPAND function.  IMPORTANT NOTE: this fix changes result of DX_PKG.KEYEXPAND if 3rd argument is not VARCHAR  from \u0027KEY:  42\u0027 (where 42 is value of 1st argument) to actual value of this field.","Products":["Business-DEX","Framework-Database"]},{"SimCorpReference":"D-86083","ChangeNote":"As part of performance improvements done in the Reporting pool where new Load hidden lines functionality was implemented, an unintended side-effect was that data import of Reporting pool data no longer worked. This has been fixed.","Products":["CsCode-Connectivity","CsCode-FundAccounting"]},{"SimCorpReference":"D-86353","ChangeNote":"TMP/FIN deviation is corrected if the SO Accrued interest transaction is being booked on Fin. Calc booking track and when it was prior backdated by sell on position status. The problem occurs when AI per tax lot functionality is activated on the FAM. This problem prevented saving further TLCA transactions.","Products":["Business-SystematicAdjustments","Framework-ToolsInternalAccounting","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86559","ChangeNote":"New setting  \u0022“Auto-release order after pre trade validation override\u0022\u0022 is added to Order Options to control the order release workflow.","Products":["Business-PortfolioManagement","CsCode-Compliance","Framework-Configuration"]},{"SimCorpReference":"D-87159","ChangeNote":"Target exposures and portfolio currency files shoulb be creaated only with version 2 and not with version 1 when running Axioma Batch Job.","Products":["Business-Risk"]},{"SimCorpReference":"D-87005","ChangeNote":"In some special cases when using the \u0027Pricing Method\u0027 \u0027From Key ratio calculation\u0027 and in case a \u0027Key Ratio Mapping\u0027 having \u0027Exclude from\u0027 son the \u0027Key Ratio Mapping\u0027 set to \u0027Portfolio Calculation\u0027 this setting was wrongly ignored. This has been fixed.","Products":["MarketData"]},{"SimCorpReference":"D-86329","ChangeNote":"The \u0022Price compensation\u0022 fund event did not work, when a multi-class fund invested in a pool fund. The error has been corrected.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-84583","ChangeNote":"A client specific change for loading of transactions in the portfolio calculation running on a period closure framework.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-85376","ChangeNote":"The cash effect from the commodity leg of the futures’ maturity transaction must be accounted for in the forecast cash flow service. The administrative transactions for particular holdings, which are already registered in the system should be saved into the \u0027Forecast Cash Flow - Payments\u0027 table. The instrument type for the commodity is added to the list where CP and CD already are present.","Products":["Business-CashManagement"]},{"SimCorpReference":"D-86844","ChangeNote":"Fixed an error that prevented a user from manually deleting compliance list limits when the option \u0022Keep limits when a list element is removed\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87019","ChangeNote":"Using \u0027Investment structure (oldest)\u0027 together with \u0027Is null\u0027 or \u0027Not null\u0027 didn\u0027t work. This has been corrected.","Products":["Framework-Search"]},{"SimCorpReference":"S-193965","ChangeNote":"As a user I can Allocate equity orders using Allocate form in the Web UI"},{"SimCorpReference":"D-86909","ChangeNote":"Customer-specific fix for a customer-specific issue.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-86892","ChangeNote":"Internal changes for the Collateral tests"},{"SimCorpReference":"D-85860","ChangeNote":"Webrequestcustom throws an exception when the exception message is empty, even though the getErrorResponse attribute is set to true.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-84768","ChangeNote":"Some warning messages got lost due to a recent necessary code change. Now, the behavior for multiple CA events per days should be restored by using different approach.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86942","ChangeNote":"This change fixes a crash of developer tool in external installation. No impact on business functionality.","Products":["Tools-DyalogSession"]},{"SimCorpReference":"D-86947","ChangeNote":"Fix Delete operation in PositionUniverse transporter","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"S-191510","ChangeNote":"Improve code quality","Products":["Business-AdministrativeSecurityTransactions","Business-CorporateActions"]},{"SimCorpReference":"D-86308","ChangeNote":"A fix for side effects caused by another defect that prevents unnecessary post change actions in the window \u0027Maturity Fx Outrights\u0027","Products":["Business-Transactions"]},{"SimCorpReference":"D-86717","ChangeNote":"When closing a TRS holdings in some special cases the \u0027Accrued interest QC/PC was not 0. This has been fixed.","Products":["Business-SystematicAdjustments"]},{"SimCorpReference":"D-81742","ChangeNote":"Changes to the CCDSWAPS table were not always broadcasted to the rest of the SCD One. The error has been fixed.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86803","ChangeNote":"Fix ORA crash in compliance cleanup when there is so much data to be deleted that it is split in chunks","Products":["Business-Compliance"]},{"SimCorpReference":"D-86949","ChangeNote":"Fix folder path","Products":["CsCode-Framework","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87055","ChangeNote":"The transaction generation engine should filter away planned credit events that lie before or on the position’s FROMDATE.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-86198","ChangeNote":"Fix hanging loading in treelist"},{"SimCorpReference":"D-86641","ChangeNote":"Redemption transactions is not visible in the Cash Viewer applet when the Expected Payment Date is shifted on today and historical mode is turned off. This has now been corrected.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86652","ChangeNote":"Fixed issue with deleting/modifying private debt transaction with payments","Products":["Business-Cash"]},{"SimCorpReference":"D-86845","ChangeNote":"Sensitive NetRootDirectory and oauth parameters have been removed from telemetry log.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-86897","ChangeNote":"Fix  crash for OneLib convertible bonds in Risk","Products":["Valuation"]},{"SimCorpReference":"D-86330","ChangeNote":"A database error occurred when getting dependencies for a segment using the NAIC field. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-86487","ChangeNote":"Fixed an issue in the portfolio calculation, where a missing holding of a loan facility, would abort the whole of the calculation.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-86238","ChangeNote":"Prevent crash when delta vectors are not available","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86815","ChangeNote":"Added logging information to provide more information when crash happens","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86563","ChangeNote":"The recalculation of current values and settlement amounts should not be triggered for irrelevant field changes in the truGen or truCostPstChg environment for transactions native to the window Exercise Options.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-86852","ChangeNote":"N/A: Disabling Internal integration tests","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-196262","ChangeNote":"Remove data selection changed event send to MT, since it\u0027s not needed anymore","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86747","ChangeNote":"The data cleanup service only deleted performance counter data once a month, even if the performance counter table wasn’t partitioned. This has been corrected.\n\nIf the table is partitioned data will be deleted once a month (drop partition).\nIf the table is not partitioned data will be deleted daily.","Products":["Business-Services"]},{"SimCorpReference":"D-86794","ChangeNote":"Dependencies for entries of type MOCALCMAN_OPTIOINS was missing. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-86754","ChangeNote":"Re-implemented validation in Loan Facilities to restrict changes in events transactions for which have been created already","Products":["Business-PrivateDebt","PrivateDebtStaticData","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-86776","ChangeNote":"Disable TM authorization framework for API instruments and adjusted CalcAdjustedCDSINdexAllocations","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-86902","ChangeNote":"It was not possible to stream to New UI in German installations.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86643","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86923","ChangeNote":"Remove FAP validation, client specific","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-86839","ChangeNote":"scd.exe -batch=\u003Cbatch job name\u003E -ba_queue=\u003Cbatch queue name\u003E -wait is now responding back when the job actual has finished  for long running batch job.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-86940","ChangeNote":"Reduce the risk for database deadlocks during unit tests.","Products":["Framework-Batch"]},{"SimCorpReference":"D-86713","ChangeNote":"DWH: Fixed \u0022Exception of type ApplicationException was thrown\u0022","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-86931","ChangeNote":"[TECHNICAL/3T] restored help functions still used in commands","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-86965","ChangeNote":"Fixed OTC web API tests. Changes do not affect any customer installations.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-86341","ChangeNote":"Handling cases where election data for the same CA notification is updated and calculated simultaneously by several users/processes.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86008","ChangeNote":"ABS accounting values (book values / unrealised P/L) were wrong when simulating in the Asset Manager.  This has now been corrected.","Products":["Business-PortfolioManagement","Business-Transactions"]},{"SimCorpReference":"D-86785","ChangeNote":"Technical 3T","Products":["CsCode-Framework","Framework-ApplicationFramework","Framework-CoreFramework","Framework-GuiFramework"]},{"SimCorpReference":"S-197409","ChangeNote":"For the CDS Single Name instrument in the Trade Manager, a Pair clip may have a Pair valid to date. In the context of position based life cycle events like offset close, instrument data will be reloaded from the original position, however the Pair clip field will be emptied if the Effective date is larger or equal to the Pair valid to date. If the Pair clip field is emptied, the corresponding Reference obligation field will now also be emptied - previously this field would still be populated.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-86806","ChangeNote":"Making market data validation set up consistent with schedule.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-86637","ChangeNote":"Fixed the re-initialization of auxillary jobs when deleting reporting pool records","Products":["Business-ReportingPool"]},{"SimCorpReference":"D-86870","ChangeNote":"Remove unit test formulas from the client\u0027s installation.","Products":["XpressInstruments"]},{"SimCorpReference":"D-86632","ChangeNote":"Fixing binding issue, fix has been patched into 25,04 and 25,07 as well","Products":["CsCode-UP"]},{"SimCorpReference":"D-86799","ChangeNote":"Fixed issue with slow performing query that read ratings data.  This could lead to a slow startup of the Asset Manager","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86623","ChangeNote":"Client specific change: Changed error, when reversing a payment with PCL records using the STP/Batch Job, into a warning.","Products":["Business-GeneralLedger"]}]