[{"SimCorpReference":"D-95119","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job provides decomposition data for the Investment Analytics Platform (IAP). This is used to calculate market values and cash flows in both RC and LC on decomposed fund components. The calculation in LC is currently done based on component returns in LC and weights in RC. This is incorrect and the resulting market values and cash flows does not produce the correct return in LC.\n\nThe LC calculation should be done using weights in LC instead of RC. This correction enhances the \u0027Generic Decomposition - Upload Results\u0027 batch job, so it produces a daily file with weights in LC.","Products":["Performance"]},{"SimCorpReference":"D-95133","ChangeNote":"Use the full discounting curve for SOFR IRF","Products":["Valuation"]},{"SimCorpReference":"D-95827","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-95249","ChangeNote":"Flaky test ignored","Products":["Business-DEX"]},{"SimCorpReference":"D-95329","ChangeNote":"In case of huge tables \u0027Loading\u0027 in the \u0027Netting Manager\u0027 could get very slow. This has been fixed.","Products":["Business-Netting"]},{"SimCorpReference":"D-95362","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job produces data files with decomposed fund components for the Investment Analytics Platform. The result set includes a position that represents the residual from the decomposition. Residual components do not have a security and all security derived dimensions should therefore be undefined for the residual position, meaning that the internal dimension value key (IK) should be zero and the external dimension value ID should be \u0027Undefined\u0027. When using the hard coded list of dimensions, i.e. when not using attribute configuration, the external ID was set to an empty string (null) for the instrument type dimension on the residual position. This produces a validation error when the files are processed by Investment Analytics Platform. The \u0027Performance Calculation -  Upload Results\u0027 batch job has exactly the same error when \u0027Upload decomp. funds\u0027 is selected in the related data source definitions.\n\nThe error has been corrected so the external ID is set to \u0027Undefined\u0027 when the instrument type dimension value is undefined.","Products":["Performance"]},{"SimCorpReference":"D-94477","ChangeNote":"The Asset Manager Calculation service will now use a pool of db connections - it used to only use a single connection.  This will make the service faster in some scenarios (example: Current Positions api depending on the selected fields)","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-95209","ChangeNote":"Add Processing Timeout field for Document Processing tab in Interface Options","Products":["Framework-Configuration","CsCode-AltInv","Business-AlternativeInvestments"]},{"SimCorpReference":"D-95686","ChangeNote":"When the credit impaired interest was calculated on the tax lots, the values were rounded separately for each tax lot, causing the rounding difference on the aggregation to the P/L level. Now the rounding is made after the aggregation with the following re-distribution to the P/L match level, providing more accurate result.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-95495","ChangeNote":"Input fields  in other applet now get update events when setup is  changed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-95979","ChangeNote":"When queueing a batch job via scd.exe or scdbatchqueue.exe and waiting for the result and the service platform is not responding the job were returning error level 1061 Command line error and not 1068 Proxy communication error. This has been corrected.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-95858","ChangeNote":"In case Level 3 compliance data was removed as separate task, and there is more than 10Mio records to delete in level 2 - cmpl cleanup job will end up in endless loop. Was fixed","Products":["Business-Compliance"]},{"SimCorpReference":"D-96003","ChangeNote":"Flaky test fixed. reason was a parralel execution of tests. Additional condition for testing portfolio (with the exact testing transactions) has been added.","Products":["Business-Match"]},{"SimCorpReference":"D-95854","ChangeNote":"CDS_index from FINCAD was called even though OneLib was specified as analytics library in certain circumstances","Products":["Valuation"]},{"SimCorpReference":"D-95471","ChangeNote":"Disable ability to modify Security group and Security type of already saved contract terms (workaround: make copy)","Products":["TradeManager"]},{"SimCorpReference":"D-94737","ChangeNote":"Logic for copying Reference 2 value to second leg was introduced","Products":["Business-DealerOTCTransactions","Business-Transactions"]},{"SimCorpReference":"D-95836","ChangeNote":"Add new field Axioma Data ID to the risk factors/rf segments windows and related table","Products":["Business-Risk"]},{"SimCorpReference":"D-95811","ChangeNote":"Decomposition will occasionally fail due to excessive memory use. This is now corrected.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95668","ChangeNote":"Re-running the conversion program convTmStaticDataOnly after upgrade could cause data corruption causing Trade Manager Contract Terms Contracts not to load. This was fixed.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-95907","ChangeNote":"It wasn\u0027t possible to update Trade Manager Items and Fields (AUTTRADEMGRITEMS) setups using Xpress instrument types. This has been corrected.","Products":["Framework-Authorisation","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-95859","ChangeNote":"Exporting Snowflake user schema crashes. Was fixed","Products":["Business-DEX"]},{"SimCorpReference":"D-95902","ChangeNote":"DWH Web API Integration: Updated Perf API Templates with correct data type for variables","Products":["Business-Reporting"]},{"SimCorpReference":"D-94901","ChangeNote":"Execute the Reinvestment Rules one by one to prevent a deadlock in database.","Products":["Business-Risk"]},{"SimCorpReference":"D-95324","ChangeNote":"Allowed hostnames up to 200 characters in UI for configurations for IAP Direct Communication Service, and corrected error in same service where it couldn\u0027t filter on GroupCode groupings.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-95552","ChangeNote":"Correct CDS price sign when it is component of a fund and when there are multiple holdings in that fund","Products":["Business-Risk"]},{"SimCorpReference":"D-95448","ChangeNote":"Updated Zlib1.dll to newest version.","Products":["Framework-CoreFramework","Tools-Utilities"]},{"SimCorpReference":"D-95398","ChangeNote":"Authorisation check on Extraction Definition window takes a lot of time. Try to reduce this by running it on unique set of tables","Products":["Business-DEX"]},{"SimCorpReference":"D-95755","ChangeNote":"Enable APL interface tests in MG","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-95102","ChangeNote":"Fixed npm vulnerabilities for 25.10 version","Products":["CsCode-Transaction","Web-UC"]},{"SimCorpReference":"D-93830","ChangeNote":"After repeating all the steps from file with reproduction, the error was not caught","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-95548","ChangeNote":"Install browsers on agents","CustomerApplyNote":"Install Playwright browsers on agents"},{"SimCorpReference":"D-95741","ChangeNote":"GL transactions export- in case no portfolio and portfolio group are shown for unauthorised user, no any portfolio condition was applied to find finance transactios. In this way the user was able to compress the finance transactions that he is not supposed to see. This has been fixed","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-95456","ChangeNote":"Abort calculation without showing results in case of missing one of legs in multi-legged transactions","Products":["Business-AustralianCgt","CsCode-Accounting"]},{"SimCorpReference":"D-95485","ChangeNote":"When the warnings are present and not ignored during saving OTC transactions from Trade Manager and the user is asked to continue, the  booking engine was run before the prompt message is displayed. This affected the performance and now is improved: the run of the booking engine is excluded before the warning is accepted by a user.","Products":["Business-DealerOTCTransactions","Business-Transactions"]},{"SimCorpReference":"D-95546","ChangeNote":"Fixed benchmark TWR calculation in Performance Measurement with Average key ratios calculation enabled for currency hedged benchmark with first hedged reset date defined in Index Hedge Definition before the calculation loop from date.","Products":["Benchmarks"]},{"SimCorpReference":"D-95450","ChangeNote":"Alert inbox: add 500ms delay before starting to fetch additional alert data for compliance alerts.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95746","ChangeNote":"Correct ImsBranch in Transactions RVP settings","Products":["Business-SettlementManager"]},{"SimCorpReference":"D-94305","ChangeNote":"Correction of incorrect Date latest coupon behavior in the Nominal framework for increment","Products":["Business-AdministrativeSecurityTransactions","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-95409","ChangeNote":"Correction of the program error that occurs during the running portfolio calculation while simulating payment date booking.","Products":["Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-95405","ChangeNote":"Fix issue where input fields with similar names return multiple results instead of the exact match","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-95219","ChangeNote":"Only use one common InputFieldDefinitionManagerVolatile . Change wait time to 5 seconds.","Products":["CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94775","ChangeNote":"Fixing issue where released orders did not generate broker restrictions in a timely fashion.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95264","ChangeNote":"Correct Order manager amend allocation flow for deal allocation transactions","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-94297","ChangeNote":"Fix Oracle hints  overwrite in DEXs to empty values when merging DWH target with IMW","Products":["Business-DEX","Business-DWH"]},{"SimCorpReference":"D-95183","ChangeNote":"In the \u0027Trade Repository Pool\u0027 \u0027Nominal balance after trade\u0027 was wrongly determined as 0, in case \u0027Opening Sequence number\u0027 was not defined a \u0027Accounting split field\u0027 in the relevant FAP. This has been fixed.","Products":["Business-Reporting"]},{"SimCorpReference":"D-95283","ChangeNote":"Fix of missing custom attributes (PortfolioGroup)  in the Cash Viewer for BA/CB","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94976","ChangeNote":"Last PFC copy should be used when reconciling PFC results.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-94980","ChangeNote":"The system performance of compliance validations with rating rules has been improved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86213","ChangeNote":"A Compliance-Manager-related issue with multi-legged instruments has been fixed. It occurred when rules with different accounting views were validated together. In that case, the system failed to find all legs of a holding and returned a data exception for attributes like \u0022Currency opposite leg\u0022 or \u0022Nominal absolute legged\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95421","ChangeNote":"The composition of the inflation curve when \u0022Include CPI values\u0022 = true has been corrected such that the lag defined on the RPI on the contract is correctly taken into account when \u0022Decompose XpressInstruments\u0022 is used.","Products":["XpressInstruments"]},{"SimCorpReference":"D-95125","ChangeNote":"Fixed database crash which occurred in \u0027General Reconciliation\u0027 during execution when file contained a value bigger than the max nr of characters for the reconciliation fields : reconciliation free codes 1 to 4. Now the imported values are trimmed to maximum length of the fields (2000 char)","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-93182","ChangeNote":"Resolve issue on PCL inconsistency in the adjustment default date field caused by a transaction with system-owned reversal is later deleted.","Products":["Business-PeriodClosure","Business-PortfolioCalculation","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-95512","ChangeNote":"Fix web API tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-95266","ChangeNote":"There was no possibility to define path for the Asset Manager Online logging trace files. Now the path can be defined on Front Office tab of Support Tool Options form with default local temp directory (as before) when the path is not specified.","Products":["Business-FrontOfficeData","CsCode-PortfolioManagement","Framework-Configuration"]},{"SimCorpReference":"D-95443","ChangeNote":"When modifying backdated repo trades in the trade manager then accrued interest calculations in PFC for PCL framework can flip sign an be completely wrong. This has been fixed.","Products":["Business-DealerOTCTransactions","Business-PortfolioCalculation","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-95325","ChangeNote":"When doing database trace on a connection to another tablespace than the SimCorp Dimension tablespace then it was tried to save the name of the trace file a SimCorp Dimension table. This fails due to that the connection does not have access to the table. This has been fixed.","Products":["Framework-Database"]},{"SimCorpReference":"D-94454","ChangeNote":"Do not send repeatedly the same wof.-file from WM Owner to consumer","Products":["Business-Connectivity"]},{"SimCorpReference":"D-95351","ChangeNote":"Formula mapping were incorrect after merge of standard facts/dimensions if some new standard fields were added. Was fixed","Products":["Business-DEX"]},{"SimCorpReference":"D-95340","ChangeNote":"Make the captions of the transaction codes for the old and new functionality for the CDS Option instrument type more distinct.","Products":["Business-DealerOTCTransactions","Business-TransactionBookingAccounting","CsCode-Trading"]},{"SimCorpReference":"D-94823","ChangeNote":"TVPI calculations did not work without PICC benchmark-data. A fallback PICC estimation using contribution rates from the relevant forecast model has been introduced. The approach is the same as what is used when we calculate distribution rates.\n\nThe fallback is used bot when calculating TVPI values with the alternative investment manager forecasts functional but will also impact the right click \u0027Show Benchmark Data for TVPI\u0027 in the \u0027Fund model\u0027 window.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-94147","ChangeNote":"added a new config pram to enable the tab.","Products":["Business-Risk","CsCode-Framework","CsCode-MiddleOffice"]},{"SimCorpReference":"D-95478","ChangeNote":"Fix a problem where FX Option were not available in Order Type Restrictions in preview drops.","Products":["TradeManager"]},{"SimCorpReference":"D-94738","ChangeNote":"When calculating a \u0027Volatility Curve\u0027 Definition having \u0027SABR Shift\u0027 checked in very rare cases a database error could occur. This has been fixed.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94705","ChangeNote":"Special ex/cum functionality can be disabled from a specific end-date in Transaction Options.\nWhen disabled, but Dividends was created before the end-date, the dividend payment date was used instead of the ex date for calculating the nominal basis.\nThis was not correct as before it was disabled it was the ex date that was used for calculating the nominal basis.\n\nThe problem has been solved by using the ex date also when the functionality is disabled, but dividends are generated before the end-date.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94689","ChangeNote":"fix for maturity date full field in IMW transactions fact","Products":["Business-Reporting"]},{"SimCorpReference":"D-94586","ChangeNote":"When importing the Risk and Performance Analytics Configuration from version 25.07 and earlier to a higher version, a crash occurs due to the new Axioma Stress Test tab. This issue has been fixed.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-95091","ChangeNote":"Support fixings cap/floor for FRNs with different coupon and compounding calendars","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94379","ChangeNote":"Enhance RVP test framework to support load balancing AM cache job and add a few RVP tests for it.","Products":["CsCode-FrontOffice","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-95026","ChangeNote":"List history: Improve system performance related to viewing list history when list has been through 4-eyes approval.","Products":["Business-Compliance","CsCode-Compliance"]},{"SimCorpReference":"D-94514","ChangeNote":"Target Name in DWH Load Monitor has index defined in Load Plan for jobs executed in parallel.","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-95171","ChangeNote":"Flaky test ignored","Products":["Business-PrivateDebt","XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-95242","ChangeNote":"Remove Limit Configuration and Results: Change the way tables are emptied","Products":["Business-Limits"]},{"SimCorpReference":"D-95188","ChangeNote":"Fixed failing unit tests in the SimCorp.IMS.AltInv.DocProcessing.IntegrationTest namespace.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-95162","ChangeNote":"When approving multiple alerts at the same time, threshold approval is not possible.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94993","ChangeNote":"Fix problem with non-optimized db requests","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91272","ChangeNote":"Pre-trade performance optimization: System performance problems in the order-result association logic has been optimized. The problem was especially noticeable in in result of relative rules with MANY positions (\u003E10.000) and MANY numerators (\u003E1.000).","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95106","ChangeNote":"Enable the satellites for RTMAIN to detect contention situations by examining the lag in received ALIVE messages  and correct a flaw in the serialization logic of the RTRefinitiv price flushing flow which led to performance degradation.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-94914","ChangeNote":"Fixed an error related to client restriction rules in Compliance. This error can lead to a crash when the client restriction definition for a portfolio is empty.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94373","ChangeNote":"Removed outdated WinForms settings","Products":["Business-Transactions"]},{"SimCorpReference":"D-94423","ChangeNote":"The \u0022Multi Manual Finance Transaction\u0022 form now has an extra validation preventing saving, when the decimals on the amounts does not correspond to the digits on the corresponding currency.","Products":["Business-Transactions"]},{"SimCorpReference":"D-94935","ChangeNote":"After this change the missing FX rates will be reported correctly.","Products":["Performance"]},{"SimCorpReference":"D-94674","ChangeNote":"The code that uploads data for MTM status codes for the Trade Manager should check whether the domain dGST is installed.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-95217","ChangeNote":"Crash ocured when calulation risk figures with imported sensitivities for Sredit Default Swap. That was fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-95211","ChangeNote":"Generated a new temporary FrontDoor for Playwright"},{"SimCorpReference":"D-94880","ChangeNote":"Fixed scaling of MC shocks for RFs with absolute return for Random By Factor generator.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94888","ChangeNote":"The ordering of the calculation engine results is corrected to be based on the holding keys.","CustomerApplyNote":"The ordering of the calculation engine results is corrected to be based on the holding keys.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-94525","ChangeNote":"Code changes to calculate rounded dirty value when Round Amount Per Contract tick box is ticked for Asset Manager","Products":["Instruments","StaticData"]},{"SimCorpReference":"D-94728","ChangeNote":"Fixed the crash on creating a LoadPlan for a DWH Model having semicolon-separated list of values for the ExpireDeletedRecords Configuration Parameter","Products":["Business-DWH"]},{"SimCorpReference":"D-94385","ChangeNote":"Upload cloning functionality for SAAM benchmark positions in order to support filtering by Model Portfolio Holding filter","Products":["CsCode-FrontOffice","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-95190","ChangeNote":"(IAP2CLOUD DWH) Updated Performance Templates and Facts with Investment Structure","Products":["Business-Reporting"]},{"SimCorpReference":"D-95174","ChangeNote":"Fixed position termination inside year. Performance Calculation - upload results batch job","Products":["Performance"]},{"SimCorpReference":"D-94851","ChangeNote":"Save column width in pixels if set as a percentage by dx","Products":["Web-UC"]},{"SimCorpReference":"D-95154","ChangeNote":"Use custid instead of custname when check","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-94966","ChangeNote":"Flaky test ignored","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-94720","ChangeNote":"Risk factor Sensitivities with price method ‘Quoted price \u002B yield curve, str prod’  ignore OAS for Callable bonds.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-94831","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job produces fund decomposition data for the Investment Analytics Platform. The solution was flawed in the scenario where a component moves out of the fund, e.g. in case of a sell transaction. In this case, the market value SOD and cash flow SOD values that corresponds to the \u0022moves out\u0022 would appear on the residual instead of on the component itself.\n\nThe problem has been solved by enhancing the \u0027Generic Decomposition - Upload Results\u0027 batch job, so it produces a data record for the component on the day it moves out. The record has SOD and EOD weights equal to zero to dictate that the component moves out. With this additional data record, the market value SOD and cash flow SOD values appear on the component itself, thus resulting in a better decomposition.\n\nPlease note that existing data in the Investment Analytics Platform will not be impacted by this correction. A new \u0027Generic Decomposition - Upload Results\u0027 is needed for this correction to impact the results in the Investment Analytics Platform.","Products":["Performance"]},{"SimCorpReference":"D-95097","ChangeNote":"The base data files are being overwritten for each iteration of the loop when running a \u0022Performance Calculation - Upload Results\u0022 batch job. Error was fixed.","Products":["Performance"]},{"SimCorpReference":"D-95110","ChangeNote":"OneLib CMSSO: Fix boundary issue for OAS price calibration [26.01]","Products":["Instruments"]},{"SimCorpReference":"D-93456","ChangeNote":"Amounts for benchmark groups are calculated incorrectly. In case if a security is in several benchmarks and (accordingly) benchmark holding groups, it\u0027s total amount was populated to all the groups without distributing it in accordance with the actual amount weights. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-94612","ChangeNote":"Fixed the joins based 24.04 version and change source of fields ASSRESULT and CMPLRESULT","Products":["Business-Reporting"]},{"SimCorpReference":"D-95143","ChangeNote":"Flaky test ignored","Products":["Business-PrivateDebt"]},{"SimCorpReference":"D-95063","ChangeNote":"Add Portfolio free code 6 to popup dialog","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94843","ChangeNote":"Benchmark Purpose \u0026 BM from \u0027Benchmark Assignment\u0027not to be selectable in Model Maintenance","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94312","ChangeNote":"Update of RVP tests (internal)","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"S-214368","ChangeNote":"Sensitivity FIPA effects hierarchy information was added to metadata file.","Products":["Performance"]},{"SimCorpReference":"D-95023","ChangeNote":"Filter out non-IMS test runs from flaky test reporting"},{"SimCorpReference":"D-94368","ChangeNote":"Revert changes made for processing parentheses in the value property of \u003Csetvalue\u003E CDL statement","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-95003","ChangeNote":"Add more explicit searching transactions condition","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-95029","ChangeNote":"Fixed a recently introduced issue where identical entries in the bank log caused incorrect calculation of the Bank Account holding in the Portfolio calculation.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-95011","ChangeNote":"Add project version to npm audit report title","Products":["Web-UC"]},{"SimCorpReference":"D-94776","ChangeNote":"Extra validation added to series symbol and full symbol for future rolling. Now we also check the characters are uppercase and that the full symbol ends with a digit.","Products":["Instruments"]},{"SimCorpReference":"D-94925","ChangeNote":"Added -autrole and -pmg to list of acceptable command line arguments"},{"SimCorpReference":"D-94243","ChangeNote":"Create data import for the Generic Risk Factor Sensitivity window","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-95062","ChangeNote":"Adding simulation macros to SST","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-219814","ChangeNote":"Added PFCSUBLOPENPMT table to Position Open Payment Fact in IMW","Products":["Business-Reporting"]},{"SimCorpReference":"S-222404","ChangeNote":"Changes to internal tests, no impact on business logic.","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-94472","ChangeNote":"MSCI, ExchTraded model: fetched Settlement price for the Bond/Euity Forward in case when it is a fund component. And replace pCLEAN with pCLEANUND","Products":["Business-Risk"]},{"SimCorpReference":"D-94663","ChangeNote":"A program error occurred when loading a record using a deleted reference date. This has been corrected.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94681","ChangeNote":"The portfolio calculation did not include a bank account position having a zero balance on the first calculation date, but a non-zero balance on the last calculation date. The problem was that a cost/tax payment in the bank account had a cost payment date prior to its transaction agreement date; while the last portfolio calculation date was later than the cost payment date, but prior to the transaction agreement date. The zero-position check in the portfolio calculation did not find such payments. The error has been corrected for both bank accounts and cash buckets.","Products":["Framework-Common"]},{"SimCorpReference":"D-94886","ChangeNote":"Making Calculate average execution time event compatible with schedule.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-94814","ChangeNote":"Add explicit portfolio group fetch for Message Queue messages processing","Products":["Business-SettlementManager"]},{"SimCorpReference":"S-222403","ChangeNote":"Once a second done adjustment exists on the TRS basket, no more adjustment could be added. This was fixed in the Trade Manager.","Products":["XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-94974","ChangeNote":"Fix error message in \u0022Front office model - Execute\u0022 batch job","Products":["Business-Modelling"]},{"SimCorpReference":"D-94637","ChangeNote":"Corrected name of group totals title for Deviations in result monitor applet","Products":["Reconciliation"]},{"SimCorpReference":"D-94745","ChangeNote":"DWH: Fixed database field overflow when serializing flow events","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-94933","ChangeNote":"A program error occurred when using  \u0027Start Batch Job Group\u0027 in the \u0027Batch Monitor\u0027. this has been corrected.","Products":["Framework-Batch"]},{"SimCorpReference":"D-94677","ChangeNote":"It is client specific code to introduce a check to ensure that when the MDV event is seen to be ready, it truly does not have any un-validated unfinished MDV events linked to the fund. When there are un-validated unfinished MDV events, then STP process allows rules that fail but have an error level of warning to skip the check and allow the validation to continue. An extra information is logged for further investigation.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-94627","ChangeNote":"New file extensions have been whitelisted for SCDWeb. And         started to display error message instead throwing the error if we call the code inside.","Products":["CsCode-UP","CsCode-UpLogicalForms","CsCode-Framework"]},{"SimCorpReference":"D-94981","ChangeNote":"The change is not relevant for clients. It handles the timeout issues with internal testing pipeline (RVP)."},{"SimCorpReference":"D-94797","ChangeNote":"fix modules audit","Products":["Web-UC"]},{"SimCorpReference":"D-94734","ChangeNote":"Add additional condition for finding linked parcels - if system found the original parcel - finish the search and move to other parcel","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-94584","ChangeNote":"Calculation definitions - main buffer updated with validation status along with base filter updated with these fields.","Products":["Business-FundAccounting"]},{"SimCorpReference":"S-222126","ChangeNote":"Added Simulation_ID field to all pairs of instrument type \u002B transaction type, which support the creation of simulations.  Simulations can be updated via the OTC Web Api using PUT requests.","Products":["XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-94732","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-94777","ChangeNote":"Performance optimization when handling many aux jobs.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-94464","ChangeNote":"Customer specific fix to reduce the size of compliance pre-trade results.","Products":["Business-Compliance","CsCode-Compliance"]},{"SimCorpReference":"D-94796","ChangeNote":"Insert error message on missing ISIN at WM owner pool","Products":["Business-Connectivity"]},{"SimCorpReference":"D-94047","ChangeNote":"Added optional  floatOffset tag to the GenericBondModel, overnightIndexedCoupons section","Products":["Business-Risk"]},{"SimCorpReference":"D-94647","ChangeNote":"Return error if too many decimals in import data","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94837","ChangeNote":"Increase a regex timeout for analyzing complex rules and fragments while validation","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94489","ChangeNote":"After UP source code move some assemblies are missing from bundle"},{"SimCorpReference":"D-93624","ChangeNote":"Handle race condition when closing sessions in AzureLoadTest","Products":["CsCode-UpLogicalForms","CsCode-UP"]},{"SimCorpReference":"D-94706","ChangeNote":"AIP IMW tables adjustments and 3 new tables added. Prefix changed from BF to BR","Products":["Business-Reporting"]},{"SimCorpReference":"D-93169","ChangeNote":"Do not recalculate FRA/IRF price if it is given as input.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-92275","ChangeNote":"Fix a bug with Data Warehouse Web API Data Source Editor where compilation was not possible on some environments","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-93568","ChangeNote":"Collateral Manager: Accrued interest on Collateral/Market/Available positions is calculated based on the calculation date plus the allocation days.","Products":["Business-Collateral"]},{"SimCorpReference":"D-94290","ChangeNote":"\u0022Open folder\u0022 button on the Order Outbox ribbon had no image with Large resolution. This has now been corrected.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86678","ChangeNote":"Removed arbitrary limit of at most showing 10000 rows in all Trade Manager search applets.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-94396","ChangeNote":"The composition of the inflation curve when \u0022Include CPI values\u0022 = true has been corrected such that the lag defined on the RPI on the contract is correctly taken into account.","Products":["XpressInstruments"]},{"SimCorpReference":"D-94302","ChangeNote":"Fixed redemption payment date for callable bonds if call/put option is applied and option date falls on a holiday.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94445","ChangeNote":"Elementary transaction components with message status ‘Rescheduled’ or ‘Error’ can safely be set \u0027On Hold\u0027 and should not be categorized as invalid.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-94471","ChangeNote":"The compliance service only request the pricing and key ratios service to calculate/return values for user definable key ratios (UDKRs) that are in use in compliance. There was a problem in the in-use detection in pre-trade test checks, if the UDKR was only used on a draft rule. This has been resolved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94470","ChangeNote":"Structured ABSs incorrectly used future Pool Factors in valuation. \n\nAnd in general bond options did not take effects analysis date into account for the underlying bond.","Products":["Valuation"]},{"SimCorpReference":"D-94601","ChangeNote":"Fix a crash in processing CDS index transactions on  STP transaction status service.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-94371","ChangeNote":"A database error occurred when executing the batch task  \u0027Performance Calculation - Upload Results\u0027. this has been corrected.","Products":["Performance","Framework-Database"]},{"SimCorpReference":"D-93677","ChangeNote":"Added available memory check before looking for N*M match combinations to avoid WS FULL errors.","Products":["Business-Match"]},{"SimCorpReference":"D-94622","ChangeNote":"Added Simulation_ID field to all pairs of instrument type \u002B transaction type, which support the creation of simulations.  Simulations can be updated via the OTC Web Api using PUT requests.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-94638","ChangeNote":"An error could occur in the \u0027Portfolio Calculation\u0027 in case \u0027Adjustment frequency\u0027 was not set to \u0027\u0027No adj.\u0027 and in case at least one \u0027Hedge\u0027 position with Hedge adjustment\u0027 \u0027Freeze\u0027 and \u0027Hedge risk free price adjustment method\u0027 \u0027Dollar offset - Retrospective (constant spread and curve)\u0027 was supposed to be calculated. This has been fixed.","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-94438","ChangeNote":"In some situations, Oracle chose a wrong execution plan leading to a very bad performance for the ‘Initialising – Building keys...’ step. This has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-92211","ChangeNote":"The database load generated by the message queue service when looking for messages to process has been reduced.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-94576","ChangeNote":"In Fund definitions; copying a fund certificate should not create a new entry on class fund. This issue has now been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-94398","ChangeNote":"Form \u0022Central Trade Manager\u0022. The issue when the menu item \u0022Send  Reject Message\u0022 was always enabled if an Alleged Message and an ordinary transaction are selected has been fixed.","Products":["Business-CentralTradeManager"]},{"SimCorpReference":"D-94439","ChangeNote":"Allow OTC Web API query HasOrderSupport for the given instrument in the installation where it runs, rather than determining order support statically","Products":["CsCode-Trading"]},{"SimCorpReference":"D-94328","ChangeNote":"Made \u0022Side\u0022 values consistent in responses between data retrieval Pretrade API v3 endpoints","Products":["CsCode-FrontOffice","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94336","ChangeNote":"The sub tab \u0022Change Portfolio Booking Date\u0022 on the \u0022Portfolio\u0022 -\u003E \u0022Extra Information\u0022 -\u003E \u0022Info\u0022 is now hidden. No change in user functionality.","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-94683","ChangeNote":"Optimize code finding client benchmark from model portfolio.","Products":["Performance"]},{"SimCorpReference":"D-94639","ChangeNote":"Corrected request examples in Swagger for Pretrade API CreateContingencyBegin endpoint","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94596","ChangeNote":"The query used to find cash bucket positions/movements when using Period Closure has been optimized.\nTechnical: \n- An existing index on table TRANSSUBLRPDATES has been changed (extra column added). \nUpdating this index during upgrade may take some time.\n- Hint has been added to force Oracle to use the correct index on table TRANSSUBLEDGER","Products":["Business-GeneralLedger","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-89240","ChangeNote":"When technical transactions are generated for cash bucket and bank accounts on nominal framework, the subsequent P/L framework is impacted and generating technical transaction on the same day for  P/L framework gets incorrect figures for balance fields (QC/PC). This change fixes this issue.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-94709","ChangeNote":"An error could occur when one GCA framework was installed in the SCD installation and all GCA values were 0 on the transaction. This has bene fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-94682","ChangeNote":"To improve the performance of the validation when saving US pool static data, a new index has been created on IBI.POOLNO.","Products":["StaticData"]},{"SimCorpReference":"D-94599","ChangeNote":"Reduce the database load (table SECBUSCLASSTS) when loading Parties.","Products":["Business-ReferenceDataTransactions"]},{"SimCorpReference":"D-94591","ChangeNote":"Reduce the database load generated by the Collateral dashboard service by optimizing SQL statements.","Products":["Business-Collateral"]},{"SimCorpReference":"D-94594","ChangeNote":"Reduce the database resources used when saving Data Warehouse information during the save of Performance Reports results (Oracle table PERFREPDELNODEINFO). The change will only affect customers having Data Warehouse installed.","Products":["Performance"]},{"SimCorpReference":"S-220570","ChangeNote":"20251124.1084353.25556"},{"SimCorpReference":"D-94519","ChangeNote":"Implemented missing condition for standalone portfolio","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-93560","ChangeNote":"Removed vulnerable packages from apigw"},{"SimCorpReference":"D-94400","ChangeNote":"Empty portal schema should be threated as an error","Products":["CsCode-Framework","CsCode-UpLogicalForms"]}]