[{"SimCorpReference":"D-95811","ChangeNote":"Decomposition will occasionally fail due to excessive memory use. This is now corrected.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95219","ChangeNote":"Only use one common InputFieldDefinitionManagerVolatile . Change wait time to 5 seconds.","Products":["CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-95552","ChangeNote":"Correct CDS price sign when it is component of a fund and when there are multiple holdings in that fund","Products":["Business-Risk"]},{"SimCorpReference":"D-95448","ChangeNote":"Update Zlib1.dll.","Products":["Framework-CoreFramework","Tools-Utilities"]},{"SimCorpReference":"D-95398","ChangeNote":"Authorisation check on Extraction Definition window takes a lot of time. Try to reduce this by running it on unique set of tables","Products":["Business-DEX"]},{"SimCorpReference":"D-95748","ChangeNote":"FIX DSL. Ensure All broker restrictions are available via BrokerList in the overrides"},{"SimCorpReference":"D-95102","ChangeNote":"Fixed npm vulnerabilities for 25.10 version","Products":["CsCode-Transaction","Web-UC"]},{"SimCorpReference":"D-93830","ChangeNote":"After repeating all the steps from file with reproduction, the error was not caught","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-95548","ChangeNote":"Install browsers on agents","CustomerApplyNote":"Install Playwright browsers on agents"},{"SimCorpReference":"D-94347","ChangeNote":"Fix RVP pipeline(allow to bind test tool \u0022MockServer\u0022 to a port) \u002B Ensure MockServer based tests use proper communication configs in different environments (VMs) to connect to it","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-95741","ChangeNote":"GL transactions export- in case no portfolio and portfolio group are shown for unauthorised user, no any portfolio condition was applied to find finance transactios. In this way the user was able to compress the finance transactions that he is not supposed to see. This has been fixed","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-95456","ChangeNote":"Abort calculation without showing results in case of missing one of legs in multi-legged transactions","Products":["Business-AustralianCgt","CsCode-Accounting"]},{"SimCorpReference":"D-95546","ChangeNote":"Fixed benchmark TWR calculation in Performance Measurement with Average key ratios calculation enbled for currency hedged benchmark with first hedged reset date defined in Index Hedge Definition before the calculation loop from date.","Products":["Benchmarks"]},{"SimCorpReference":"D-95450","ChangeNote":"Alert inbox: add 500ms delay before starting to fetch additional alert data for compliance alerts.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95746","ChangeNote":"Correct ImsBranch in Transactions RVP settings"},{"SimCorpReference":"D-95409","ChangeNote":"Correction of the program error that occurs during the running portfolio calculation while simulating payment date booking.","Products":["Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-94147","ChangeNote":"added a new config pram to enable the tab.","Products":["Business-Risk","CsCode-MiddleOffice","CsCode-Framework"]},{"SimCorpReference":"D-95720","ChangeNote":"Update FNS NATS consumer to avoid duplicated messages"},{"SimCorpReference":"D-94297","ChangeNote":"Fix Oracle hints  overwrite in DEXs to empty values when merging DWH target with IMW","Products":["Business-DEX","Business-DWH"]},{"SimCorpReference":"D-95405","ChangeNote":"Fix issue where input fields with similar names return multiple results instead of the exact match","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-95690","ChangeNote":"When executing general reconciliation, wrong comments, classifications, etc. could be assigned (copied) to new external records, if there were only external results in the execution. This was corrected.  Now all identification fields from all the reconciliation lines are used to identify if new unmatched external records should get a comment copied or not. Previously, only ID fields from rules for which internal records existed were considered.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-95264","ChangeNote":"Correct Order manager amend allocation flow for deal allocation transactions","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-95183","ChangeNote":"In the \u0027Trade Repository Pool\u0027 \u0027Nominal balance after trade\u0027 was wrongly determined as 0, in case \u0027Opening Sequence number\u0027 was not defined a \u0027Accounting split field\u0027 in the relevant FAP. This has been fixed.","Products":["Business-Reporting"]},{"SimCorpReference":"D-94775","ChangeNote":"Fixing issue where released orders did not generate broker restrictions in a timely fashion.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95283","ChangeNote":"Fix of missing custom attributes (PortfolioGroup)  in the Cash Viewer for BA/CB","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94980","ChangeNote":"The system performance of compliance validations with rating rules has been improved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95421","ChangeNote":"The composition of the inflation curve when \u0022Include CPI values\u0022 = true has been corrected such that the lag defined on the RPI on the contract is correctly taken into account when \u0022Decompose XpressInstruments\u0022 is used.","Products":["XpressInstruments"]},{"SimCorpReference":"D-95512","ChangeNote":"Fix web API tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-95451","ChangeNote":"Fixed an error that can lead to a very high memory consumption on the pre-trade and post-trade compliance services.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95351","ChangeNote":"Formula mapping were incorrect after merge of standard facts/dimensions if some new standard fields were added. Was fixed","Products":["Business-DEX"]},{"SimCorpReference":"D-94689","ChangeNote":"fix for maturity date full field in IMW transactions fact"},{"SimCorpReference":"D-93182","ChangeNote":"Resolve issue on PCL inconsistency in the adjustment default date field caused by a transaction with system-owned reversal is later deleted.","Products":["Business-PeriodClosure","Business-PortfolioCalculation","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-95340","ChangeNote":"Make the captions of the transaction codes for the old and new functionality for the CDS Option instrument type more distinct.","Products":["Business-DealerOTCTransactions","Business-TransactionBookingAccounting","CsCode-Trading"]},{"SimCorpReference":"D-93689","ChangeNote":"If a user was trying to connect to Bloomberg using DAPI in the Asset Manager to get real time prices/fx rates and there was an authentication issue this was not shown to the user","Products":["CsCode-PortfolioManagement","CsCode-RealTime"]},{"SimCorpReference":"D-94738","ChangeNote":"When calculating a \u0027Volatility Curve\u0027 Definition having \u0027SABR Shift\u0027 checked in very rare cases a database error could occur. This has been fixed.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-95455","ChangeNote":"Refined our internal test process to ensure expected behavior. The message now appears only as an informational/warning notice rather than an error, with no impact on business operations","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-94705","ChangeNote":"Special ex/cum functionality can be disabled from a specific end-date in Transaction Options.\nWhen disabled, but Dividends was created before the end-date, the dividend payment date was used instead of the ex date for calculating the nominal basis.\nThis was not correct as before it was disabled it was the ex date that was used for calculating the nominal basis.\n\nThe problem has been solved by using the ex date also when the functionality is disabled, but dividends are generated before the end-date.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94586","ChangeNote":"When importing the Risk and Performance Analytics Configuration from version 25.07 and earlier to a higher version, a crash occurs due to the new Axioma Stress Test tab. This issue has been fixed.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-95091","ChangeNote":"Support fixings cap/floor for FRNs with different coupon and compounding calendars","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-95026","ChangeNote":"List history: Improve system performance related to viewing list history when list has been through 4-eyes approval.","Products":["Business-Compliance","CsCode-Compliance"]},{"SimCorpReference":"D-95242","ChangeNote":"Remove Limit Configuration and Results: Change the way tables are emptied","Products":["Business-Limits"]},{"SimCorpReference":"D-95372","ChangeNote":"Flaky test ignored","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-94514","ChangeNote":"Target Name in DWH Load Monitor has index defined in Load Plan for jobs executed in parallel.","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-93398","ChangeNote":"Fixes various crashes on DWH Model import","Products":["Business-DEX","Business-DWH","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-94935","ChangeNote":"After this change the missing FX rates will be reported correctly.","Products":["Performance"]},{"SimCorpReference":"D-95162","ChangeNote":"When approving multiple alerts at the same time, threshold approval is not possible.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95188","ChangeNote":"Fixed failing unit tests in the SimCorp.IMS.AltInv.DocProcessing.IntegrationTest namespace.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-95222","ChangeNote":"Capture trade not working for classic orders. Fixed"},{"SimCorpReference":"D-91272","ChangeNote":"Pre-trade performance optimization: System performance problems in the order-result association logic has been optimized. The problem was especially noticeable in in result of relative rules with MANY positions (\u003E10.000) and MANY numerators (\u003E1.000).","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-95106","ChangeNote":"Enable the satellites for RTMAIN to detect contention situations by examining the lag in received ALIVE messages  and correct a flaw in the serialization logic of the RTRefinitiv price flushing flow which led to performance degradation.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-94914","ChangeNote":"Fixed an error related to client restriction rules in Compliance. This error can lead to a crash when the client restriction definition for a portfolio is empty.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-83243","ChangeNote":"Add missing fields to the Allocation message when initiating Amend allocation from the Quick Amend window"},{"SimCorpReference":"D-94612","ChangeNote":"Fixed the joins based 24.04 version and change source of fields ASSRESULT and CMPLRESULT","Products":["Business-Reporting"]},{"SimCorpReference":"D-94423","ChangeNote":"The \u0022Multi Manual Finance Transaction\u0022 form now has an extra validation preventing saving, when the decimals on the amounts does not correspond to the digits on the corresponding currency.","Products":["Business-Transactions"]},{"SimCorpReference":"D-94373","ChangeNote":"Removed outdated WinForms settings","Products":["Business-Transactions"]},{"SimCorpReference":"D-95249","ChangeNote":"Flaky test ignored","Products":["Business-DEX"]},{"SimCorpReference":"D-94880","ChangeNote":"Fixed scaling of MC shocks for RFs with absolute return for Random By Factor generator.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94674","ChangeNote":"The code that uploads data for MTM status codes for the Trade Manager should check whether the domain dGST is installed.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-94851","ChangeNote":"Save column width in pixels if set as a percentage by dx","Products":["Web-UC"]},{"SimCorpReference":"D-95154","ChangeNote":"Use custid instead of custname when check","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-94720","ChangeNote":"Risk factor Sensitivities with price method ‘Quoted price \u002B yield curve, str prod’  ignore OAS for Callable bonds.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-94464","ChangeNote":"Customer specific fix to reduce the size of compliance pre-trade results.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94368","ChangeNote":"Revert changes made for processing parentheses in the value property of \u003Csetvalue\u003E CDL statement","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-94831","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job produces fund decomposition data for the Investment Analytics Platform. The solution was flawed in the scenario where a component moves out of the fund, e.g. in case of a sell transaction. In this case, the market value SOD and cash flow SOD values that corresponds to the \u0022moves out\u0022 would appear on the residual instead of on the component itself.\n\nThe problem has been solved by enhancing the \u0027Generic Decomposition - Upload Results\u0027 batch job, so it produces a data record for the component on the day it moves out. The record has SOD and EOD weights equal to zero to dictate that the component moves out. With this additional data record, the market value SOD and cash flow SOD values appear on the component itself, thus resulting in a better decomposition.\n\nPlease note that existing data in the Investment Analytics Platform will not be impacted by this correction. A new \u0027Generic Decomposition - Upload Results\u0027 is needed for this correction to impact the results in the Investment Analytics Platform.","Products":["Performance"]},{"SimCorpReference":"D-94728","ChangeNote":"Fixed the crash on creating a LoadPlan for a DWH Model having semicolon-separated list of values for the ExpireDeletedRecords Configuration Parameter","Products":["Business-DWH"]},{"SimCorpReference":"D-94925","ChangeNote":"Added -autrole and -pmg to list of acceptable command line arguments"},{"SimCorpReference":"D-93456","ChangeNote":"Amounts for benchmark groups are calculated incorrectly. In case if a security is in several benchmarks and (accordingly) benchmark holding groups, it\u0027s total amount was populated to all the groups without distributing it in accordance with the actual amount weights. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-95003","ChangeNote":"Add more explicit searching transactions condition","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-94952","ChangeNote":"Flaky test ignored","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-95011","ChangeNote":"Add project version to npm audit report title","Products":["Web-UC"]},{"SimCorpReference":"D-94776","ChangeNote":"Extra validation added to series symbol and full symbol for future rolling. Now we also check the characters are uppercase and that the full symbol ends with a digit.","Products":["Instruments"]},{"SimCorpReference":"D-94472","ChangeNote":"MSCI, ExchTraded model: fetched Settlement price for the Bond/Euity Forward in case when it is a fund component. And replace pCLEAN with pCLEANUND","Products":["Business-Risk"]},{"SimCorpReference":"D-94681","ChangeNote":"The portfolio calculation did not include a bank account position having a zero balance on the first calculation date, but a non-zero balance on the last calculation date. The problem was that a cost/tax payment in the bank account had a cost payment date prior to its transaction agreement date; while the last portfolio calculation date was later than the cost payment date, but prior to the transaction agreement date. The zero-position check in the portfolio calculation did not find such payments. The error has been corrected for both bank accounts and cash buckets.","Products":["Framework-Common"]},{"SimCorpReference":"D-94886","ChangeNote":"Making Calculate average execution time event compatible with schedule.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-94974","ChangeNote":"Fix error message in \u0022Front office model - Execute\u0022 batch job","Products":["Business-Modelling"]},{"SimCorpReference":"D-95005","ChangeNote":"Disabled performance tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-94663","ChangeNote":"A program error occurred when loading a record using a deleted reference date. This has been corrected.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94745","ChangeNote":"DWH: Fixed database field overflow when serializing flow events","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-94933","ChangeNote":"A program error occurred when using  \u0027Start Batch Job Group\u0027 in the \u0027Batch Monitor\u0027. this has been corrected.","Products":["Framework-Batch"]},{"SimCorpReference":"D-94677","ChangeNote":"It is client specific code to introduce a check to ensure that when the MDV event is seen to be ready, it truly does not have any un-validated unfinished MDV events linked to the fund. When there are un-validated unfinished MDV events, then STP process allows rules that fail but have an error level of warning to skip the check and allow the validation to continue. An extra information is logged for further investigation.","Products":["Business-FundAccounting","CsCode-Framework"]},{"SimCorpReference":"D-94680","ChangeNote":"Flaky test ignored","CustomerApplyNote":"removed flaky tests","Products":["UP-KeyVault"]},{"SimCorpReference":"D-94837","ChangeNote":"Increase a regex timeout for analyzing complex rules and fragments while validation","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94984","ChangeNote":"Authentication credentials replaced to ensure ASB test is correctly executed.","Products":["CsCode-Connectivity"]},{"SimCorpReference":"D-94777","ChangeNote":"Performance optimization when handling many aux jobs.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-94734","ChangeNote":"Add additional condition for finding linked parcels - if system found the original parcel - finish the search and move to other parcel","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-94732","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-94047","ChangeNote":"Added optional  floatOffset tag to the GenericBondModel, overnightIndexedCoupons section","Products":["Business-Risk"]},{"SimCorpReference":"S-221991","ChangeNote":"Xpress instruments dimensions for Swaptions and Infl. Swaps in 25.10"},{"SimCorpReference":"D-94516","ChangeNote":"The log message “Saving information about Execution into RDATAPOOLEXECS.” was incorrectly flagged as an error when saving a Reporting Pool. This issue was fixed in D-90424 (version 26.01). To meet client requirements, the fix will be backported to 25.10, ensuring the message remains informational with no functional impact.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-93568","ChangeNote":"Collateral Manager: Accrued interest on Collateral/Market/Available positions is calculated based on the calculation date plus the allocation days.","Products":["Business-Collateral"]},{"SimCorpReference":"D-86678","ChangeNote":"Removed arbitrary limit of at most showing 10000 rows in all Trade Manager search applets.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92275","ChangeNote":"Fix a bug with Data Warehouse Web API Data Source Editor where compilation was not possible on some environments","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-94328","ChangeNote":"Made \u0022Side\u0022 values consistent in responses between data retrieval Pretrade API v3 endpoints","Products":["CsCode-FrontOffice","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-94485","ChangeNote":"A program error occurred when executing the Validate Market Data. This defect has now been fixed. Moreover the functionality is now compatible using Workflow schedules.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-94638","ChangeNote":"An error could occur in the \u0027Portfolio Calculation\u0027 in case \u0027Adjustment frequency\u0027 was not set to \u0027\u0027No adj.\u0027 and in case at least one \u0027Hedge\u0027 position with Hedge adjustment\u0027 \u0027Freeze\u0027 and \u0027Hedge risk free price adjustment method\u0027 \u0027Dollar offset - Retrospective (constant spread and curve)\u0027 was supposed to be calculated. This has been fixed.","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-94302","ChangeNote":"Fixed redemption payment date for callable bonds if call/put option is applied and option date falls on a holiday.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-94470","ChangeNote":"Structured ABSs incorrectly used future Pool Factors in valuation. \n\nAnd in general bond options did not take effects analysis date into account for the underlying bond.","Products":["Valuation"]},{"SimCorpReference":"D-94709","ChangeNote":"An error could occur when one GCA framework was installed in the SCD installation and all GCA values were 0 on the transaction. This has bene fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-94660","ChangeNote":"If OM client application cannot connect to Workflow service because of e.g. firewall rules, alert will be displayed."},{"SimCorpReference":"D-92211","ChangeNote":"The database load generated by the message queue service when looking for messages to process has been reduced.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-93560","ChangeNote":"Removed vulnerable packages from apigw"},{"SimCorpReference":"D-94596","ChangeNote":"The query used to find cash bucket positions/movements when using Period Closure has been optimized.\nTechnical: \n- An existing index on table TRANSSUBLRPDATES has been changed (extra column added). \nUpdating this index during upgrade may take some time.\n- Hint has been added to force Oracle to use the correct index on table TRANSSUBLEDGER","Products":["Business-GeneralLedger","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-94268","ChangeNote":"Add a delay when between attempts to reconnect to the Message Broker"},{"SimCorpReference":"D-94653","ChangeNote":"As part of \u0022handling holdings, etc.\u0022 in the calculations we need to \u0022decompose\u0022 the securities into underlying securities. There were some system performance problems in that, that cause d long startup times for compliance services at some customers.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94599","ChangeNote":"Reduce the database load (table SECBUSCLASSTS) when loading Parties.","Products":["Business-ReferenceDataTransactions"]},{"SimCorpReference":"D-94591","ChangeNote":"Reduce the database load generated by the Collateral dashboard service by optimizing SQL statements.","Products":["Business-Collateral"]},{"SimCorpReference":"D-94594","ChangeNote":"Reduce the database resources used when saving Data Warehouse information during the save of Performance Reports results (Oracle table PERFREPDELNODEINFO). The change will only affect customers having Data Warehouse installed.","Products":["Performance"]},{"SimCorpReference":"D-94683","ChangeNote":"Optimize code finding client benchmark from model portfolio.","Products":["Performance"]},{"SimCorpReference":"D-94682","ChangeNote":"To improve the performance of the validation when saving US pool static data, a new index has been created on IBI.POOLNO.","Products":["StaticData"]},{"SimCorpReference":"D-94727","ChangeNote":"When saving fund figures Oracle could in some cases chose a nonoptimal execution, leading to bad performance. A database hint has been added to ensure Oracle uses the relevant index.","Products":["Framework-Database"]},{"SimCorpReference":"D-94089","ChangeNote":"fix error in attributes configuration","Products":["Business-Risk"]},{"SimCorpReference":"D-89240","ChangeNote":"When technical transactions are generated for cash bucket and bank accounts on nominal framework, the subsequent P/L framework is impacted and generating technical transaction on the same day for  P/L framework gets incorrect figures for balance fields (QC/PC). This change fixes this issue.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-94592","ChangeNote":"During calculation Front Office Data for Nominal Agreement Framework, we did not check that Nominal number blocked for Buy and Sell complies DB constraints. As a result, in very rare cases it caused crash on FOD services. Fixed.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-94396","ChangeNote":"The composition of the inflation curve when \u0022Include CPI values\u0022 = true has been corrected such that the lag defined on the RPI on the contract is correctly taken into account.","Products":["XpressInstruments"]},{"SimCorpReference":"D-94509","ChangeNote":"This is an internal SimCorp change. No customers are affected","Products":["CsCode-Framework","UP-KeyVault"]},{"SimCorpReference":"D-92586","ChangeNote":"Update Route for single place form to allow placing SPOs to Single brokers"},{"SimCorpReference":"D-94515","ChangeNote":"Session might crash with due to WS FULL by getting initial conditions to calculate issue yield time series","Products":["Valuation"]},{"SimCorpReference":"D-94438","ChangeNote":"In some situations, Oracle chose a wrong execution plan leading to a very bad performance for the ‘Initialising – Building keys...’ step. This has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-93169","ChangeNote":"Do not recalculate FRA/IRF price if it is given as input.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-93964","ChangeNote":"Fix to handle issue in Broker restriction service where it took a long time to validate broker restrictions for a released order when list update import job was running.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-94394","ChangeNote":"A workspace full could occur when loading data. This has been corrected. Now the system will load the first x records, and warn more is present.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-94445","ChangeNote":"Elementary transaction components with message status ‘Rescheduled’ or ‘Error’ can safely be set \u0027On Hold\u0027 and should not be categorized as invalid.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-93073","ChangeNote":"When executing Data Warehouse Load Plans containing Star Marts, with the classic version of Qlik Sense configured: a Connection to Qlik Sense is now reused across Load Plan Executions. This is because Qlik Sense cannot close the connections promptly on the server after they are closed from the client. So this change is needed to avoid running out of available sessions, in case many Load Plans with Star Marts are executed back to back.","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-94432","ChangeNote":"In form Custodies Access code field was hidden after sunsetting the Oasys and removing its commands from the INS files. Since the field needed for CTM it was decided to change condition for displaying it in case CTM is installed. Also, caption of the field was changed from \u0022Access code (Oasys)\u0022 to \u0022Access code\u0022.","Products":["Business-ReferenceDataTransactions"]},{"SimCorpReference":"D-94362","ChangeNote":"We have added a fix using hpaAdd when adding residuals in creation of synthetic payments. This ensures higher precision and removes floating point issue","Products":["Performance"]},{"SimCorpReference":"D-94403","ChangeNote":"Fixed issue with pricing of CTD futures with underlying bonds by reverting some faulty changes.","Products":["MarketData","Business-PortfolioCalculation","PositionBasedCalculation","Valuation"]},{"SimCorpReference":"D-94357","ChangeNote":"Remove customer specific filling \u0022Portfolio Name\u0022 towards Order Manager","Products":["Business-PortfolioManagement","Framework-InternalCoreFramework"]},{"SimCorpReference":"D-90792","ChangeNote":"Improve query execution time","Products":["CsCode-ApiFramework"]},{"SimCorpReference":"D-94401","ChangeNote":"This is an improvement to internal multi process utility with no impact on business functionality.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-94378","ChangeNote":"Proper handling of updating transactions without modification.","Products":["CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-93922","ChangeNote":"The customer GAMH is having a number of positions where there are some PCL check inconsistencies although all the transactions have been raised by the server to Settle GL!","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-93800","ChangeNote":"Duplication of forecasted transactions could happen in ‘View Transactions’ in ‘Cash Management’ if the setting ‘Autocalc’ was checked and Cash Management was open when a transaction was modified – this has been corrected.","Products":["Business-CashManagement"]},{"SimCorpReference":"D-94377","ChangeNote":"The Corporate action specific Open and Close transaction types were disabled in the Trade Manager.","Products":["TradeManager"]},{"SimCorpReference":"D-93786","ChangeNote":"Fix release order to STP queue when Order Options \u0022Release order on save\u0022 is Yes and order is auto-released after pre trade validation override","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"S-218801","ChangeNote":"SWIFT Release 2025. Add Instruction Processing Statuses FRWD, RCIS and RETR for MT567","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-94261","ChangeNote":"It wasn\u0027t possible to import SWIFT data for PARTNERS, if the installation was configured to only use one Portfolio Master, and at the same time the \u0027Allow SWIFT addresses to depend on portfolios\u0027 (Show Installation Parameters) was enabled. This has been corrected.","Products":["Business-ReferenceDataTransactions"]},{"SimCorpReference":"D-94273","ChangeNote":"Fix for incorrect handling of .Net formula errors in compliance calculations.  It is valid for .Net client formulas to return null as a result. These errors would show up as purple dot system exceptions . Now they show up as blue dot data exceptions.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-93910","ChangeNote":"Collateral Interest Statements: Resolve Accrued Interest discrepancies in Margin Manager vs Create Interest Transactions screens.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-94201","ChangeNote":"An error could appear in the \u0027Rights Split\u0027 window when switching to a \u0027Framework\u0027 different then \u0027Main\u0027 via using \u0027Select Framework\u0027 and afterwards e.g. trying to change the \u0027Book Value PC\u0027. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-94164","ChangeNote":"Align format of import precheck errors","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-94113","ChangeNote":"It wasn\u0027t possible to update Trade Manager Items and Fields (AUTTRADEMGRITEMS) setups. This has been corrected.","Products":["Framework-Authorisation","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-93890","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job could fail with an error if a component in a decomposition has a SOD or EOD weight close to zero (smaller than 1E-7). Such an error would stop the batch job and prevent the files from being written. There are, however, valid situations where a component can have a weight close to zero or even exactly zero. E.g. if a fund has a large total value and a small component value that result in a weight smaller than 1E-7. This could happen with a total fund value of 10.000.001 and a component value of 1. Another example is an internal fund that invests in a future and create daily variation margin payments on the future. The error message is therefore misplaced and it has been removed.","Products":["Performance"]},{"SimCorpReference":"D-93986","ChangeNote":"When positions are in different currencies - aggregation level is now calculated for field Yield for Math.Adj Sold","Products":["Instruments"]},{"SimCorpReference":"D-94160","ChangeNote":"Crash can happen during upgrade if authorisation profile of type ALL has access to any of tasks and commands  windows","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-93683","ChangeNote":"Webrequestcustom CDL function: Issue with \u0022multipart/form-data\u0022 content type in webrequestcustom CDL command fixed.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-93558","ChangeNote":"fixed findings in apigw and ims","Products":["UP-KeyVault"]},{"SimCorpReference":"D-94231","ChangeNote":"Fixed typo in the instrument name. Now endpoint for EquityIndexOption/NovationStepOut is present in OTC Web Api","Products":["CsCode-Trading"]},{"SimCorpReference":"D-93603","ChangeNote":"Fix crash in Performance calculation with NAV Performance, PCL framework and no dividends matching dates condition.","Products":["Performance"]},{"SimCorpReference":"D-94099","ChangeNote":"Compliance Alert Results fixed to correctly present comments"},{"SimCorpReference":"D-94040","ChangeNote":"General reconciliation could crash when tracking previous breaks is checked in the setting, and there is a one-side match in the reconciliation. This was fixed","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-94110","ChangeNote":"Fix for a performance decline in compliance calculations which was introduced on a previous fix","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-93894","ChangeNote":"Fix of a system crash when trying to open \u0027Input Field Definition\u0027 window","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-93862","ChangeNote":"Opening the history of compliance lists could take very long time. This has been optimized.","Products":["Business-Compliance"]},{"SimCorpReference":"D-93835","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job saves a daily RETURN_RC file that contains the RC return of the decomposed constituents. The RC return incorporates the price return in quotation currency and the currency return from the QC/RC FX rate. The currency return was calculated as FX_QCRC(t) * FX_RCQC(t-1). This is OK if the QC/RC and RC/QC rates are consistent, which they will be if they only save rates on one of the crosses. But if they both save their own rates, it is very likely that they are not consistent and then this way of calculating the currency return will result in a wrong value, since the return of the QC/RC rate should only involve QC/RC rates. The principle has been changed so the currency return is calculated as FX_QCRC(t) / FX_QCRC(t-1).","Products":["Performance"]},{"SimCorpReference":"D-93403","ChangeNote":"The sign is reversed of the open payables and receivables fields categorized according to transaction types in the portfolio calculation. Hence, now receivables or cash-in will be positive amounts, while payables or cash-out will be negative amounts. \nThe fields are calculated when  \u0022Open payments\u0022 and \u0022Open and made payment reconciliation\u0022 check marks are enabled in the portfolio calculation.\nThe change only concerns the following complete list of fields: \u0022Open Payables Transactions QC\u0022, \u0022Open Payables Transactions PC\u0022, \u0022Open Payables Transactions FX P/L PC\u0022, \u0022Open Payables Dividends QC\u0022, \u0022Open Payables Dividends PC\u0022, \u0022Open Payables Dividends FX P/L PC\u0022, \u0022Open Payables Interest QC\u0022, \u0022Open Payables Interest PC\u0022, \u0022Open Payables Interest FX P/L PC\u0022, \u0022Open Payables Total QC\u0022, \u0022Open Payables Total PC\u0022, \u0022Open Payables Total FX P/L PC\u0022, \u0022Open Receivables Transactions QC\u0022, \u0022Open Receivables Transactions PC\u0022, \u0022Open Receivables Transactions FX P/L PC\u0022, \u0022Open Receivables Dividends QC\u0022, \u0022Open Receivables Dividends PC\u0022, \u0022Open Receivables Dividends FX P/L PC\u0022, \u0022Open Receivables Interest QC\u0022, \u0022Open Receivables Interest PC\u0022, \u0022Open Receivables Interest FX P/L PC\u0022, \u0022Open Receivables Total QC\u0022, \u0022Open Receivables Total PC\u0022 and \u0022Open Receivables Total FX P/L PC\u0022 available the List Calculation window of the portfolio calculation.","Products":["Business-Cash","Business-FundAccounting","Business-PortfolioCalculation"]},{"SimCorpReference":"D-94060","ChangeNote":"Rotated credentials for API IntegrationTests in the alternatives pipeline."},{"SimCorpReference":"D-94031","ChangeNote":"Disable CA - Import for Derivatives for the Single name TRS for non-internal installations","Products":["Framework-Batch"]},{"SimCorpReference":"D-93214","ChangeNote":"Fix crash in MO Pos calc by covering case when pricing doesnt return price for Decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-93693","ChangeNote":"Fix crash in DWH configuration transport if model uses formulas","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-87899","ChangeNote":"When an AM cache historical job is created and processed, in a portfolio master enforced environment, no data is saved for the job due to authorizations. The authorization should be skipped for AM cache jobs in this case and the authorization will be applied when user gets data for that historical job.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-94018","ChangeNote":"Added PmPlacementBrokerAlias to the DSL to be available via overrides."},{"SimCorpReference":"D-93998","ChangeNote":"Fix a crash in General reconciliation code that could occur when no results were imported and \u0027Track previous breaks\u0027 is checked","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-93711","ChangeNote":"Flaky test ignored","Products":["Web-UC"]},{"SimCorpReference":"S-218798","ChangeNote":"Add - Reclassification corporate action event type in CAM","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-93661","ChangeNote":"Support Data Warehouse Schema Connections with Managed Identity Storage Authentication when the Schema Connection is stored in a Key Vault","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-93675","ChangeNote":"In the Application service the code concerning the file repository  has become more robust so that the server do not crash if the account running the service is unable to access or modify the accessibility of the relevant folders. If the service are unable to access or modify the accessibility the functionality regarding upload and download from the service becomes disabled","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-93753","ChangeNote":"Modifications and minor enhancement to provide better reports on certain exceptions in the post-processing and linking of identified internal TAPI SingleRowData and external transactions in the connectivity layer for the external request for update of settlement data via the Communication server.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-93700","ChangeNote":"Internal change: clients should not be affected.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-93755","ChangeNote":"Implied spread was incorrectly added to yield curve for market data scenarios with no shock to the discounting curve","Products":["MarketData"]},{"SimCorpReference":"D-93792","ChangeNote":"The \u0027Generic Decomposition - Upload Results\u0027 batch job creates a file with SOD and EOD weights for the decomposed constituents. The weights are based on dirty value of the constituents. By error the SOD weight on day t was based on dirty value from day t, where it should have been based on dirty value from day t-1.","Products":["Performance"]},{"SimCorpReference":"D-93602","ChangeNote":"No functional change - add logging to hedge ratio calculation in Asset Manager","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92655","ChangeNote":"Customer specific change for a customer specific issue.","Products":["Business-AdministrativeOTCTransactions","Business-ToolsTransactions"]},{"SimCorpReference":"S-214356","ChangeNote":"Migrate SQL Server to the new landing zone."},{"SimCorpReference":"D-93372","ChangeNote":"Orders auto-allocated outside of schedule when automation service is running for multiple days. fixed"},{"SimCorpReference":"S-218652","ChangeNote":"Remove quote factor from the cash flow amount calculation for swap like instruments in the Trade Manager.\n\nCDS single name: do not validate termination date against tenor when reusing Security ID","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-93939","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-93074","ChangeNote":"Use the same rounding rule for the Price field in the Amend Allocation form as in Allocation."},{"SimCorpReference":"D-92735","ChangeNote":"Race condition causes aggregated order to re-appear in the Order Manager client. This is fixed now"},{"SimCorpReference":"D-93232","ChangeNote":"When \u0022Auto-release order after pre trade validation override\u0022 option is enabled, approval orders will be auto-released (sent for approval) after override action only if it was performed by order Originator.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-93057","ChangeNote":"\u0022Adjustments default date\u0022 and \u0022Payment default date\u0022 are set when transaction code is not taxable corporate action.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-92704","ChangeNote":"Decrease memory consumption in MO Aggregation Calculation for case of total aggregations and non relative analytics","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-92539","ChangeNote":"An error could occur when trying to save transaction in the \u0027Create Corporate Action Transactions\u0027 window that were created with the \u0027Position adjustment (Derivatives)\u0027 check box being set. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions","Business-CorporateActions"]},{"SimCorpReference":"D-92385","ChangeNote":"Deleting an alert for a specific criteria, for example Flow Step or Communication Parameter Set , only the details are deleted but rows with administrative information like \u0027assigned to\u0027 remained in the group. \nThis has been changed. If only administrative rows been left in the Alert the entire Alert is deleted.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-93429","ChangeNote":"The market value and cash flow fields became wrong when both \u0022Exclude fee segment\u0022 and \u0022Use portfolio specific security codes\u0022 were checked in Performance Measurement and when at least one condition in the Fee Segment used a field which can be configured in \u0022Portfolio Specific Security Properties\u0022\n\nThe error has been corrected.\n\nAffected Performance Measurements and Performance Reports must be recalculated.","Products":["Performance"]},{"SimCorpReference":"D-93769","ChangeNote":"Limit icons functionality to only users that have access to Mass Update screen","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-92155","ChangeNote":"Collateral Rules: for liability usage add market position security/underlying of market position security to the search condition for valid securities.","Products":["Business-Collateral","CsCode-Framework","Business-SettlementCostDefault","Business-Transactions","Framework-CoreFramework"]},{"SimCorpReference":"D-93805","ChangeNote":"This is a customer specific change which will not affect other customers.","Products":["Framework-Authorisation"]},{"SimCorpReference":"D-92909","ChangeNote":"Changing the STP status only when modification is expected","Products":["CsCode-Trading"]},{"SimCorpReference":"D-93543","ChangeNote":"When working with Multiple payment screen the settlement defaults with other bank accounts are shown. Has been fixed.\n\nThis was earlier working for other screens where bank account is an instrument, but not for Multiple payments.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"D-92643","ChangeNote":"Add tags 9610. 9611, 9612 and 9613 to the Quickfix dictionary used in NOMA."},{"SimCorpReference":"D-93315","ChangeNote":"Ensure tables referencing tBUSCTR is not missing  index used be referential constraint.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-93458","ChangeNote":"UDKR contributions/distributions could be calculated incorrectly in the AM Cache if the setup specified that weights should be calculated per mandate/portfolio and the set of requested fields did not contain any regular contribution and distribution fields.  Only an issue if the none of the rows in the data selection has \u0027Treat as one mandate\u0022 checked","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92831","ChangeNote":"Corrected issue where put/call dates used for key ratio calculations were not generated properly","Products":["Valuation"]},{"SimCorpReference":"D-93254","ChangeNote":"Compliance warning alerts is now also resolved  if the alert changes to a breach","Products":["CsCode-Compliance","Web-UC"]},{"SimCorpReference":"S-214682","ChangeNote":"Added a CBU program, to ensure that portfolio life-cycle dates obey the validation restrictions in the Business Entities screen.\n\nThis is relevant due to a conversion program included in the upgrade to versions 26.01 and later, which creates new business entities based on the portfolios.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-92025","ChangeNote":"Fixing historical VaR aggregating issue.","Products":["Business-Risk"]},{"SimCorpReference":"D-93161","ChangeNote":"Fixes a potential crash that could happen in the Calculation service when called through the STP service.","Products":["Business-Transactions"]},{"SimCorpReference":"D-93411","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-93066","ChangeNote":"Guard fetching data and add trace statement if exception happens for DeltaVectors","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92213","ChangeNote":"gMSA account used to start service agents, and thereby starting services, must have a UPN assigned. This UPN will be used as the identity for the endpoints of the service. The endpoints will use FQDN instead of IP address. These changes will enable use of Kerberos for client and service authentication.","Products":["CsCode-Framework","CsCode-NetCoreServices","CsCode-SystemOperation","Framework-CoreFramework"]},{"SimCorpReference":"D-93564","ChangeNote":"Parametric VaR was not calculated due to not existing setting \u0022Disable FX Option adjustments\u0022 in Asset  Manager and Compliance Manager. Crash has been fixed, and now Parametric VaR is calculated","Products":["Business-Risk"]},{"SimCorpReference":"D-86254","ChangeNote":"Search for Apl core during DEX in BPAAS infrastructure.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-92799","ChangeNote":"To fix an error with incorrect General Approval status in CAM when there is one of the holdings with blocking. Relevant for UBS only","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-93340","ChangeNote":"In case of reversals Reconciliation result is updated with new payment reference. Now a reference to active transaction is updated as well.","Products":["Business-Cash","Business-Reconciliation"]},{"SimCorpReference":"D-92906","ChangeNote":"Fixing problem with CustomAttributes Values for PortfolioGroup were not populated when there is no initial balance in the CashViewer Applet.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-93770","ChangeNote":"Compliance pre-trade validation returns many system exceptions (with message \u0022Index was outside the bounds of the array\u0022) that caused by the errors in the compliance pre-trade service log","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-93623","ChangeNote":"portalIdAvailable did not return the right results","Products":["Framework-Authorisation"]},{"SimCorpReference":"D-93468","ChangeNote":"Only relevant STP service configurations are displayed when \u0027Explain Unmatched\u0027 button is clicked in \u0027Match\u0027 window; specific service instances won\u0027t be present in the list.","Products":["Business-Swift"]},{"SimCorpReference":"D-93546","ChangeNote":"CDS Security IMW Dimension - condition for CDS moved to extra tab in DEX"},{"SimCorpReference":"D-92678","ChangeNote":"Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation could use old Model Portfolio Components after they were released from Asset Manager and MPC comments are used. Latest components are always used after this change. Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation is performed after MPC comments are saved.","Products":["Business-Modelling","Business-PortfolioManagement","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-91993","ChangeNote":"Only active messages that take into account  the \u0027Official CA Event Reference\u0027, are considered as the basis for MT565 creation","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-93495","ChangeNote":"After doing \u0027Truncate business data\u0027 some database constraints could be missing (disabled). This has been corrected.","Products":["Business-TruncateBusinessData","Framework-Database"]},{"SimCorpReference":"D-92403","ChangeNote":"It has been corrected to not crash on zero or close to zero discount factors.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-93447","ChangeNote":"The performance when calculating \u0027Key Ratio mapping Formulas\u0027 was very slow. This has been fixed.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-92402","ChangeNote":"Fixed pricing of swaps with payment lag in yield curve estimation using  Bootstrap method.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-92664","ChangeNote":"Assign \u0027Undefined\u0027 value in case when Group code value is empty","Products":["Business-Risk"]},{"SimCorpReference":"D-93348","ChangeNote":"Bring back application of SSI during Recalculating Closing Transactions job","Products":["Business-AdministrativeSecurityTransactions","Business-DealerOTCTransactions","Business-Transactions","Framework-CoreFramework"]},{"SimCorpReference":"D-93044","ChangeNote":"The system performance in the Compliance Manager was improved by avoiding unnecessary database queries in the Rule Entry and Lists window. Opening rules with lists should now be faster.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92949","ChangeNote":"Reduced number of calls to DB","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-93410","ChangeNote":"There was a performance issue with business classes loading in Asset Manager. This has been fixed now.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92595","ChangeNote":"improve performance of webclient using cache of icons","Products":["Web-UC"]},{"SimCorpReference":"D-93451","ChangeNote":"The batch job \u0022OTC Instruments - Validate All\u0022 will process transactions, which have some data in at least 1 of 5 grids: Payment Business Centre, Valuation Business Centre, Fixing Business Centre, FX fixing Business Centre, FX Convention Fixing Business Centre","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92670","ChangeNote":"Summation of weight fields were not calculated when doing subtotals via the Asset Manager Cache Api when the setting \u0022Distribution figures per portfolio/mandate\u0022 were on and the group contained multiple portfolios.  Weight fields are fields like distribution- and contributionfields (including the UDKR-variants). The calculation has now been aligned to use the same simpler principle across the Asset Manager and its API\u0027s","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92673","ChangeNote":"The queries used to load decomposition data have been optimized.","Products":["Decomposition"]},{"SimCorpReference":"D-93270","ChangeNote":"Update of autotest. This will not affect any customers.","Products":["Framework-Services"]},{"SimCorpReference":"D-92647","ChangeNote":"Show execution Plan was not working in some cases when using an OAuth schema","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-91348","ChangeNote":"The value in the Date column of the Fixings sub-screen would not always be updated correctly when making changes to the Holiday calendar used.","Products":["StaticData"]},{"SimCorpReference":"S-187178","ChangeNote":"A new batch task named \u0027Generic Decomposition - Upload Results\u0027 is now available in the Batch Job window. The new batch task prepares data files with decomposition data that enables decomposition of funds in the Investment Analytics Platform. The data is based on the \u0027Generic Decomposition - Calculate\u0027 batch job.","Products":["Framework-Batch"]},{"SimCorpReference":"D-92625","ChangeNote":"Correct the issue with erroneous error message in RAM when the Stress test scenarios has been changed (for example, added new one) and recalculated at RF Scenarios and Risk Measurement","Products":["Business-Risk"]},{"SimCorpReference":"D-93188","ChangeNote":"Fixed an error regarding the rule export functionality in the Compliance Manager. The accounting view was not included in the export if it was based on a payment accounting framework.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92069","ChangeNote":"Adding MDST calculation data for Market Data Stress Test Import Configuration","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-93329","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-93180","ChangeNote":"Compliance Post-trade calculation: \u0027Nothing to check\u0027 results falsely returned when validating rules with Year-to-Data P/L cost attribute together with other rules, without this property - or when validating transaction rules with a different accounting framework defined than the \u0022default\u0022 framework. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-93256","ChangeNote":"fix npm audit","Products":["Web-UC"]},{"SimCorpReference":"D-93301","ChangeNote":"A crash happened when saving the order after selecting a predefined comment via F4 in the \u0027Multiple Portfolio Orders\u0027 window. This has now been corrected.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"S-217356","ChangeNote":"There was an error in the calculation  of the clean price from dirty price used in the calculation of YTM key ratios on the main contract for inflation swaps. This was corrected.\n\nTrade Manager: Swaptions could get redundant validation error on save:  \u0022Direction is a mandatory field and must be specified\u0022. It was fixed.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-88777","ChangeNote":"Fix deadlock during multiple block trade allocations coming.","Products":["Business-PortfolioManagement","TradeManager","Framework-MessageQueue"]},{"SimCorpReference":"D-91690","ChangeNote":"Additional validation for Data Extraction Definition Formulas has been added","Products":["Business-DEX"]},{"SimCorpReference":"D-93080","ChangeNote":"API Gateway\u0027s embedded .net runtime was upgraded to version 8.0.21"},{"SimCorpReference":"D-93103","ChangeNote":"After appearance of new CDS orders in AM all applets refresh custom fields information except Cash Viewer applet.\nAs a result, custom fields in cash viewer might be empty in some specific cases. Fixed. Now we refresh custom fields in Cash Viewer applet after new CDS orders event.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91721","ChangeNote":"Technical 3T","Products":["CsCode-Accounting","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-92415","ChangeNote":"Alternative investment asset fields relating to currently disabled functionality could be mapped for import in the \u0027Data import rules\u0027 window. The fields are now hidden.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-92515","ChangeNote":"Risk for yield curve was not correctly  calculated for XpressInstruments using OneLib pricing.","Products":["MarketData"]},{"SimCorpReference":"D-92923","ChangeNote":"Flaky test ignored","Products":["Web-UC"]},{"SimCorpReference":"D-92545","ChangeNote":"Batch task = Performance Calculation - Upload Results: Improved system performance during initialization phase.","Products":["Performance"]},{"SimCorpReference":"D-92913","ChangeNote":"Deleted ignore attribute","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-92619","ChangeNote":"Handling Lock not obtained db error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-93082","ChangeNote":"Om FIX Router and FIX Api services should be updated to use 8.0.21 runtime that contains security patch from Microsoft"},{"SimCorpReference":"S-213565","ChangeNote":"New fact Aggr Calculation Constituents added to IMW","Products":["Business-Reporting"]},{"SimCorpReference":"D-92404","ChangeNote":"Correction to the definition of interest periods for straight repos having a repo interest type ‘Variable’ in certain scenarios.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-91934","ChangeNote":"When reconciliation copies break ids from previous execution it uses several lines in case of funnel instead of using just one line id.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-93060","ChangeNote":"Solve crash by starting SCD in programmers mode","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-92716","ChangeNote":"The log warning issued by the Business rules alert service when more than 10,000 open alerts exists across all domains has been ensured","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-92995","ChangeNote":"Internal codebase refactoring. Fixed the code to improve when we include stack traces in error messages. Changes made to the code do not affect system behaviour.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-93113","ChangeNote":"N/A","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-92680","ChangeNote":"Classic FX Forward should not show FixingDate value instead of ValueDate"},{"SimCorpReference":"D-92864","ChangeNote":"It was not possible to auto-allocate options with default counterparty. This is fixed now."},{"SimCorpReference":"D-91867","ChangeNote":"Hide Fixing date for non deliverable FX Allocate"},{"SimCorpReference":"D-92729","ChangeNote":"Added protection against WebApplication.CreateBuilder() vulnerability when using non-standard command line arguments"},{"SimCorpReference":"D-91932","ChangeNote":"Corrected a UI issue with brokers icons in the Broker selection combo box in the Quick Place window."},{"SimCorpReference":"D-91709","ChangeNote":"Implement the request from OTC API in a separate thread with retries"},{"SimCorpReference":"D-92179","ChangeNote":"Corrected FIX tag 57 for classic single program orders","CustomerApplyNote":"Fix the value sent in tag 57 for Classic Program Single Orders"},{"SimCorpReference":"D-90845","ChangeNote":"New random method - random by risk factor for MC generation option were added. This new method is considered to be applied for scenarios where the MC scenarios have to be preserved for the same risk factor IKs with the same seed value and the same risk factor selection ID.","Products":["Business-Risk","Valuation","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-92095","ChangeNote":"Corporate action dashboard service: add logging in case of retries due to deadlock","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-92751","ChangeNote":"Fixed problem with missing benchmark data for rules assigned to model portfolio node s beneath funds","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92827","ChangeNote":"Fix for a compliance-related error regarding missing external values in rules assigned to model portfolios.\nExternal value definitions with \u0022Scope = Model Portfolio\u0022 were not included in compliance validations when the rule was assigned to a model portfolio.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92758","ChangeNote":"Make database selects in Aggregation calculation Init phase faster.","Products":["Business-Risk"]},{"SimCorpReference":"D-92817","ChangeNote":"Update dya_config to honor change on System.Security.Cryptoaphy.Pkcs to have correct reference."},{"SimCorpReference":"D-92560","ChangeNote":"A fix for the Create Future Transactions window so that special close out transactions use the number of fixing days from static data as the number of settlement days for the transaction","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-91918","ChangeNote":"DWH: Optimize DML statements used for loading versioned tables in Snowflake","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-92700","ChangeNote":"Position Calculation: Make WS requirements lower in residual loop","Products":["Business-Risk"]},{"SimCorpReference":"D-92474","ChangeNote":"Om should ignore bids received for ETF from TS"},{"SimCorpReference":"D-92956","ChangeNote":"The Business rules alert service now updates the timestamp for last processing time more frequently to avoid the Business rules alert service wrongly being shutdown by the Service Platform","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-92951","ChangeNote":"After removing the configuration parameter \u0027Nominal framework methods enabled\u0027 in \u0027Show Installation Parameters\u0027 =\u003E \u0027\u0027Transactions\u0027 in 26.01, the CBU error was revealed when testing an upgrade to 26.01 as a preview drop. To avoid it, the usage of the configuration parameter is now disregarded in the lower versions. This will not affect the customers installation, since the functionality has been already enabled by default earlier.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-92744","ChangeNote":"Extend the scope of custids","CustomerApplyNote":"Extend the scope of custids","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-92736","ChangeNote":"The testOtcTMControllerFntAllocMsgBlock APL unit test relies on non-real securities. The identification of these securities has been changed.","Products":["TradeManager"]},{"SimCorpReference":"D-92329","ChangeNote":"Validation should be removed for allocate command."},{"SimCorpReference":"D-92303","ChangeNote":"Default payment transaction does not have impact on  franking credit  fields","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-212403","ChangeNote":"Added Managed Identity connection type for AM cache services","Products":["CsCode-FrontOfficeData","Business-FrontOfficeData"]},{"SimCorpReference":"D-92489","ChangeNote":"Extend Override ID field length in Instrument exception settings from 20 characters to 100 characters","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-90519","ChangeNote":"When saving either \u0027Data Format Setup\u0027 or \u0027Direct Filter/Data Format Setup Integration\u0027 with the \u0027Publish DFS as API\u0027 option selected on the \u0027Data Format Setup\u0027, the system will validate the ID to prevent duplicate API endpoints.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-92116","ChangeNote":"In rare cases it could happen that when distributing ccy adjustments to multiple payments, large values would appear in the \u0022Ccy adjustment PC\u0022 column of the \u0022Payment reconciliation\u0022 form. This was due to wrong rounding logic and has been resolved.","Products":["Business-Cash","Framework-CoreFramework"]},{"SimCorpReference":"D-92731","ChangeNote":"Internal codebase refactoring. Fixed the code to improve when we include stack traces in error messages. Changes made to the code do not affect system behaviour.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92674","ChangeNote":"Do not create extraction definitions for standard base marts if subject areas of those are not installed.","Products":["Business-DWH"]},{"SimCorpReference":"D-92630","ChangeNote":"Enhance error message about problem with reading file with error returned by operating system","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-92633","ChangeNote":"Fixed an issue in handling of group code changes that could cause a freeze of the Asset Manager or Asset Manager Cache","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92771","ChangeNote":"change source for EFFECTIVE_DATE in BF_TRANSACTION to indicate TRANSMAIN.INTBEGDATE","Products":["Business-Reporting"]},{"SimCorpReference":"D-92644","ChangeNote":"Added a hint to the main query used by the Asset Manager Calculation service to read holding data.  In some situation it did not pick the correct execution plan which could lead to slow database queries","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92749","ChangeNote":"Adjustment of cmd parameter for net 8 services","Products":["CsCode-Framework"]},{"SimCorpReference":"D-92525","ChangeNote":"Client specific change which prevents the STP flow to be interrupted by errors that client wants to ignore, when using Calculation Services.","Products":["Business-ToolsTransactions","Business-Transactions"]},{"SimCorpReference":"D-91441","ChangeNote":"fix flaky test","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-90232","ChangeNote":"Suggested allocation date check was added in Allocation handler.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-92363","ChangeNote":"No functional changes. fixing tests"},{"SimCorpReference":"D-92754","ChangeNote":"Aligned nr of arguments with DoJobExecute to fix length error","Products":["Performance"]},{"SimCorpReference":"D-92392","ChangeNote":"Stock loan fee transactions for CFD positions wrongly updated the holding field date latest coupon. This caused issues when trying to create a  proceed transaction at an earlier date than the stock loan fee transaction. The error has been corrected.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-92741","ChangeNote":"The Valuation date was not updated by the \u0027OTC-Validate all\u0027 batch job when an additional holiday day appears in the relevant holiday calendar, in case more than one Index swap TM  transaction exists per security. Transactions for update are now searched using the transaction number field (instead of the security ID) (Changed key field (Security ID -\u003E Transaction Number) to process transactions)","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92511","ChangeNote":"Fix L3 tests with including interest into calculation.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-92497","ChangeNote":"Use actual execution date in STRATBM_WEIGHT files (V1 \u0026 V2) created by AxR Position Integration upload batch job.","Products":["Business-Risk"]},{"SimCorpReference":"D-91799","ChangeNote":"Classic FX Forward should not show FixingDate value instead of ValueDate"},{"SimCorpReference":"D-92737","ChangeNote":"Flaky test ignored","Products":["Business-Modelling"]},{"SimCorpReference":"D-92340","ChangeNote":"Improve tree list control styling","Products":["Web-UC"]},{"SimCorpReference":"D-92631","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-92561","ChangeNote":"Holdings missing in results when assignment units with different PKR setting/FX rate price type are calculated together post-trade. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92263","ChangeNote":"Resolved a precision error in CapRed Transaction affecting the Balance cum Dividend nominal calculation.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-91258","ChangeNote":"Added CR 626037 to the C# mirror of the decomposition fetch functions such that holding key ik is now respected when it comes to filtering potentially redundant hybrids.","Products":["Instruments"]},{"SimCorpReference":"D-92490","ChangeNote":"No visible changes for users. Fix flaky unit tests","Products":["Reconciliation"]},{"SimCorpReference":"S-213624","ChangeNote":"Patch of enabling SWIFT MX for Securities Netting","Products":["Business-Netting"]},{"SimCorpReference":"D-91217","ChangeNote":"Fix auto-filling price for volume-basis simulations","Products":["Business-PortfolioManagement","Business-Transactions"]},{"SimCorpReference":"D-92492","ChangeNote":"Fixes a crash on \u0022Latest Version\u0022 in the Data Warehouse Manager, \u0022Show Diff\u0022 and \u0022Merge\u0022 on Dimension GL Account.","Products":["Business-DEX"]},{"SimCorpReference":"D-92072","ChangeNote":"Fix for Custom Analytics fact to avoid key violation"},{"SimCorpReference":"D-92308","ChangeNote":"The \u0027Transaction Option\u0027 \u0027Use exchange from static data (derivatives)\u0027 wrongly also was enabled for the \u0027Dealer CFD\u0027 window. Even though on CFD static dat it is not possible to define an \u0027Exchange\u0027. This has bene fixed.","Products":["Business-GeneralTransactions"]},{"SimCorpReference":"D-91086","ChangeNote":"We fix the Cash Viewer displays Dirty Value (DV) during a Deal Allocation stage of the order lifecycle.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92479","ChangeNote":"Changed loading strategy in Reporting Data Pool application to take more data distributions into acccount.","Products":["CsCode-Framework","CsCode-FundAccounting"]},{"SimCorpReference":"D-92188","ChangeNote":"Improved detection of test errors.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-92060","ChangeNote":"No impact on customers, expanded testing coverage","Products":["CsCode-Framework","CsCode-Accounting"]},{"SimCorpReference":"D-92131","ChangeNote":"In rare cases, the simultaneous update of group codes for the same securities both locally and on the group code service can lead to a deadlock. This has now been corrected.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-91215","ChangeNote":"Added support for path that contains () in mediator defined function.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-92491","ChangeNote":"Internal use: Switch references to old MS-test assemblies to a newer version","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92298","ChangeNote":"Removed or updated package dependencies in the LFT client package.","Products":["CsCode-UP"]},{"SimCorpReference":"S-215199","ChangeNote":"The TARF XpressInstruments gets distributed with the releases without file installation.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-92172","ChangeNote":"Fix side effect of S-148979 where it causes the Include Cash option to be greyed out","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92162","ChangeNote":"Use high precision arithmetic  when  calculating order amounts.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-91403","ChangeNote":"Fetch the Model Portfolios from SAAM along with the MPs from the positions","Products":["Business-Risk"]},{"SimCorpReference":"D-81271","ChangeNote":"If aggregation was equal to None and using performance figures the Asset Manager could crash in some rare situations.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-92207","ChangeNote":"We increased risk factor name field length when writing to volatility and correlation files","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-92256","ChangeNote":"Created a new batch task to stop all continuous AM cache jobs","Products":["Framework-Batch","Business-PortfolioManagement"]},{"SimCorpReference":"S-198610","ChangeNote":"Code and resource migration","Products":["CsCode-Framework"]},{"SimCorpReference":"D-92176","ChangeNote":"Fix the error where the ExchTraded model was not applied to derivatives, even though ExchTraded is a valid primary model for them.","Products":["Business-Risk"]},{"SimCorpReference":"D-92056","ChangeNote":"If the shutdown of the AM Cache service took longer that the \u0027grace period\u0027 (normally 5 minutes) a job currently being processed could be left as Executing.  Now it will have state Completed (even if no data has been produced).  Furthermore the Delete (job) api has been extended with an optional Force parameter that allows deletion of any job","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-92352","ChangeNote":"Incorrect loop creation in Position Calculation in case more than 100.000 holdings","Products":["Business-Risk"]},{"SimCorpReference":"D-92134","ChangeNote":"Changed category of WebService test from L1 to L3, to avoid flakyness in the merge gate. This is an internal change for integration tests. The change has no impact on customers.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-91383","ChangeNote":"Fixed authorization for \u0022Mandate default - Portfolio group\u0022 field in Data Selector","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-185384","ChangeNote":"SQLs executed from the Settlement Dashboard are using a lot of resources on the database. This has been optimized","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-92276","ChangeNote":"Solve referenced child record crash in risk alert cleanup","Products":["Business-Risk"]},{"SimCorpReference":"D-90425","ChangeNote":"For Total Return Swaps with quote factor different than 100, the rates were wrong for the sub-fixing of \nthe non-TR leg on the period end date.","Products":["StaticData"]},{"SimCorpReference":"D-92157","ChangeNote":"The code checking if a command is installed has been optimized.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-91379","ChangeNote":"Making reconnect more robust and not throwing as many error logs","Products":["Framework-Database"]},{"SimCorpReference":"D-89654","ChangeNote":"Client specific correction that relates to calculation of statistical key ratios in Performance Measurement, Performance Manager and Performance Reports.","Products":["Performance"]},{"SimCorpReference":"D-87431","ChangeNote":"A code change has been made to improve stability and authentication when testing batch processing of market data validation queues in internal installations. This change will not impact any external clients.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-91255","ChangeNote":"Margin Manager =\u003E Margin Call Saga Viewer: Security ID was missing in the logging message when applying Margin Manager defaults for Call Money positions. Fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90152","ChangeNote":"Additional filtering was added for election\u0027s holdings","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91700","ChangeNote":"The performance of STP \u0027Matching\u0027 Payments\u0027 has been improved.","Products":["Business-AuxJobTransactions","Business-Match","Business-Swift"]},{"SimCorpReference":"D-92018","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations","Products":["CsCode-SimTest"]},{"SimCorpReference":"D-90515","ChangeNote":"Customer specific change which should not change any SCD calculations","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91722","ChangeNote":"Error on refresh position in CM has been fixed","Products":["Business-Collateral"]},{"SimCorpReference":"D-91239","ChangeNote":"Add assertion for call money transactions that do not belong to corresponding collateral pool.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91936","ChangeNote":"APL is on a single thread, so the static \u0022caches\u0022 are reused on a second call. These caches must be cleared in case of data has been updated by user after the first batch job run.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91926","ChangeNote":"Add hint to database query selecting related pre-trade results for alerts.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91507","ChangeNote":"All authorization profiles that a user has been assigned to via different roles should be taken into account when evaluating if a user has access to a data selection.","Products":["CsCode-Framework","CsCode-FrontOfficeData","CsCode-FundAccounting","Instruments","CsCode-PortfolioManagement","CsCode-Settlement","CsCode-Workflow","Framework-Authorisation","Framework-CoreFramework"]},{"SimCorpReference":"D-91093","ChangeNote":"Added possibility to show summary values for group rows","Products":["CsCode-UpLogicalForms","CsCode-UP"]},{"SimCorpReference":"D-91593","ChangeNote":"When \u0027Executing \u0027 a \u0027Rebalancing\u0027 setup with \u0027Rebalancing type \u0027Currency overlay\u0027 and having \u0027Decompose funds\u0027 checked the error message \u0027You are trying to rebalance a setup containing unsupported instrument type(s)...\u0027 could wrongly also appear for decomposed positions. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-91981","ChangeNote":"In Asset Manager (Options - Decomposition - Decomposition types) height of dropdown was increased to show all types at once.","Products":["CsCode-Framework","CsCode-PortfolioManagement","CsCode-Prototyping"]},{"SimCorpReference":"D-90652","ChangeNote":"Improved performance of Alerts Inbox in System Manager by optimizing processing logic of inner DB selects.","Products":["CsCode-Settlement","Reconciliation"]},{"SimCorpReference":"D-91987","ChangeNote":"When result monitor applet shows a lot of results (several thousands) and a lot of results were changed in DB (\u003E 5000) then Reconciliation manager froze for several minutes.  This was fixed and now refresh goes much faster","Products":["Reconciliation"]},{"SimCorpReference":"D-91094","ChangeNote":"The \u0027Save effect details\u0027 check box in Performance Measurement controls if risk factor sensitivities and factor changes should be aggregated into the measurement tree and saved to the result tables. The user is asked if existing details data should be deleted when changing the check box selection. But nothing was deleted even if the user chooses to delete. This error has been corrected so the sensitivity and factor change data that is toggled by the check box is deleted if the user chooses to delete.","Products":["Performance"]},{"SimCorpReference":"D-91201","ChangeNote":"DWH: Fix user marts ignoring cutoff values when being loaded incrementally","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-91416","ChangeNote":"Fix the issue, now the simulated transactions with non-zero price are not priced with Fixed Implied Spread pricing approach.","Products":["Business-Risk"]},{"SimCorpReference":"D-91708","ChangeNote":"Improved performance of Alerts Inbox: updated how the system reads reconciliation runs so the database can find each run in one quick step, speeding up queries and reducing load times.","Products":["Reconciliation"]},{"SimCorpReference":"D-91650","ChangeNote":"In the \u0027Portfolio Calculation\u0027 \u0027Simulated unrealised hedge depreciation QC/PC\u0027  was not calculated in case a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-91923","ChangeNote":"Technical changes related to the Compliance Partitioning. The value for CMPLRESTYPE field in the reporting helper table CMPLREPDETAILS has been corrected.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90783","ChangeNote":"We have fixed an issue where the status in the General election status field was incorrectly updated, when a corporate action event was transferred to static data in the Corporate Actions Manager. This is done by removing zero balance holdings when the status in the General election status field is defined.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91283","ChangeNote":"Add support for the \u003CValueDate\u003E tag in the XML. Value from this tag to update \u0027Settlement date\u0027 on transaction","Products":["Business-CorporateActions","CsCode-Trading"]},{"SimCorpReference":"D-91074","ChangeNote":"Collateral Cassini integration:  issue a message to user regarding not recommended AccrIntCalc settings on Pool.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-91495","ChangeNote":"Make sure Analysis date is UTC kind and make data last updated in UTC format","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91178","ChangeNote":"Fix incorrect Nominal calculation on CA open transaction in TM","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91647","ChangeNote":"Fixed  sticky session behavior when connectiontarget is \u0022*\u0022 and downstream service agent was changed"},{"SimCorpReference":"D-91692","ChangeNote":"Crash in Risk Measurement/Performance Calculation/Position calculation in case of decomposing hybrid funds. Was fixed","Products":["Business-Risk"]},{"SimCorpReference":"D-91257","ChangeNote":"Fixed error in the Order Manager Management service following Daily maintenance"},{"SimCorpReference":"S-206202","ChangeNote":"Support injecting SSS config files at container runtime."},{"SimCorpReference":"S-206203","ChangeNote":"Allow the ability to inject static data at runtime for the Bundled Environment in a configurable way."},{"SimCorpReference":"D-91248","ChangeNote":"The summary type for alphanumeric custom fields is now Unique","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91822","ChangeNote":"Make Workspace size requirement lower for position calculation decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-91551","ChangeNote":"Tests modified to be not flaky","Products":["CsCode-Trading"]},{"SimCorpReference":"D-90975","ChangeNote":"Raise status from Warning to Error for Extraction object is not validated message for Extraction Exporter Definition.","Products":["Business-DEX"]},{"SimCorpReference":"D-88825","ChangeNote":"Fixed Nominal in Modify position window to respect current Percentage change on Incremental update","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-89842","ChangeNote":"Added more info when an rare occurring error happens","Products":["CsCode-Accounting","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-91888","ChangeNote":"If the test project references a newer MSTest but your runner (or another assembly) is binding to an older version, the method signature may not be found.\nUse ReferenceEquals instead of AreSame method","Products":["CsCode-UP"]},{"SimCorpReference":"D-91309","ChangeNote":"In certain situations it was possible for a service to attempt a fallback to local APL execution after failing to find an APL worker service instance w/o actual being capable of executing locally. This would cause an error with a difficult to understand message. The error message has now been improved.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91438","ChangeNote":"For convertible bonds priced with OneLib only tranform the Quoted price method to Theoretical when the discounting cuve was shocked in market data scenarios.","Products":["MarketData"]},{"SimCorpReference":"D-91618","ChangeNote":"Correction of programm error found while decomposing. Related to IFRS9 purpose inheritance.","Products":["Decomposition"]},{"SimCorpReference":"D-91511","ChangeNote":"Fixed vulnerable version for vite npm package","Products":["Web-UC"]},{"SimCorpReference":"D-87687","ChangeNote":"Logic specific to a single client was removed in Performance Measurement. The logic hard coded the benchmark return to 0% on the first day for new dynamic split value nodes in the Performance Measurement tree.","Products":["Performance"]},{"SimCorpReference":"D-91543","ChangeNote":"In some cases reconciliation payments were generated with wrong portfolio currency. It has been fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-85238","ChangeNote":"When a transaction is modified on a high status with a auxiliary job that has Now (outside commit sequence) then there is a timing issue that can trigger that the cancel job on the reversed transaction is triggered twice. This has been corrected.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-90411","ChangeNote":"Fixed case when a user with appropriate privileges was unable to retrieve data via the OrderDetails and LinkedOrders endpoints when using non-default portfolio masters.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91717","ChangeNote":"Avoid crash in calculations for OneLib convertible bonds, when the key ratio OAS is not requested.","Products":["Valuation","CsCode-Framework","TradeManager"]},{"SimCorpReference":"D-91580","ChangeNote":"This is an internal change for integration tests. The change has no impact on customers.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-91418","ChangeNote":"When saving new issue of a Japanese government bond in Asset manager (Simulations/Portfolio sheet applet), the 1st coupon payment date is automatically calculated based on issue date and coupon term \u0026 unit.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91338","ChangeNote":"Cassini integration: Added validation which prevents auto substitution  via MM   for multi-currency calls via CASSINI","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-91408","ChangeNote":"Rounding for Interest in Securities Lending Maturity transaction window was corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91737","ChangeNote":"Disable flaky tests","Products":["CsCode-Accounting","CsCode-Framework"]},{"SimCorpReference":"D-91297","ChangeNote":"An error could occur when allocating a block order for Trade Manager instruments that was copied from a previous trade. This issue has now been resolved","Products":["TradeManager"]},{"SimCorpReference":"D-91218","ChangeNote":"The system didn\u0027t detect the right dependencies for User Defined Key Ratios so that the subtotal calculation in the AM Cache Api did not calculate the right numbers if not all  QC/PC/RC fields were explicitly stated","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91238","ChangeNote":"Rounding rule field was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91425","ChangeNote":"When a SimCorp Dimension installation have too many open alerts (\u003E 10.000) the Business rules alerts service could become unresponsive during processing of alert changes and therefore were shutdown by the service platform. The error has been fixed. In addition the service now logs a warning before every new change processing  in case the SimCorp Dimension installation has more than 10.000 open alerts.","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-91694","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91686","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-91226","ChangeNote":"Changed title of \u0022Asset Manager Cache monitor\u0022 from using the \u0022AM\u0022-abbreviation to \u0022Asset Manager\u0022","Products":["Business-EventCalendar","Business-PortfolioManagement","CsCode-PortfolioManagement"]},{"SimCorpReference":"S-212156","ChangeNote":"Add Flexible Analytics IK to Benchmark Aggregation Calculation fact","Products":["Business-Reporting"]},{"SimCorpReference":"D-91642","ChangeNote":"Fix failed tests due to changed output format. Does not affect business logic.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-91445","ChangeNote":"Pre-trade results have grown in size because information irrelevant to the performed pre-trade check is included in the results. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91209","ChangeNote":"Load authorisation cache for pre-trade orders API only once","Products":["CsCode-Compliance","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90686","ChangeNote":"Ensure grid properties activated because they contain non-empty data stays active when switching to another layout.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91586","ChangeNote":"Test moved to LR category to run weekly","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91302","ChangeNote":"This regards transactions from the window ‘Exercise FX Options’ and similar transactions  in the Trade Manager. The calculation of the settlement amount as a sum of amount components should not be altered in the classical window.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-90306","ChangeNote":"FX placement now can be auto-allocated when done for day flag is received"},{"SimCorpReference":"D-90470","ChangeNote":"Added validation which prevents auto allocation via MM or batch job for multi-currency calls via CASSINI","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-90945","ChangeNote":"Additional check if the TRS is Forward Starting is added while looking for the relevant position: Forward Started TRSs are not supported at the moment","Products":["Business-CorporateActions","XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-91446","ChangeNote":"Improve validation message for swap rate correlation standard contracts","Products":["MarketData"]},{"SimCorpReference":"D-91021","ChangeNote":"Fixed an error that occurred when updating capital event static data for ADRs and Fund certificates with data from a new CA notification for an existing capital event.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-91249","ChangeNote":"In the \u0027Portfolio Calculation\u0027 wrongly an error message complaining about missing prices could appear, incase a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-90319","ChangeNote":"When finding the settlement date for an XpressInstrument via Capture Trade in the Order Manager, the holiday calendar specified for the instrument was not taken correctly into account.","Products":["Valuation"]},{"SimCorpReference":"D-90621","ChangeNote":"OM Automation service to use unmanaged oracle driver to be consistent with the rest of OM"},{"SimCorpReference":"D-91224","ChangeNote":"In explain price search the Quoted \u002B yield curve price method for mid-curve swaptions was incorrectly labelled as \u0022Theoretical price, mid-curve swaptions\u0022","Products":["MarketData","CsCode-Settlement"]},{"SimCorpReference":"D-87745","ChangeNote":"Fix a possible issue in OM allocation block transaction creation for CDS index. Disable recalculation of notional when dictated by block.","Products":["TradeManager"]},{"SimCorpReference":"D-91171","ChangeNote":"Unit test related. Is not visible to a user of SCD","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90430","ChangeNote":"YieldForMathAdjSold should be calculated for average financial accounting method","Products":["Business-FrontOfficeData","Valuation","CsCode-FrontOfficeData","Instruments","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91342","ChangeNote":"Feature switch to use the new Front Office Data service is off by default. As a result, for new client Balancer does not work. Fixed. Now new Front Office Data service is used by default.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"S-211934","ChangeNote":"There was no authorisation for Portfolio Groups (only for Portfolios) in Trade Manager. This was fixed here.","Products":["TradeManager","Instruments","XpressInstruments","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90839","ChangeNote":"Communication service, mediator: adding more resilience and logging to internalwebrequest CDL command.","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-90893","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"S-201383","ChangeNote":"IMW updates: fix for Dims: Fra Security, Future Security, Performance Investment Structure. New dims/facts for Lineage. New fact PFC Cash Flow","Products":["Business-Reporting"]},{"SimCorpReference":"D-90429","ChangeNote":"The Rule entry - Credit Risk fields Collateral, issuer risk and Collateral, cpt. risk have now been re-enabled for holding base rules.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90297","ChangeNote":"Fix program error during payment reconciliation of private debt for cases when there was not enough data to update subledgers.","Products":["Business-Cash","CsCode-Accounting"]},{"SimCorpReference":"D-91115","ChangeNote":"A database error can occur for appendable portfolio calculation using the \u0022Recalculate changed\u0022 setting. The error has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90498","ChangeNote":"Avoid 0 qty orders in blotter after merging programs"},{"SimCorpReference":"D-90444","ChangeNote":"Apply price rounding correctly when allocating multiple Future placements from OM","CustomerApplyNote":"Apply price rounding correctly when allocating multiple Future placements from OM"},{"SimCorpReference":"D-90680","ChangeNote":"Perform single heartbeat when NATS connection dropped and re-established"},{"SimCorpReference":"D-90320","ChangeNote":"When scrolling over templates in AM Settings Template, Cash Viewer tab display is updating.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90766","ChangeNote":"When calculating risk factor standard predictive and successive scenarios, the inflation curves risk factors were previously shocked in a way that was inconsistent with other yield-based risk factors. This inconsistency has now been corrected.","Products":["Business-Risk"]},{"SimCorpReference":"D-90089","ChangeNote":"Skip redistribution of carried nominal for internal trade, so it will not be recalculated.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-90353","ChangeNote":"This change corrects some problems when importing into initially closed fields using only a single import sequence group.","Products":["XpressInstruments"]},{"SimCorpReference":"S-206807","ChangeNote":"Update OASYS CBU to handle auxiliary job definitions.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-91052","ChangeNote":"It was possible to create Reallocation Security No into security with incomplete static data. It has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90532","ChangeNote":"Change  0 values in generated file to empty, fix validations issues","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-89895","ChangeNote":"Added function that copying Trading Platform field to the second leg","Products":["Business-Transactions"]},{"SimCorpReference":"D-90486","ChangeNote":"YieldForMathAdjSold to be present in MPV and TL","Products":["Business-TransactionBookingAccounting","Valuation","CsCode-FrontOfficeData","Instruments","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90638","ChangeNote":"In the Asset Manager (Order Outbox applet), data is not displayed when the user changes the default role. The resolution is to consume the User Context in the Authorization Handler Provider class.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90829","ChangeNote":"Conversion to dereference OASYS auxiliary job types and functionalities","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-91070","ChangeNote":"The \u0027Economic Benefit\u0027 was calculated wrongly on \u0027Settle Loan Facilities\u0027 transactions. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90797","ChangeNote":"Ensure online static data updates are coming through for Workflow service"},{"SimCorpReference":"D-89819","ChangeNote":"CompetingBids now contains quotation type IndexedPrice for received FIX bids with PriceType Price when instrument quotation type is IndexedPrice"},{"SimCorpReference":"D-90889","ChangeNote":"Ensure that the minimum version of FNS is 25.10"},{"SimCorpReference":"D-91114","ChangeNote":"Batch job \u0022FIPA Effects Calculation - Upload Results\u0022 can only be seen if FIPA Effects Calculation module is installed.","Products":["Framework-Batch"]},{"SimCorpReference":"S-199219","ChangeNote":"Amend allocation of FX netted placements"},{"SimCorpReference":"S-209755","ChangeNote":"Trade Manager/OTC API: Fix issue with incorrect field name in error messages related to empty security ID fields\n\nTrade Manager Loan facility with GCA enabled: Payment amount GC is now updated when Cost/Tax is changed\n\nDisabled the Corporate action specific transaction codes on the Bond swap for release as feature is not yet complete\n\nUse a different counting mechanism\n\nIn the schema for OTC Search Web API the item pointer \u0027IML_instrument_type\u0027 is replaced with \u0027IML_OTC_instrument_type\u0027. Now GET and DELETE endpoints in the OTC Web API work as expected for XpressInstruments with specified IML instrument sub-type","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading","CsCode-Transaction"]},{"SimCorpReference":"D-90957","ChangeNote":"Unfunded value PC was not recalculated on Settle Loan Facilities when changing Amount in contract\u0027s in-subform. That has been fixed now.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90699","ChangeNote":"In Asset manager (Simulations applet) in FX Single currency window security is now filled after base/price currency is filled. This ensures correct security selection according to FX simulations defaults.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-123456","ChangeNote":"Margin Manager -\u003E Interest Statements tracker applet: Provide a Margin Manager user possibility to choose reason and comment on \u0022Dispute Their Interest Statement\u0022 action."},{"SimCorpReference":"D-90757","ChangeNote":"Do not check mandatory fields from state controls when passing unsettled trades from Asset Manager to Front office Portfolio calculations copy.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91016","ChangeNote":"For External and Internal message queues updated a mechanism that check if the data received from DB is correct and non-ambiguous. Add solution for cases when we retrieve only one data row with data info for requested transaction number.","Products":["Business-STP"]},{"SimCorpReference":"D-90348","ChangeNote":"Collateral Cassini integration:  issue a message to user regarding not recommended AccrIntCalc settings on Pool.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-91047","ChangeNote":"Reverted an earlier data import error formatting change.","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-86010","ChangeNote":"Crash in Asset manager after deletion of FX Swap simulation. Fixed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-90713","ChangeNote":"Use Pinned Connection","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-90758","ChangeNote":"The CBU routine for moving past version 24.07 could report a false positive about 4-Eyes approvals needing changes even when no approvals existed. This has been fixed.","Products":["Framework-Audit"]},{"SimCorpReference":"D-90923","ChangeNote":"A save action failed after a final Manual Match in the General Reconciliation workflow due to a program crash. This defect has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-90364","ChangeNote":"Respect the \u0027min_log_level\u0027 cnf.ini parameter in OTEL.","Products":["CsCode-Framework","Framework-Telemetry"]},{"SimCorpReference":"S-190231","ChangeNote":"High availability of the FIX API service"},{"SimCorpReference":"D-90625","ChangeNote":"Margin Management: Margin Calls with RecalReceive action and Parties Suggested Margin were not applicable for allocation via Simplex if a zero-balance Margin Account existed. Fixed.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-90468","ChangeNote":"N/A: Internal change: clients should not be affected, SmartQueue performance test improving.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-90631","ChangeNote":"GROUPCODEVALS dependency is added to the Compliance Rule configuration transport if Group Code attribute with textual value defines the rule.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90991","ChangeNote":"In some situations the message queue service did not respect the creation order of messages within a discrete group. This has been corrected.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-90876","ChangeNote":"The error message \u0027It is not allowed to move cash between different portfolio masters\u0027 could wrongly appear when trying to load a transaction into the \u0027Overnight Account Payments\u0027 window. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-90768","ChangeNote":"A correction is made to the factor based FIPA fair cash flow on decomposed spot legs of IRF positions in Performance Calculation. This affects the fair cash flow itself as well as the factor based FIPA local return, when this is calculated using the TWR based approach. The correction ensures that the cash flow adjustment is consistently based on exposure, which removes spikes in the factor based FIPA local return on decomposed IRF positions on days with buy or sell transactions.","Products":["Performance"]},{"SimCorpReference":"D-90414","ChangeNote":"[TECHNICAL/3T]  Re-enabled filter viewing. Item fields of item type 1, that are not drop-downs, should still have item sets.","Products":["Framework-InternalGuiFramework"]},{"SimCorpReference":"D-90775","ChangeNote":"An error could occur when processing \u0027Awaited Fund Events\u0027 on the STP service. This has been fixed.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90194","ChangeNote":"This change is a performance enhancement related to the  Portfolio Calculation when you are using \u0022Recalculation changed\u0022 in the Functions menu. The change reduces the number of holdings and transactions that are handled to those with virements on the holding. By reducing the number of holdings and transactions with a new condition, the calculation time is improved for the portfolio calculations.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90668","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-90841","ChangeNote":"for OneLib Mid curve swaptions, when filling correlation data for interpolation, interpolate first in rows  and then in option maturities","Products":["Valuation"]},{"SimCorpReference":"D-90899","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations"},{"SimCorpReference":"D-90955","ChangeNote":"Fixed a possible crash in order auxiliary job functionality. The crash could happen during the order update when the aux job fields include some security static data field.","Products":["Business-AuxJobOrders","Business-PortfolioManagement"]},{"SimCorpReference":"D-90618","ChangeNote":"Read ApiBaseURLPrefix dynamically from cnf.ini","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-90771","ChangeNote":"When allocating order block allocations from the Order Manager using a CDS Index standard product, an error message saying \u0022Standard Product ID is a mandatory field and must be specified if Security group is defined as False\u0022 could occur. The missing ID is now populated with a Standard Product ID.","Products":["TradeManager"]},{"SimCorpReference":"D-90557","ChangeNote":"Increasing api test coverage for delta vector","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90577","ChangeNote":"2T GUI update flow was called in 3T which cleared update flags!","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-90445","ChangeNote":"Resolve leak in UP ConnectionPool and F.Data.Managed","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"S-198307","ChangeNote":"Converting Order Manager FIX API service to NET8"},{"SimCorpReference":"D-90448","ChangeNote":"After the CDS reversioning transaction, the new position could not be netted due to inconsistency in the security and original transaction number in the nominal match holdings. Here it has been fixed, the position netting transaction can be successfully saved.","Products":["TradeManager","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-89340","ChangeNote":"Remove A_COLLATERAL_SUBRESULTS.MIN_RETURN_AMOUNT field from Standard Reports","Products":["Business-Reporting"]},{"SimCorpReference":"D-90894","ChangeNote":"When the same risk factor was mapped to multiple positions and imported sensitivities were used for pricing risk models (e.g., Monte Carlo, Historical), the imported sensitivities were taken incorrectly from Key Ratios Calculation =\u003ERisk Factor Sensitivities. This issue has now been corrected.","Products":["MarketData"]},{"SimCorpReference":"D-90460","ChangeNote":"Added dynamic reading of swagger.json version for downstream services"},{"SimCorpReference":"D-90863","ChangeNote":"testBrick_UtilEndTransPreConditions removed from the brick test","Products":["Business-PrivateDebt"]},{"SimCorpReference":"D-90025","ChangeNote":"Flaky test has been fixed and re-enabled again.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90632","ChangeNote":"QC and PC key ratios were not not calculated for mid-curve swaptions using OneLib valuation. Resolved by setting pool factor to 1","Products":["Valuation","CsCode-Collateral"]},{"SimCorpReference":"D-90299","ChangeNote":"Now, in the CTM screen, if a transaction that has only outgoing messages is selected, then the \u0022Open Match\u0022 button in the form is enabled. If you press the button, the form \u0022Match\u0022 will open and the tab \u0022Deviations\u0022 will be activated. The figures of deviations will look like you get an empty (contains only zeros) confirmation message.","Products":["Business-CentralTradeManager","Business-InvestmentOperations","Business-Swift"]},{"SimCorpReference":"D-90342","ChangeNote":"Change in internal tests, no impact on customer installations","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90640","ChangeNote":"Disabled the Corporate action specific transaction codes on the Bond swap for release as feature is not yet complete","Products":["CsCode-Trading"]},{"SimCorpReference":"D-90300","ChangeNote":"For External and Internal message queues add a mechanism to check if the data received from DB (that is used to update Int and Ext message queues) represents the correct \u0022Security\u0022 in scope of the requested \u0022Transaction No\u0022.","Products":["Business-STP"]},{"SimCorpReference":"D-90547","ChangeNote":"Fix ORA-00001: unique constraint violation (SCDAT.P_DWHSYNCACTIONS) during Import of DATAWAREHOUSE entity","Products":["Business-DWH"]},{"SimCorpReference":"D-90035","ChangeNote":"Update InputFieldDefinition fields when a new row is created","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90252","ChangeNote":"\u0022Value filled PC absolute\u0022 and \u0022Value filled QC absolute\u0022 was 100x the value as expected in OOB for Finished orders with special currency (like GBp/GBP). This was corrected together with Indicative price.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90209","ChangeNote":"Reduce workspace requirement during initialisation phase of position calculation during decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-90487","ChangeNote":"Fix a crash in OM allocation message processing for FX swaps","Products":["Business-PortfolioManagement","Tools"]},{"SimCorpReference":"D-90558","ChangeNote":"Rounding rules were not applied to the suggested margin amount for Margin Call with Return/Recall actions when the setting in Collateral Manager setup =\u003E Collateral Calculations =\u003E \u0022Ignore MTA and rounding on full return/recall amount\u0022 is On. It was fixed.","Products":["Business-Collateral"]},{"SimCorpReference":"S-210040","ChangeNote":"A tab \u0027Investment Analytics Service - FIPA\u0027 has been made configurable.","Products":["Performance"]},{"SimCorpReference":"D-90765","ChangeNote":"Ensure that for MidCurve Swaptions the interpolated correlation cannot be outside the [-1,1] limits.","Products":["Valuation"]},{"SimCorpReference":"D-90718","ChangeNote":"A problem with generic payment matching using manual payment reconciliation and external netting was found and fixed","Products":["Business-STP"]},{"SimCorpReference":"D-90525","ChangeNote":"UDKR weight fields were not excluded from calculation and streaming, fixed now.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90608","ChangeNote":"Fix Asset Manager Cache API crash when we use GroupBy at web API request","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90485","ChangeNote":"Two Front office data service load balancers could handle the service queue in case of reconnection to another MUCS and two such services run.  This has now been corrected.","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90396","ChangeNote":"The lifetime for liquidating funds has been slightly adjusted so additional distributions are forecasted.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-90605","ChangeNote":"Added validation rule to Float Rate Index Definitions form. Now Customer Business Centre only allowed for TRSs","Products":["TradeManager"]}]