[{"SimCorpReference":"D-84609","ChangeNote":"When Decompose derivatives, Calculate synthetic interest and Decompose index contracts is selected in performance calculation, the cash flow values for constituents also include Decomp synth accrued interest xOD, according to the cash flow timing setting in the performance calculation. Previously that only applied to the component type Spot (decomposed to constituents), but not Constituent from spot.","Products":["Performance","Framework-Database"]},{"SimCorpReference":"S-197392","ChangeNote":"Internal testing tool for Alternatives Release Verification Pipeline. Rerun flaky tests to reduce developer time spent on false positives"},{"SimCorpReference":"D-87605","ChangeNote":"The AM Cache did not use the \u0027Order fill updates event throttling threshold\u0027-value from the setup - it defaulted to 5 seconds","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87959","ChangeNote":"Create manual compliance failure alert in some cases happens where Branch column has no value and it effects directly on the setting up a cause for the alert.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86790","ChangeNote":"From time to time there is crash when running PFC for Deferred P/L results. The error is fixed.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-87125","ChangeNote":"Update current rule tables for importing rule lib folders vis ConfigMgr","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87491","ChangeNote":"Check service config on launching thread"},{"SimCorpReference":"D-87787","ChangeNote":"Fixed a a performance issue: When using grouping from either Current Positions api or AM Cache Get data api with a high number of groups would perform so slow that user would get a timeout","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-85926","ChangeNote":"Fix random selections in Source Fields grid after statement change , scroll and other row selection.","Products":["Business-DEX"]},{"SimCorpReference":"D-87475","ChangeNote":"new formula values added","Products":["Framework-Formulas"]},{"SimCorpReference":"D-87752","ChangeNote":"When reconciliation tries to do a one side matching it could count results that were marked as deleted. This could lead to one side matching when amount is not netted to 0. This error was fixed","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-86849","ChangeNote":"Check on index error in DWA DBI functions.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-87539","ChangeNote":"Crash in cnfTrp service by importing Performance Measurement. Was fixed","Products":["Performance"]},{"SimCorpReference":"S-195498","ChangeNote":"Calculate commission for web allocate"},{"SimCorpReference":"D-87537","ChangeNote":"Crash when applying order defaults \nwith dynamic bank account to a large number of orders is fixed.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"S-196702","ChangeNote":"New Check Before Upgrade","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-86855","ChangeNote":"Add opportunity to create empty bm files, even if on uncalculated date","Products":["Business-Risk"]},{"SimCorpReference":"D-87343","ChangeNote":"If more than one column is passed to insert values column by column.","Products":["CsCode-PortfolioManagement","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-87314","ChangeNote":"Fixing of possible sorting issue leading to incorrect data read and so incorrect data exported with GL Format setup","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-87637","ChangeNote":"The issue is fixed by adding an extra check in the code.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-87212","ChangeNote":"Added the ability to generate and save AOCI amortization transaction via the Create end-of-period transaction window when the amortization amounts for the entire position is zero, but there are amounts ​​for AOCI match  lots.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-87038","ChangeNote":"The sanity check for the loan facilities tables has been revised. Previously, it was incorrectly triggered when the substitution framework functionality was used.","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-87285","ChangeNote":"Fixed incorrect translation of domains on CTM load","Products":["Business-CentralTradeManager","Business-Match"]},{"SimCorpReference":"D-87436","ChangeNote":"Pool factors should only be updated for relevant instruments and transactions.","Products":["Business-Transactions"]},{"SimCorpReference":"D-87651","ChangeNote":"Auxiliary double check job for US MBS Pools didn’t work correctly when creating trade via External client trade window and having parameter ‘only status changed’ set to Yes. It was fixed.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-87614","ChangeNote":"Fixing crash during execution of FX Rate Update fund event while trying to update IQ rate","Products":["Business-Transactions"]},{"SimCorpReference":"D-87074","ChangeNote":"Support F-TIIE(OIS) in Mexican Inflation Curve (Mexican UDI) estimation","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87674","ChangeNote":"Disabled performance tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"S-198624","ChangeNote":"New dimensions - Options Security, FRA Security, new fact for Flex Values Decomposed and fix for Cash Transaction fact"},{"SimCorpReference":"D-87053","ChangeNote":"Fixed extrapolation of volatility for volatility curve given by risk reversal and butterfly spread for Linear int.pol method.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87035","ChangeNote":"Quotes of underlying security are used for Theoretical price, convertible bonds  (OneLib) and Quoted prcie \u002Byield curve, convertible bonds price methods","Products":["Business-Risk"]},{"SimCorpReference":"D-87530","ChangeNote":"Current Positions and AM Cache now respects per-portfolio Load Cash-settings that are set in the data selections.  Previously they were ignored","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87511","ChangeNote":"Add logging to user authorization batch job, such as how many setups, data selections are found in the installation, how many setups are processed every minute.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86832","ChangeNote":"Improved OutOfMemoryException handling to reduce the risk of hanging process.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-87562","ChangeNote":"Standard Product with the Index which had Termination Date = 20-06-2025, was removed from the SpecFlow tests","Products":["CsCode-Trading"]},{"SimCorpReference":"S-197081","ChangeNote":"Before when calling GetDestionationConfig, we got destinationConfig for all entries and a client was created for all of them. Now you can pass in the destiantionIds to GetDestionationConfig and only get the ones you need. \n\nAlso better tracing is added","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87301","ChangeNote":"Added two null guards to protect code from crashing in DataLayerClients","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86933","ChangeNote":"We removed rounding for all estimated  \u0027Correction index\u0027 and ‘Correction additional index’ calculations, including dollar inflation sensitivity","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-86801","ChangeNote":"Added retaining of the \u0022selected\u0022 state of the Use Outbox Selection button when switching layout/setup","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87510","ChangeNote":"User authorization batch job fixing infinite loop due to corrupted data selectors and removing output to local file in case user has no access","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87323","ChangeNote":"In rare cases, it was a group code performance issue related to the group code update via batch job. This has now been corrected.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-87366","ChangeNote":"No longer look at full history of assignments including removed assignments when importing global and legal set assignments via Configuration manager","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87297","ChangeNote":"When decomposing an index contract in the Portfolio Calculation the end of day nominal weights were scaled incorrectly with the effect that among others the \u0027Clean Value QC/PC\u0027 and the \u0027Balance Nominal/Number\u0027 were  incorrectly calculated. This has been fixed.","Products":["Benchmarks"]},{"SimCorpReference":"S-198899","ChangeNote":"S-198899: revert changes to apply the tactical solution only for UBS","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-87139","ChangeNote":"Fixed filtering out direct brokers for FX \u0026 FI orders"},{"SimCorpReference":"D-87195","ChangeNote":"The maturity date is used to select the new security for a Credit Event transaction in cases where there is an ambiguity.","Products":["CsCode-Trading","Business-Transactions"]},{"SimCorpReference":"D-87081","ChangeNote":"Fixed Class field value \u0022Preliminary transactions\u0022 for Orders API V3","Products":["CsCode-FrontOffice","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87344","ChangeNote":"\u0022Permission to establish database connection has not been granted\u0022 was returned when after writing a new password if the password was reset. This has been corrected.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-87447","ChangeNote":"Transaction List in Alerts Inbox can be a huge and that impacts performance. We need to limit how much we can load, max 1000 transactions and not older than 1 month.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86294","ChangeNote":"For \u0027Open ended\u0027  \u0027Securities Lending\u0027 positions with \u0027Fee paid\u0027 set to \u0027Last in month\u0027  and \u0027Underlying\u0027 \u0027Bonds\u0027 was not possible anymore to create the final  \u0027Premium\u0027 transactions after the position was closed on its \u0027Maturity date\u0027. This has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86668","ChangeNote":"Add summary dependency fields to the cache job","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86771","ChangeNote":"Fixed AM crashes while working with Browser host widgets loaded to Dashboards","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-87043","ChangeNote":"The number of instances for APL worker services was increased","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-87215","ChangeNote":"Introducing a popup with the option to halt the generating of special customer tables when selecting this in the portal","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-87163","ChangeNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","CustomerApplyNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","Products":["CsCode-FundAccounting"]},{"SimCorpReference":"D-86435","ChangeNote":"Fixed an error in the fund decomposition area, where the decomposition profiles \u0022Max Age\u0022 functionality would sometimes exclude too many components.","Products":["Decomposition","MarketData"]},{"SimCorpReference":"D-86781","ChangeNote":"Fix missing Audit history on assignment sub-list after transfer configuration","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87259","ChangeNote":"Add IncludeLineBreaksInHeaders option to data export","Products":["CsCode-UpLogicalForms","CsCode-UP"]},{"SimCorpReference":"D-86813","ChangeNote":"Remove SQ code smell","Products":["CorporateActions"]},{"SimCorpReference":"D-87037","ChangeNote":"Trim long message about multiple force finished orders, so that it does not crash the message service","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-87013","ChangeNote":"Fixed the click event propagation in case of the client editor validation error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-86723","ChangeNote":"Calculating Payment amount PC as a sum of its PC constituents when recalculating with MDF fx rate","Products":["Business-Risk"]},{"SimCorpReference":"D-85223","ChangeNote":"In certain specific cases, the user role password could unintentionally be part of a memory dump. This has now been corrected.","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"D-87185","ChangeNote":"The email audit functionality has been reintroduced.","Products":["CsCode-Compliance","CsCode-Framework","CsCode-TestUtility","CsCode-Workflow","Framework-Configuration","Framework-CoreFramework","Framework-Mails"]},{"SimCorpReference":"D-86119","ChangeNote":"Remove default query on active passive determination","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-85842","ChangeNote":"Corrections to the C# NetCore Services build"},{"SimCorpReference":"D-86938","ChangeNote":"Fixed issue with UETR on Swift relay massages","Products":["Business-Swift"]},{"SimCorpReference":"D-87008","ChangeNote":"New setting to control Dynamic bank account behavior is added to Order options. When the setting is unchecked, dynamic bank account is expanded and sorted according to the Show system configuration -\u003E Currency setting.\nWhen the setting is checked, dynamic bank account is expanded to BAs quoted in order\u0027s settlement currency.","Products":["Business-PortfolioManagement","Business-SettlementCostDefault","CsCode-Collateral","Framework-Configuration"]},{"SimCorpReference":"D-86918","ChangeNote":"Fixed Model Portfolio field value on Portfolio Sheet during benchmark compression.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-87252","ChangeNote":"Internal integration tests related change: clients should not be affected.","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-195786","ChangeNote":"Fixed Missing InsType Invalidates IMW Swap Security Dimension"},{"SimCorpReference":"D-87135","ChangeNote":"Database is change to handle numbers the same way as Balance Nominal number Simulation","Products":["Business-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87030","ChangeNote":"Fixed an issue in the Standard Contracts Deposits screen, wherein the three fields \u0022Term is business days\u0022, \u0022Term length\u0022 and \u0022Term unit\u0022 would not be correctly opened by the checkbox \u0022Use standard term structures\u0022.","Products":["MarketData"]},{"SimCorpReference":"D-86877","ChangeNote":"Clean UploadFileEndpointTest and do not run doDelete if fileName is null or empty","Products":["CsCode-UP"]},{"SimCorpReference":"D-86672","ChangeNote":"Only load relevant Shock Structure","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86284","ChangeNote":"The batch job \u0022Corporate Actions - Election Data Preparation\u0022 should update balances even for elections that are not included in the CAE API GET results.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-87186","ChangeNote":"The memory execution of segments when applying settlement defaults for many transactions has been optimized. E.g. when applying settlement defaults for forecasted transactions generated during a portfolio calculation.","Products":["Framework-Segments"]},{"SimCorpReference":"D-85456","ChangeNote":"On this change 3 improvements are implemented to improve strategy analysis application applet performance: (1). Optimize commitment aggregation logic when fetching middle office data; (2) Avoid unnecessary operations when computing IRR; (3) Avoid unnecessary data transformation and lookup when displaying data.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-86001","ChangeNote":"Add performance improvement for Modified Parametric VaR calculation and logs.","Products":["CsCode-RiskManagement"]},{"SimCorpReference":"D-86746","ChangeNote":"Fix result of DX_PKG.KEYEXPAND function.  IMPORTANT NOTE: this fix changes result of DX_PKG.KEYEXPAND if 3rd argument is not VARCHAR  from \u0027KEY:  42\u0027 (where 42 is value of 1st argument) to actual value of this field.","Products":["Business-DEX","Framework-Database"]},{"SimCorpReference":"D-86083","ChangeNote":"As part of performance improvements done in the Reporting pool where new Load hidden lines functionality was implemented, an unintended side-effect was that data import of Reporting pool data no longer worked. This has been fixed.","Products":["CsCode-Connectivity","CsCode-FundAccounting"]},{"SimCorpReference":"D-86353","ChangeNote":"TMP/FIN deviation is corrected if the SO Accrued interest transaction is being booked on Fin. Calc booking track and when it was prior backdated by sell on position status. The problem occurs when AI per tax lot functionality is activated on the FAM. This problem prevented saving further TLCA transactions.","Products":["Business-SystematicAdjustments","Framework-ToolsInternalAccounting","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86559","ChangeNote":"New setting  \u0022“Auto-release order after pre trade validation override\u0022\u0022 is added to Order Options to control the order release workflow.","Products":["Business-PortfolioManagement","CsCode-Compliance","Framework-Configuration"]},{"SimCorpReference":"D-87159","ChangeNote":"Target exposures and portfolio currency files shoulb be creaated only with version 2 and not with version 1 when running Axioma Batch Job.","Products":["Business-Risk"]},{"SimCorpReference":"D-87005","ChangeNote":"In some special cases when using the \u0027Pricing Method\u0027 \u0027From Key ratio calculation\u0027 and in case a \u0027Key Ratio Mapping\u0027 having \u0027Exclude from\u0027 son the \u0027Key Ratio Mapping\u0027 set to \u0027Portfolio Calculation\u0027 this setting was wrongly ignored. This has been fixed.","Products":["MarketData"]},{"SimCorpReference":"D-86329","ChangeNote":"The \u0022Price compensation\u0022 fund event did not work, when a multi-class fund invested in a pool fund. The error has been corrected.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-84583","ChangeNote":"A client specific change for loading of transactions in the portfolio calculation running on a period closure framework.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-85376","ChangeNote":"The cash effect from the commodity leg of the futures’ maturity transaction must be accounted for in the forecast cash flow service. The administrative transactions for particular holdings, which are already registered in the system should be saved into the \u0027Forecast Cash Flow - Payments\u0027 table. The instrument type for the commodity is added to the list where CP and CD already are present.","Products":["Business-CashManagement"]},{"SimCorpReference":"D-86844","ChangeNote":"Fixed an error that prevented a user from manually deleting compliance list limits when the option \u0022Keep limits when a list element is removed\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87019","ChangeNote":"Using \u0027Investment structure (oldest)\u0027 together with \u0027Is null\u0027 or \u0027Not null\u0027 didn\u0027t work. This has been corrected.","Products":["Framework-Search"]},{"SimCorpReference":"S-193965","ChangeNote":"As a user I can Allocate equity orders using Allocate form in the Web UI"},{"SimCorpReference":"D-86909","ChangeNote":"Customer-specific fix for a customer-specific issue.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-86892","ChangeNote":"Internal changes for the Collateral tests"},{"SimCorpReference":"D-85860","ChangeNote":"Webrequestcustom throws an exception when the exception message is empty, even though the getErrorResponse attribute is set to true.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-84768","ChangeNote":"Some warning messages got lost due to a recent necessary code change. Now, the behavior for multiple CA events per days should be restored by using different approach.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86942","ChangeNote":"This change fixes a crash of developer tool in external installation. No impact on business functionality.","Products":["Tools-DyalogSession"]},{"SimCorpReference":"D-86947","ChangeNote":"Fix Delete operation in PositionUniverse transporter","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"S-191510","ChangeNote":"Improve code quality","Products":["Business-AdministrativeSecurityTransactions","Business-CorporateActions"]},{"SimCorpReference":"D-86308","ChangeNote":"A fix for side effects caused by another defect that prevents unnecessary post change actions in the window \u0027Maturity Fx Outrights\u0027","Products":["Business-Transactions"]},{"SimCorpReference":"D-86717","ChangeNote":"When closing a TRS holdings in some special cases the \u0027Accrued interest QC/PC was not 0. This has been fixed.","Products":["Business-SystematicAdjustments"]},{"SimCorpReference":"D-81742","ChangeNote":"Changes to the CCDSWAPS table were not always broadcasted to the rest of the SCD One. The error has been fixed.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86803","ChangeNote":"Fix ORA crash in compliance cleanup when there is so much data to be deleted that it is split in chunks","Products":["Business-Compliance"]},{"SimCorpReference":"D-86949","ChangeNote":"Fix folder path","Products":["CsCode-Framework","CsCode-MiddleOffice"]},{"SimCorpReference":"D-87055","ChangeNote":"The transaction generation engine should filter away planned credit events that lie before or on the position’s FROMDATE.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-86198","ChangeNote":"Fix hanging loading in treelist"},{"SimCorpReference":"D-86641","ChangeNote":"Redemption transactions is not visible in the Cash Viewer applet when the Expected Payment Date is shifted on today and historical mode is turned off. This has now been corrected.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86652","ChangeNote":"Fixed issue with deleting/modifying private debt transaction with payments","Products":["Business-Cash"]},{"SimCorpReference":"D-86845","ChangeNote":"Sensitive NetRootDirectory and oauth parameters have been removed from telemetry log.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-86897","ChangeNote":"Fix  crash for OneLib convertible bonds in Risk","Products":["Valuation"]},{"SimCorpReference":"D-86330","ChangeNote":"A database error occurred when getting dependencies for a segment using the NAIC field. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-86487","ChangeNote":"Fixed an issue in the portfolio calculation, where a missing holding of a loan facility, would abort the whole of the calculation.","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-86238","ChangeNote":"Prevent crash when delta vectors are not available","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86815","ChangeNote":"Added logging information to provide more information when crash happens","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86563","ChangeNote":"The recalculation of current values and settlement amounts should not be triggered for irrelevant field changes in the truGen or truCostPstChg environment for transactions native to the window Exercise Options.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-86852","ChangeNote":"N/A: Disabling Internal integration tests","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-196262","ChangeNote":"Remove data selection changed event send to MT, since it\u0027s not needed anymore","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86747","ChangeNote":"The data cleanup service only deleted performance counter data once a month, even if the performance counter table wasn’t partitioned. This has been corrected.\n\nIf the table is partitioned data will be deleted once a month (drop partition).\nIf the table is not partitioned data will be deleted daily.","Products":["Business-Services"]},{"SimCorpReference":"D-86794","ChangeNote":"Dependencies for entries of type MOCALCMAN_OPTIOINS was missing. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-86754","ChangeNote":"Re-implemented validation in Loan Facilities to restrict changes in events transactions for which have been created already","Products":["Business-PrivateDebt","PrivateDebtStaticData","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-86776","ChangeNote":"Disable TM authorization framework for API instruments and adjusted CalcAdjustedCDSINdexAllocations","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-86902","ChangeNote":"It was not possible to stream to New UI in German installations.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86643","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86923","ChangeNote":"Remove FAP validation, client specific","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-86839","ChangeNote":"scd.exe -batch=\u003Cbatch job name\u003E -ba_queue=\u003Cbatch queue name\u003E -wait is now responding back when the job actual has finished  for long running batch job.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-86940","ChangeNote":"Reduce the risk for database deadlocks during unit tests.","Products":["Framework-Batch"]},{"SimCorpReference":"D-86713","ChangeNote":"DWH: Fixed \u0022Exception of type ApplicationException was thrown\u0022","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-86931","ChangeNote":"[TECHNICAL/3T] restored help functions still used in commands","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-86965","ChangeNote":"Fixed OTC web API tests. Changes do not affect any customer installations.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-86341","ChangeNote":"Handling cases where election data for the same CA notification is updated and calculated simultaneously by several users/processes.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86008","ChangeNote":"ABS accounting values (book values / unrealised P/L) were wrong when simulating in the Asset Manager.  This has now been corrected.","Products":["Business-PortfolioManagement","Business-Transactions"]},{"SimCorpReference":"D-86785","ChangeNote":"Technical 3T","Products":["CsCode-Framework","Framework-ApplicationFramework","Framework-CoreFramework","Framework-GuiFramework"]},{"SimCorpReference":"D-86806","ChangeNote":"Making market data validation set up consistent with schedule.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-86637","ChangeNote":"Fixed the re-initialization of auxillary jobs when deleting reporting pool records","Products":["Business-ReportingPool"]},{"SimCorpReference":"D-86870","ChangeNote":"Remove unit test formulas from the client\u0027s installation.","Products":["XpressInstruments"]},{"SimCorpReference":"D-86632","ChangeNote":"Fixing binding issue, fix has been patched into 25,04 and 25,07 as well","Products":["CsCode-UP"]},{"SimCorpReference":"D-86799","ChangeNote":"Fixed issue with slow performing query that read ratings data.  This could lead to a slow startup of the Asset Manager","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86623","ChangeNote":"Client specific change: Changed error, when reversing a payment with PCL records using the STP/Batch Job, into a warning.","Products":["Business-GeneralLedger"]}]