[{"SimCorpReference":"D-74591","ChangeNote":"Fix for expand/collapse user specific settings in AM Data selector applet","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-78052","ChangeNote":"Re-enabled virtualization for the allocation grid and optimized place window performance"},{"SimCorpReference":"D-78506","ChangeNote":"The fix reduces significantly probability of Crash on Auto-calc PFC services in case of deleting active Front office PFC copies. The fix adds an additional check that PFC copy still exists just before attempt to enqueue it for Front Office Holding service processing.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-77125","ChangeNote":"Risk Measurement: Replace Dirty value with Exposure for Risk Position calculation in case of imported sensitivity for Futures/Warrant/Covered Warrant/Option/Option-OTC","Products":["Business-Risk"]},{"SimCorpReference":"D-78161","ChangeNote":"retrofit to 24.10 of 2 BreakID-related Stories.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-78642","Products":["Framework-CoreFramework","Framework-GuiFramework"]},{"SimCorpReference":"S-176103","ChangeNote":"The Add New adjustment type on adjustments on Basket TRS instruments can now be created with a zero price and zero nominal amounts,","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-78156","ChangeNote":"Technical - 3T","Products":["CsCode-Framework"]},{"SimCorpReference":"D-78559","ChangeNote":"Ensure maturity field on deposits form is not too large.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-77810","ChangeNote":"Fix for - If there are active Unsolicited executions in the system, after running daily maintenance Automation service fails to process any further requests. Fixed now"},{"SimCorpReference":"D-78505","ChangeNote":"Bond orders quoted on Yield are now executed via file correctly and without errors"},{"SimCorpReference":"D-77703","ChangeNote":"The value based order should become complete if finished within the threshold."},{"SimCorpReference":"D-78009","ChangeNote":"There was an error in the validation logic for AU CGT Transaction matches. It was possible to match more than available nominal for a particular pair of Buy and Sell. Now this error is fixed.","Products":["Business-AustralianCgt"]},{"SimCorpReference":"D-78465","ChangeNote":"User can\u0027t change layout due to confimration pop up. The issue is found in 24.10","Products":["CsCode-Framework"]},{"SimCorpReference":"D-77975","ChangeNote":"A technical change has been made to  the Performance Measurement execution flow to make calculations of type GIPS and GIPS single composite faster.","Products":["Performance"]},{"SimCorpReference":"D-76824","ChangeNote":"Correct the validations while doing fills import in the classic Order Manager architecture."},{"SimCorpReference":"D-78396","ChangeNote":"Fixed a crash that happened when AM was start - before data was loaded.  Related to UI indication of whether local data is used (for FX rate fields)","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-78558","ChangeNote":"User can select empty authorization profile from the list. The issue is found in 24.10","Products":["CsCode-Framework"]},{"SimCorpReference":"D-77966","ChangeNote":"DDA balance amount now takes the sign of Balance nominal entries into account rather than shows the sum of absolute values.","Products":["Business-Transactions"]},{"SimCorpReference":"D-77858","ChangeNote":"Set Nominal and Security Direction for Transaction-Payments Netting","Products":["Business-Netting"]},{"SimCorpReference":"D-78464","ChangeNote":"Fixes on D-77159 and D-78140 are patched to 24.10","Products":["Framework-ApplicationFramework","Framework-GuiFramework"]},{"SimCorpReference":"S-175850","ChangeNote":"The CODEOWNERS file has been updated to declare team K2 as codeowners of related code on SimHub/IMS"},{"SimCorpReference":"D-78471","ChangeNote":"Sub-forms on dealer forms sometimes executed buffer operations incompatible with the 3T data layer. The code has been adjusted to make them compatible.","Products":["Business-Transactions","Framework-ApplicationFramework","Framework-InternalApplicationFramework"]},{"SimCorpReference":"D-78403","ChangeNote":"3T - Technical","Products":["CsCode-Framework"]},{"SimCorpReference":"D-78408","ChangeNote":"In some cases, a crash occurred in connection with showing a message that is not associated with a window.","Products":["Framework-InternalGuiFramework"]},{"SimCorpReference":"D-77148","ChangeNote":"After this change Cash viewer settings  are not automatically saved on AM exit. These setting are saved together with AM setup save","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-78393","ChangeNote":"Plain oracle error is shown instead of a user friendly message.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-78088","ChangeNote":"D-78088: The dividend reset transactions should not be affected by the ‘Use last known rates’ functionality. Paying out the proceed through the reset transaction does not require any rates to be fetched. A correction is made for TR swap type ‘Equity’.","Products":["Business-AdministrativeOTCTransactions","Business-AdministrativeSecurityTransactions","Business-Transactions"]},{"SimCorpReference":"D-78476","ChangeNote":"Technical - 3T","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-78461","ChangeNote":"Adjusted some field sizes for the web client.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-77163","ChangeNote":"Technical - 3T","Products":["Business-FundAccounting","Framework-Batch","Framework-GuiFramework","Tools"]},{"SimCorpReference":"D-78325","ChangeNote":"Only make FIGI API queries if OpenFIGIRequest command is enabled","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-78044","ChangeNote":"Fixing days are now used to calculate Payment date in the Special close out - Futures window. This is necessary because otherwise a wrong Payment date can prevent transactions from being saved.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78243","ChangeNote":"he issue is fixed. The discount curve for the receive leg is fetched properly according to the note in description.","Products":["Business-Risk"]},{"SimCorpReference":"D-78205","ChangeNote":"The import menu in the alternative investments manager were not restricted correct leading to missing functionality in some cases.\nA fix has been implemented so the import menu is now restricted correct according to the installed functionality in the installation.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-78388","ChangeNote":"Fixed issue with access to checkboxes for the permissions of users for setups.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-78398","ChangeNote":"Fixed crash that was happening on opening status popup form in 3T lifted application. 3T. Web UC","Products":["CsCode-UP"]},{"SimCorpReference":"D-77899","ChangeNote":"When matching a \u0027US MBS  Pools\u0027 and a relevant pool factor was  added the transaction was updated wrongly such that the new pool factor was taken. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78263","Products":["Business-DEX"]},{"SimCorpReference":"D-76989","ChangeNote":"Added a service checker that will force the service to restart should it enter an unrecoverable deadlock","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-78133","ChangeNote":"Carry through the Force flag to allow Fill to be included in allocation"},{"SimCorpReference":"D-78212","ChangeNote":"No impact for clients.","Products":["Business-InternationalAccountingStandard"]},{"SimCorpReference":"D-77968","ChangeNote":"It should not no longer be possible to delete Australian CGT matched transactions (typically a sell) before the Australian CGT matching has first been deleted.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78123","ChangeNote":"Excluded sequence number field from list of fields for XMGR for Reconciliation Manager setup","Products":["Reconciliation"]},{"SimCorpReference":"D-78100","ChangeNote":"Making EOY update Restitution expected balances \u002B auto tests creation","Products":["Business-TaxAccounting","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-78225","ChangeNote":"A program error occurred if the user id \u002B simcorp id was longer than 20 characters. This has been corrected.","Products":["Framework-ApplicationBusiness"]},{"SimCorpReference":"D-77528","ChangeNote":"the fields on CA dashboard were not populated, this was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77539","ChangeNote":"This regards the STP match flow. Changes in amounts in QC must trigger a recalculation of GCA values.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78180","ChangeNote":"The tool \u0022tutExtRphRollBackRule\u0022 fails if the nominal PCL frameworks are not installed. This tool is only used by developers to roll back a rule in a PCL definition. The error has been corrected on this defect.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-78015","ChangeNote":"An error could occur when creating \u0027Payments\u0027 i the \u0027Reconciliation Manager\u0027 in case more than one payment instructions were to be reconciled. This has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-78126","ChangeNote":"It was not possible to modify \u0027Interest Adjustment QC/PC\u0027 in the \u0027Mathematical Adjustments\u0027 as well as the \u0027Credit Loss Allowance\u0027 window. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78128","ChangeNote":"The database load generated by the Trade Processing Dashboard service has been reduced.","Products":["Business-SettlementManager"]},{"SimCorpReference":"D-77637","ChangeNote":"Changed behavior of reversal reason, reversal reason narrative, and other code fields. From now onward they\u0027re read-only","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77677","ChangeNote":"If connection to real-time market data from Order Manager times out  we need to free-up resources and dispose any started connections"},{"SimCorpReference":"D-77240","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-78172","Products":["Business-Transactions"]},{"SimCorpReference":"S-174884","ChangeNote":"The wait-time between recalculation attempts for failed front office portfolio calculations has been made configurable. It can be set in the \u0022Service Options\u0022 window in the \u0022Automatic Recalculation of Portfolio Calculations\u0022 tab with the new \u0022Minimum wait-time between recalculation attempts (seconds)\u0022 parameter. Default is 20 seconds. The specified number of seconds is used as the wait-time before running the first recalculation attempt. And if this also fails, then the wait-time is doubled before running the second and last recalculation attempt.","Products":["Business-PortfolioCalculation","Framework-Configuration"]},{"SimCorpReference":"D-75305","ChangeNote":"Raise warning only for database applications","Products":["Performance"]},{"SimCorpReference":"D-78111","ChangeNote":"The Benchmark Calculation - Upload Results batch job creates a file with SAAM target weights. The condition that is used when reading the SAAM target weights was missing a condition on the mandate definition type. This is needed since the underlying table is used for storing both Strategic Asset Allocation and Mandate definitions and Tactical Asset Allocation definitions. The missing condition on the mandate definition type has been added.","Products":["Performance"]},{"SimCorpReference":"D-77933","ChangeNote":"Auto-allocate should only allocate fills that are allocatable"},{"SimCorpReference":"S-173846"},{"SimCorpReference":"D-76810","ChangeNote":"Correction in calculation of Notice Date when current trade date is a Bank Holiday","Products":["Business-FrontOfficeData","Business-PortfolioManagement"]},{"SimCorpReference":"D-78072","ChangeNote":"The CLEANUPUNREFQUEUE table kept growing. This happened if ‘Cleanup unreferenced price search’ was executed, and more unreferenced price search records than could be handled in one go were found (for most installations this happened if more than 30,000,000 unreferenced prices searches were found). This has been corrected.","Products":["Framework-Database"]},{"SimCorpReference":"D-75306","ChangeNote":"Client specific patch. Related to spot calculation for decomposed IRFs","Products":["Performance"]},{"SimCorpReference":"D-77947","ChangeNote":"Fixed issue when some fields in results applet of recon manager where not refreshed.","Products":["Reconciliation"]},{"SimCorpReference":"D-77667","ChangeNote":"Balance unpaid commitment and Total commitment were not calculated for unit based alternative investments securities in the Performance calculation. The error has been corrected.","Products":["Performance"]},{"SimCorpReference":"S-174886","ChangeNote":"For XpressInstruments, allow American options where the first exercise date is equal to the last exercise date in the internal representation.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-78067","ChangeNote":"Fix the issue when Inventory Load batch job is unable to find prices","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-77967","ChangeNote":"The portfolio calculation could fail with the \u0022Missing data from table tHOLDINGMATCH.\u0022 error message, when the portfolio calculation simulated mathematical adjustments for FRNs with put/calls. The error could occur when the real transactions of the same positions were e.g. raised in status at the same time. The error has been corrected.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-77872","ChangeNote":"Fixed error in Explain Calculation for indexed zero bonds","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-77708","ChangeNote":"We are reverting back to decomposing convertible bonds into their underlying in Global exposure rules, instead of reflecting the value of the underlying in Initial exposure on the conv. bond position itself.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76568","ChangeNote":"The period closure check will now accept deviations that are equal to or less than 0.0009 for the following fields:\nBalance nominal at last cp/period\nBalance nominal at last period\nBalance nominal/number\nBalance current face value\n\nThe limit was 0.0001 before this change.","Products":["Business-PeriodClosure"]},{"SimCorpReference":"D-77294","ChangeNote":"Incorrect Balance nominal/number, Dirty value, and Market value was gotten for cash buckets in the closed period of a Performance Calculation running on a period closure accounting framework for deposit/withdrawal transactions having the transaction cancellation flag \u0022Cancelled (Period closure)\u0022 or \u0022Reversed by system (Period closure)\u0022. This has been resolved.","Products":["Business-Cash"]},{"SimCorpReference":"D-77387","ChangeNote":"Asset Manager Asset Allocation Applet update issue was fixed.","CustomerApplyNote":"Issue with cash effect of simulation when modified disappears in asset allocation applet is fixed","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77972","ChangeNote":"Fixed performance hotspot for allocated block orders"},{"SimCorpReference":"D-76663","ChangeNote":"Lock in share mode Source tables for Base Marts during the execution to avoid ORA-08103","Products":["Business-DEX","CsCode-Reporting"]},{"SimCorpReference":"D-76658","ChangeNote":"Fixes the issue with deleted data source mappings on Partial Deploy","Products":["Business-DWH"]},{"SimCorpReference":"S-174407","ChangeNote":"Customer specific interface. This will not affect other customers.","Products":["Business-Connectivity","Framework-Batch"]},{"SimCorpReference":"D-77517","ChangeNote":"PFC error Program error (#.trGenEod_Data_divi[293]) has been fixed","Products":["Business-AdministrativeOTCTransactions","Business-CorporateActions","Business-Transactions"]},{"SimCorpReference":"D-77821","ChangeNote":"Increase the length of \u0022User groups for trading limits\u0022 to 200","Products":["Business-Compliance"]},{"SimCorpReference":"D-76746","ChangeNote":"Due to more transaction fields in View Transactions the performance of this window might decrease with many data in the database. This has been improved so far it is possible.","Products":["Business-Transactions"]},{"SimCorpReference":"D-77042","ChangeNote":"Ensuring that the graph control has a minimum size allowing MSAGL to create the graph.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-77723","ChangeNote":"The Post-trade rule setting \u0022Only fail on active trades\u0022 used to have an effect in pre-trade validations. It should not, and this has now been changed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77579","ChangeNote":"Added the Leg Alloc Reg Trade ID Group  and Offshore Indicator tags to the FIX dictionary"},{"SimCorpReference":"D-77622","ChangeNote":"Remaining notional payments are generated and scaled for cap and floor components of structured products","Products":["Business-PortfolioCalculation","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"S-173540","ChangeNote":"added camt.053.001, camt.029.001 and trck.001.001 to the parameters for switft mx. In auxiliary message types trck.001, camt.053, camt.029 and admi.002 has corrected names","Products":["Business-AuxJobFramework","Business-Match","Business-Swift"]},{"SimCorpReference":"D-77873","ChangeNote":"ESG NFRD FlexAnalytics. In case of partly missing data the calculation of KPI 27/28 was wrong. This has been corrected.","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-77855","ChangeNote":"When creating a \u0027Bond Forward\u0027 transaction with a \u0027Maturity Date\u0027 that is in the relevant \u0027Calendar\u0027 defined as \u0027Irregular Holiday\u0027 no according warning was issued even though the according \u0027Transaction Option\u0027 was set. This has been fixed.","Products":["Business-DealerOTCTransactions","Business-Transactions"]},{"SimCorpReference":"D-77470","ChangeNote":"Fixed crash happening for bonds with irregular zero redemption payments.","Products":["Valuation","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-77640","ChangeNote":"When calculating risk based on MSCI including \u0027Break even inflation swaps\u0027 an error could occur. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-77449","ChangeNote":"The Amend and Enter manual fill menus should not be available for NOMA placements netted with broker"},{"SimCorpReference":"D-77330","ChangeNote":"Fix unchecked exception when splitter is out of range"},{"SimCorpReference":"D-77841","ChangeNote":"It was not possible to import TRASTATJOB\u0027s via the configuration manager, as the validation require a number of jobs to be present present before validation. This has been corrected.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-77659","ChangeNote":"The CDL commands regexmatch and regexreplace got a new optional parameter, in which the user can specify the desired timeout. If the parameter is omitted, one second is used, just as before.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-77401","ChangeNote":"Fix position specification creation due to holdings benchmark number","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-77633","ChangeNote":"\u0022Search Unauthorised Tasks and commands\u0022 showed unreachable menu items as \u0027unauthorised\u0027. this has been corrected.","Products":["Framework-Authorisation","Framework-CoreFramework"]},{"SimCorpReference":"D-77802","ChangeNote":"This is a customer specific change which will not affect other customers.","Products":["Framework-Common"]},{"SimCorpReference":"S-174301","ChangeNote":"Correction to stand-alone XpressInstrument file delivery\n\nCorrection to mechanism for delivering standalone XpressInstruments to customers.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-77727","ChangeNote":"When user presses \u0027Select Match Definition\u0027 button in \u0027Match\u0027 screen (\u0027Setups\u0027 tab) and  click \u0027Cancel\u0027, then selected view(including selected fields on Confirmations/Transactions\u0027 tab) could be reset. This error has been fixed.","Products":["Business-InvestmentOperations"]},{"SimCorpReference":"D-77801","ChangeNote":"When user opens  \u0027Match\u0027 screen from dashboards (Match widget), then  existing appearance settings are not applied. This error has been fixed.","Products":["Business-Match","Business-SettlementManager"]},{"SimCorpReference":"D-76967","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-77062","ChangeNote":"The interest payments for Affiliate Debt Call Money instruments will now take the value of the Round coupon rate (decimals) in the Fixings sub-screen correctly into account.","Products":["Business-Cash","Valuation"]},{"SimCorpReference":"D-76741","ChangeNote":"Increased the timeout for initializing formulas in the Trade Manager.","Products":["XpressInstruments"]},{"SimCorpReference":"D-77775","ChangeNote":"The \u0022Cleanup Front Office Calculation Copies\u0022 batch job was not allowed to use the current day or later as \u0022To date\u0022. If it was set-up to use such a date, then the batch job just changed the \u0022To date\u0022 to the day before current day. This behavior has  now been changed and it is allowed to use current day or later as \u0022To date\u0022.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-77744","ChangeNote":"We have identified a gap in the ME deployment, so this issue will be delt with when ME has found a solution to the deploy problem","Products":["CsCode-Framework"]},{"SimCorpReference":"S-174212","ChangeNote":"Ignore irrelevant fixings or decisions  for XpressInstruments.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-77116","ChangeNote":"Fixed an issue in Realtime Infrastructure service that caused certain requests to cause a re-read of data from the db.  This could lead to the service being more busy than necessary","Products":["CsCode-RealTime"]},{"SimCorpReference":"D-77751","ChangeNote":"For relative limits rules, an online result will be an amount type, if either numerator or denominator is an amount measure.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77588","ChangeNote":"Incorrect Proceeds transactions were generated in single screen for TRS Basket in case when two or more proceeds had the same date. That has been fixed now.","Products":["Business-Transactions"]},{"SimCorpReference":"D-77438","ChangeNote":"Fixing a rare occurring issue that caused a crash when a user-written formula was used in the Hedge Ratio Defition","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77385","ChangeNote":"In some cases Communication server with \u003CDatabase\u003E port would crash on startup with \u0022ConnectionString is invalid\u0022, this was fixed.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-76425","ChangeNote":"Added specific error concerning missing holding dates when running the PFC to the Automatic Recalculation of Portfolio Calculation Service logic.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-76590","Products":["Business-Risk"]},{"SimCorpReference":"D-77381","ChangeNote":"Fix issues with upload/download to sub folders of logical folders","Products":["CsCode-UP","Framework-Configuration"]},{"SimCorpReference":"D-77425","ChangeNote":"Broker is no longer automatically predefined after quantity is changed on multi-place window."},{"SimCorpReference":"D-77013","ChangeNote":"Fixed generation of daily cashflow for yield used in mathematical adjustment for bonds with redemption on non-coupon dates and bonds with zero coupon payments.","Products":["Business-SystematicAdjustments","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-77494","ChangeNote":"Fixed a rare occurring crash that happened if a layout contained formulas and graphs that were based on UDKRs","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77532","ChangeNote":"Receiving compliance results now updates last updated timestamp on placements"},{"SimCorpReference":"S-174078","ChangeNote":"An Rounding rule internal key of zero was not always a valid value for Accrued interest rounding rule of OIS like swap legs. The error has been fixed.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-77509","ChangeNote":"The trace functionality in the portfolio calculation has been expanded to log trace information for the \u0022Missing data from table HOLDINGMATCH\u0022 error message types. It is enabled in the \u0022Trace\u0022 sub-window of the portfolio calculation; or in the \u0022Calculations\u0022 page of the Miscellaneous options.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-77411","ChangeNote":"Program placements are now compliance-validated together when placed to different brokers"},{"SimCorpReference":"D-77059","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-77397","ChangeNote":"CA Dashboard: ORA-01628 max # extents reached for rollback segment. Was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77690"},{"SimCorpReference":"D-77113"},{"SimCorpReference":"D-77520","ChangeNote":"Corrects incorrect Portfolio calculation cash flow for ABSs having a Bullet structure, when using a Maturity convention.","Products":["Valuation"]},{"SimCorpReference":"D-77536","ChangeNote":"It allows user to create additional instruments at external client trade windows","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77571","ChangeNote":"The portfolio calculation could fail with the \u0022Missing data from table tHOLDINGMATCH.\u0022 error message, when the portfolio calculation simulated credit loss allowance and end-of-period adjustment transactions using the NAIC functionality.  The error could occur when the real transactions of the same positions were e.g. raised in status at the same time. The error has been corrected. Additionally, the waiting time for the recalculation logic in the front office portfolio calculations has been increased to 20 and 40 seconds for the two recalculation attempts.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-77135","ChangeNote":"Some pre trade results indirectly or potentially affected by a simulation or an order was not available to see. This is now fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77569"},{"SimCorpReference":"D-77374","ChangeNote":"Data Clean-up service crashes with ORA-02292 in compliance cleanup","Products":["Business-Compliance"]},{"SimCorpReference":"D-77394","ChangeNote":"For prevention of db referenced error the number of nodes ik in one loop was increased from 10k to 50k","Products":["Business-Risk"]},{"SimCorpReference":"D-74324","ChangeNote":"Fill Payment Date and Security ID in alert","CustomerApplyNote":"Add Security ID and Payment Data to TPD alerts","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-77238","ChangeNote":"Fix position scope at PS if we modify simulation for holding with Bm \u002B Bm2 position scope","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76614","ChangeNote":"Fixed an error in the Asset Manager, where the position sign of historical model portfolio and benchmark positions was wrong.","Products":["Benchmarks","Business-Modelling","CsCode-FrontOfficeData","CsCode-MiddleOffice"]},{"SimCorpReference":"D-77019","ChangeNote":"Do not ignore rebase factors for XpressInstruments and OTC","Products":["MarketData","TradeManager","Valuation","XpressInstruments","CsCode-AltInv"]},{"SimCorpReference":"D-77434"},{"SimCorpReference":"D-77523","Products":["Business-Cash"]},{"SimCorpReference":"D-77089","ChangeNote":"An error could occur when creating \u0027Payments\u0027 i the \u0027Reconciliation Manager\u0027 in case more than one payment instructions were to be reconciled. This has been fixed.","Products":["Business-Cash","Business-Reconciliation"]},{"SimCorpReference":"D-77030","ChangeNote":"An error could occur in the \u0027Covariance Manager\u0027 in case \u0027Merger\u0027 \u0027Corporate Actions\u0027 existed for at least one of the by the \u0027Risk Factor\u0027 implied securities. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-77320","ChangeNote":"Allocation defaults data sent via AzSB does not contain allocation defaults for Securities lending SCD instrument type which is interpreted as Repo on OM side. This change should fix this and such allocation defaults should be sent."},{"SimCorpReference":"D-75743","ChangeNote":"Support SCD System Variables for the Export folder path pre-saved on Party setup."},{"SimCorpReference":"D-77251","ChangeNote":"Exclude orders with cancelled allocation from being aggregation targets"},{"SimCorpReference":"D-77123","ChangeNote":"An error could occur when trying to load a bond having \u0027Fixings\u0027 and a \u0027Reference rate\u0027 with  \u0027Rate convention\u0027 \u0027Par yield\u0027 into the  \u0027Edit Multiple Securities - Bonds\u0027  window. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-74313","ChangeNote":"Highlighting \u0026 Go to Order function in Order Manager now works properly for classic orders too"},{"SimCorpReference":"S-165972","ChangeNote":"NA"},{"SimCorpReference":"D-76374","ChangeNote":"Adjustment factor might be updated when doing data import to External Cash Flow window","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-76960","ChangeNote":"timestamp in om3_de_orders is updated after an order is parked"},{"SimCorpReference":"D-76816","ChangeNote":"The performance for creating OIS fixings has been improved.","Products":["StaticData"]},{"SimCorpReference":"D-77171","ChangeNote":"It is now possible to set the reference Rate Convention to Par yield for other instruments than MIT bonds if the Fixing Frequency results in a longer period than the period for the Payment Frequency. Previously this was not possible as an error message would be issued telling “The reference rate convention for this reference rate cannot be PARYIELD when adjusting fixing frequency is set.","Products":["StaticData"]},{"SimCorpReference":"D-76934","ChangeNote":"Fixed a system performance issue in Compliance that can occur if a lot of “Pool to Portfolio” mappings exist.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77003","ChangeNote":"Upgrade RestSharp from 108.0.3 -  to version RestSharp - 112.0.0","Products":["CsCode-Collateral","CsCode-Compliance","CsCode-DataWarehouse","CsCode-Framework","CsCode-IBOR","Instruments","Mandates","CsCode-MiddleOffice","CsCode-PortfolioManagement","CorporateActions","Reconciliation","CsCode-Trading","CsCode-UP"]},{"SimCorpReference":"D-76998","ChangeNote":"Availability of \u0022Full risk analytics details\u0022 in Rule entry now affected by risk measures inside formulas","Products":["CsCode-Compliance","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-77295","ChangeNote":"During the performance calculation upload results batch job, there was a problem that we were searching for pEXPCOMPTYPE in tHOLKEYS which does not exist in that table. This only happened in certain cases. Now we look in tPERFORMCALC instead","Products":["Performance"]},{"SimCorpReference":"D-76637","ChangeNote":"This change corrects a possible error in the  Performance Calculation in the calculation of the TWR based FIPA local return that could occur at maturity for swaps.","Products":["Performance"]},{"SimCorpReference":"D-77140","ChangeNote":"In Rule Entry, properties which usually require an input dialog, such as ISIN or CUSIP, should pop up a selection list, when used with a List or External List. This had stopped working, but has now been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77199","ChangeNote":"NA","Products":["Business-DWH"]},{"SimCorpReference":"D-77075","ChangeNote":"Incorrect reinvestment service url retrieved in some installations. Fixed","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"S-172540","ChangeNote":"Internal codebase refactoring. Fixed the code to improve all OTC instruments. Changes made to the code do not affect system behaviour.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-77076","ChangeNote":"Added retry on delete of APL core form temporary file.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76966","ChangeNote":"Fix is to allow user to import Funds Certificates when Settlement Days value is null (Ext Settlement Days is not checked)","Products":["StaticData"]},{"SimCorpReference":"D-77209","ChangeNote":"Technical - 3T","Products":["CsCode-Framework"]},{"SimCorpReference":"D-77244","ChangeNote":"Performance improvement","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76587","ChangeNote":"Validating data for Database parameters","Products":["CsCode-UP"]},{"SimCorpReference":"D-76877","ChangeNote":"Optimizations that will speedup a Simulation Macro that uses UDKR\u0027s.  Will also generally improve the Portfolio Sheet if it contains UDKRs","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77091","ChangeNote":"CA Dashboard can crash with ORA-01628 max # extents reached for rollback segment. Was Fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77174"},{"SimCorpReference":"D-77220","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77018","ChangeNote":"It decreases memory consumption at AM in case when we have Bm \u002B Bm2 positions scope only","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76759","ChangeNote":"Fixed problem when we can not use .NET formulas argument name like \u0022Issuer\u0022","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76991","ChangeNote":"\u0027Rounding Rules\u0027 with \u0027Field to be rounded\u0027 set to \u0027Nominal redemption\u0027 did not work anymore. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-77120","ChangeNote":"In installations with enforced portfolio master, the Online compliance applets don\u0027t show any results because of wrongly evaluated auth. on the Online service. This has been fixed.","Products":["CsCode-Basic","CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76963","ChangeNote":"In a very specific case, a placement on an aggregated order, where part of the bundle required override and compliance override, and the other did not required any override, the bundle status was blocked, so that the placement could not proceed after all overrides were complete and accepted. This has now been resolved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77164","ChangeNote":"There was an error in Benchmark Calculation when executing the type \u0027Update Index/Benchmark using Segment\u0027. The indexes in the benchmark segment was not correctly identified. The error has been corrected.","Products":["Benchmarks"]},{"SimCorpReference":"D-76657","ChangeNote":"Four eye validation would wrongly alert about a change to the transaction - the  solution was to make all necessary data available for the validation to avoid this.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions"]},{"SimCorpReference":"D-77107","ChangeNote":"Fixed a failing DWH Partial Deploy when a target DWH Model didn\u0027t have a schema applied.","Products":["Business-DEX","Business-DWH"]},{"SimCorpReference":"D-75667","Products":["CsCode-MiddleOffice","CsCode-RiskManagement"]},{"SimCorpReference":"D-76900","ChangeNote":"Corrected flaky tests","CustomerApplyNote":"Corrected flaky tests, no action needed","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-76871","ChangeNote":"The userts tablespace is no longer checked and verified during update."},{"SimCorpReference":"D-76669","ChangeNote":"Fixed second benchmark status message and tooltip in case when first benchmark is missing.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77035","ChangeNote":"Field \u0027line\u0027 on reconciliations applet of reconciliation manager was opened by mistake. Now it is closed again","Products":["Reconciliation"]},{"SimCorpReference":"D-76790","ChangeNote":"NA","Products":["Business-Tapi","Business-ToolsTransactions","CsCode-Transaction"]},{"SimCorpReference":"D-76826","ChangeNote":"When using the \u0027Price method\u0027 \u0027Quoted price \u002B yield curve, structured products\u0027 and having \u0027Use auxiliary market data\u0027 checked in the relevant \u0027Pricing Definition\u0027 line the valuation with this \u0027Pricing method\u0027 erroneously failed in case no \u0027Conv. Adj. vol. curve\u0027 was defined on the relevant \u0027Bond\u0027.","Products":["MarketData"]},{"SimCorpReference":"D-77026","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"S-171219","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76577","ChangeNote":"correcting the validation criteria","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76323","ChangeNote":"This is a client specific fix for a client to address rounding issues","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-76215","ChangeNote":"Enabling calculation of accrued interest, dirty and clean prices for structured bonds that have such high quote that spread calculation is impossible. Applies to pricing of structured bonds with Quoted price \u002B yield curve, structured products pricing method.","Products":["Valuation"]},{"SimCorpReference":"D-77029","ChangeNote":"CA Dashboard service in case having more than 10K publication might crash on Oracle by updating the data. Was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"S-140803","ChangeNote":"The database load generated by the Trade Processing Dashboard service has been reduced.","Products":["Business-SettlementManager","Framework-Database"]},{"SimCorpReference":"D-76750","ChangeNote":"Fix problems with Collateral RVP. RVP was broken by failed try to exclude API tests from it."},{"SimCorpReference":"D-76500","ChangeNote":"The not so useful telemetry information has been removed to avoid spamming.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-75815","ChangeNote":"Fixed an error where the Portfolio/Fund Administration Manager in the Alarms Inbox Applet would not restrict shown alarms based on the corresponding setup in the Setup Applet.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77017","ChangeNote":"Fixing crash in Yield curve manager that occurs when estimating curve that has several standard contracts with identical maturity dates.","Products":["MarketData"]},{"SimCorpReference":"D-76569","ChangeNote":"With tax buckets, the match calculation, when booking the sell, is done in a different function than usual fifo or lifo.\n Tax bucket was missing a piece of code that prevents errors due to double floating arithmetic issues","Products":["Business-Match","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-76696","ChangeNote":"When saving a bond, it is no longer validated that the coupon and/or redemption frequency is 6M, when using the EOM Convention \u0027Last, no leap\u0027. Furthermore any anchor date can be used together with EOM Convention \u0027Last, no leap\u0027.","Products":["StaticData","Instruments"]},{"SimCorpReference":"D-76917","ChangeNote":"AxR Position Integration batch job does not support reference dates. Fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-76363","ChangeNote":"There were no CLAllow transaction created via create window for some positions when a lot was bought at par, (Put/Call price is par as well). In such case Interest Appreciation should not be calculated. However, CLA (based on factors) should be generated in this case. After this correction we continue with generation of CLA despite the fact that a lot is bought at par.","Products":["Business-SystematicAdjustments"]},{"SimCorpReference":"S-169278","ChangeNote":"Extra info of SQL logging removed just to be align with 2T file logs. But the original message will be logged on Appinsight.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76870","Products":["Tools"]},{"SimCorpReference":"D-76705","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-76962","ChangeNote":"Counterparty ID in DE_ALLOCATIONS now contains the ID not the name"},{"SimCorpReference":"D-76726","ChangeNote":"Update Equity, Futures, Options to show correct reason for not being able to aggregate"},{"SimCorpReference":"D-76720","ChangeNote":"Reducing number of calls to read scenario file, and adding more retries","Products":["Business-Risk"]},{"SimCorpReference":"S-169479","ChangeNote":"Internal. Updated version of Web UC package in SCD"},{"SimCorpReference":"D-76649","ChangeNote":"When saving a Securities Lending Maturity\u0027 \u0027MatRepo\u0027 transaction having \u0027Actual Settlement\u0027 data wrongly the error message \u0027Underlying holdings cannot be found. Try modifying the transaction instead.\u0027  could appear. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-76866","ChangeNote":"When checking the consistency of PCL holdings, the mix of positions with and without the errors led to a program crash on the step of making the error message report. Now it is fixed by aligning the length of faulty fields with the other variables.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-76957","ChangeNote":"Customer specific correction to Performance Calculation related to a special GIPS composite calculation flow.","Products":["Performance"]},{"SimCorpReference":"D-76697","ChangeNote":"The editor in CustomArgumentsEditorListwas all time in new state. As the CustomArgumentsEditorList is custom editor list, it doe not work in CRUD context. Therefore it will not be switch out from new state. In this context the editor list should be set to be not in new state after create.\n\nThis was failing as in the one value CustomArgumentsEditorList the default value was 0 and in this case IsNew was honored, which is not case in other cases when the CustomArgumentsEditorList was used.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76687","ChangeNote":"\u0022More\u0022 filter button removed for Rule Search (Beta)","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76662","ChangeNote":"Trade Manager: In some cases when FAP segment for OTC swaps contains created date of the contract, OTC swap transaction, created from Front Office simulation,  could be booked on a wrong FAP line. It has been fixed.","Products":["TradeManager"]},{"SimCorpReference":"D-76474","ChangeNote":"Refactor code surrounding building base service load info","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76485","ChangeNote":"Side effect has been fixed to ensure correct autoallocation is done when Total Collateral Result is sent for allocation","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-76765","ChangeNote":"Fix compliance validation preview on place form."},{"SimCorpReference":"D-76863","Products":["Business-Connectivity"]},{"SimCorpReference":"D-76803","ChangeNote":"Previously, if the \u0022Shows checks only for released orders\u0022 setting was checked in Front Office options, then placement validations were only shown in the pre-trade monitor if they had a pending Compliance Override request.\n\nThis has now been changed so that the setting no longer affects the display of placement validations. All placement validations are always shown in the Pre-trade monitor, regardless of whether or not they require compliance override or the above setting has been checked.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76475","ChangeNote":"Fixes for null reference","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76842"},{"SimCorpReference":"D-76616","ChangeNote":"A fix has been made to determine if an active trade indirectly affects a credit risk assignment unit, to ensure that an active transaction on a credit risk assignment unit, which creates an alert on more than one party, will now flag the alerts on all affected parties, as \u0022Active\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76431","ChangeNote":"SupportedAdditionalOperators are updated as not to have Year/Month or DaysofWeek operations for datetime fields in RecociliationResultsFilterEditorList","Products":["Reconciliation"]},{"SimCorpReference":"D-75948","ChangeNote":"The fix suggested in this defect has been reverted. A new solution has been proposed on the defect D-76662.","Products":["StaticData"]},{"SimCorpReference":"D-76933","ChangeNote":"The text of warning message was edited.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-76787","ChangeNote":"It is enable  handling application/xml and text/xml MIME types correctly,","Products":["CsCode-UP"]},{"SimCorpReference":"D-76855","ChangeNote":"Resolved test failure by overriding identity handling in a nested class to bypass domain controller dependency.","Products":["CsCode-UP"]},{"SimCorpReference":"D-76749","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-76850","ChangeNote":"This regards the ‘Securities Finance Manager’. Some database reference path for tTRANSFACILITY  was missing to an outer join condition in the code that updates the transaction data Container.","Products":["Business-SecuritiesFinanceForecast"]},{"SimCorpReference":"D-76743","ChangeNote":"Catch the exception and add telemetry log","Products":["CsCode-UP"]},{"SimCorpReference":"D-76714","ChangeNote":"A non-released error was resolved to ensure that Asset manager Cache  API job can be executed","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-170914","ChangeNote":"Patch refactoring: use better naming in code for reconciliation save results function","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-76865","ChangeNote":"Make APL unit test suite mTEST_MATCHFILTERWEEKLY more stable.","Products":["Business-Match"]},{"SimCorpReference":"D-76730","ChangeNote":"Manual placement in Working state should be cancelled individually"},{"SimCorpReference":"D-76584","ChangeNote":"Fixed, Prevent to add same sessions into the databaseSessions","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-76513","ChangeNote":"Forecasts in  the \u0027Alternative investments manager\\Strategy analysis \u0027  page based on existing positions relating from an \u0027Alternative investments - Internal trade\u0027 transaction transferring a position from one portfolio to another were wrong in the year with the transfer. The error has been corrected.","Products":["CsCode-AltInv","CsCode-MiddleOffice"]},{"SimCorpReference":"D-76629","ChangeNote":"Amend order context menu item should not be available for Placements in Draft State"},{"SimCorpReference":"D-76632","ChangeNote":"OM API service will send an error response with a timeout error type in case it cannot process a heavy request in time"},{"SimCorpReference":"D-76727","ChangeNote":"Problem importing CURCROSSES has been fixed.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-170852","ChangeNote":"Patch C# unit tests for reconciliation auto-fill functionality. No visible changes for user.","Products":["Reconciliation"]},{"SimCorpReference":"D-76857","ChangeNote":"Fix \u0027Unknown Paramter\u0027 error in Model Configuration Parameters window in Data Warehouse Manager","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-75639","ChangeNote":"Fixed bug in Oracle DataWarehouse when a basemart has hundreds of columns","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-76907","ChangeNote":"Correction of flaky tests (no code changes, done in D-76900)","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-76690","ChangeNote":"app.config is added again to the  projects instead of using Framework/app.config as a reference","Products":["CsCode-AltInv"]},{"SimCorpReference":"S-170529"},{"SimCorpReference":"D-76819","ChangeNote":"It wasn\u0027t possible to execute batch jobs when running 3T. This as been corrected.","Products":["Framework-Batch"]},{"SimCorpReference":"S-151352"},{"SimCorpReference":"D-76439","ChangeNote":"PoolFactorsData now is exposed to Front office applications","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76550","ChangeNote":"Fix for the discrepancy between delivered files and sysobject meta data for AI.Search.Compliance package to work","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76544","ChangeNote":"Not-In-Use-But-Kept fields is wrongly deleted during upgrade. \n\nMade some minor change and added more debug information to get wiser next time this error occur.  When it is not possible to update cnf.ini, the upgrade will fail instead of old behaviour that was ignoring the error.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76775","ChangeNote":"An error in the calculation of synthetic FX hedge returns had the effect that inverted FX rates where used. The error has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-76597","ChangeNote":"This correction changes the headers on the two return columns in the Synthetic FX Hedge Returns window. The text \u0022RC\u0022 is removed from both headers and they are now \u0022Base return\u0022 and \u0022Price return\u0022. The window does not specify any reporting currency and thus it was a source of confusion that the headers had \u0022RC\u0022 in them. Further, the number of decimals is changed from 8 to 12 to allow for higher precision.","Products":["Performance"]},{"SimCorpReference":"D-76489","ChangeNote":"Configuration transport: An error was detected in the Compliance Configuration transporter (CMPLCONFIGURATION). The error means that when importing a Compliance Configuration record into a target installation where this does not exist, the new record will not be created correctly in the target installation. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76899","ChangeNote":"Fixed flaky unit test.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-169682","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76833"},{"SimCorpReference":"S-170569"}]