[{"SimCorpReference":"D-74324","ChangeNote":"Fill Payment Date and Security ID in alert","CustomerApplyNote":"Add Security ID and Payment Data to TPD alerts","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-69532"},{"SimCorpReference":"D-75523","ChangeNote":"The cash balances per agreement date in the portfolio calculation running on a period closure framework were not correct after applying privileges to reversed and active cash payments. Specifically when only the period closure agreement date was changed. The error has been fixed. Now period closure system reversals of reversed cash payments are made when there are changes in any of the period closure dates including the period closure agreement date.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-77089","ChangeNote":"An error could occur when creating \u0027Payments\u0027 i the \u0027Reconciliation Manager\u0027 in case more than one payment instructions were to be reconciled. This has been fixed.","Products":["Business-GeneralLedger","Business-Reconciliation"]},{"SimCorpReference":"D-77030","ChangeNote":"An error could occur in the \u0027Covariance Manager\u0027 in case \u0027Merger\u0027 \u0027Corporate Actions\u0027 existed for at least one of the by the \u0027Risk Factor\u0027 implied securities. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-77019","ChangeNote":"Do not ignore rebase factors for XpressInstruments and OTC","Products":["MarketData","TradeManager","Valuation","XpressInstruments"]},{"SimCorpReference":"D-74313","ChangeNote":"Highlighting \u0026 Go to Order function in Order Manager now works properly for classic orders too"},{"SimCorpReference":"D-77123","ChangeNote":"An error could occur when trying to load a bond having \u0027Fixings\u0027 and a \u0027Reference rate\u0027 with  \u0027Rate convention\u0027 \u0027Par yield\u0027 into the  \u0027Edit Multiple Securities - Bonds\u0027  window. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-76960","ChangeNote":"timestamp in om3_de_orders is updated after an order is parked"},{"SimCorpReference":"D-76374","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-76816","ChangeNote":"The performance for creating OIS fixings has been improved.","Products":["StaticData"]},{"SimCorpReference":"D-76934","ChangeNote":"Fixed a system performance issue in Compliance that can occur if a lot of “Pool to Portfolio” mappings exist.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77171","ChangeNote":"It is now possible to set the reference Rate Convention to Par yield for other instruments than MIT bonds if the Fixing Frequency results in a longer period than the period for the Payment Frequency. Previously this was not possible as an error message would be issued telling “The reference rate convention for this reference rate cannot be PARYIELD when adjusting fixing frequency is set.","Products":["StaticData"]},{"SimCorpReference":"D-77075","ChangeNote":"Incorrect reinvestment service url retrieved in some installations. Fixed","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-76637","ChangeNote":"This change corrects a possible error in the  Performance Calculation in the calculation of the TWR based FIPA local return that could occur at maturity for swaps.","Products":["Performance"]},{"SimCorpReference":"D-77199","ChangeNote":"NA","Products":["Business-DWH"]},{"SimCorpReference":"D-75062","ChangeNote":"Corporate Actions Dashboard might fail with ORA-00001 Unique constraint error. Issue was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77140","ChangeNote":"In Rule Entry, properties which usually require an input dialog, such as ISIN or CUSIP, should pop up a selection list, when used with a List or External List. This had stopped working, but has now been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75158","ChangeNote":"Optimize code to use less size without any changes in underlying business functionality.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-77091","ChangeNote":"CA Dashboard can crash with ORA-01628 max # extents reached for rollback segment. Was Fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-76877","ChangeNote":"Optimizations that will speedup a Simulation Macro that uses UDKR\u0027s.  Will also generally improve the Portfolio Sheet if it contains UDKRs","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77174"},{"SimCorpReference":"D-77120","ChangeNote":"In installations with enforced portfolio master, the Online compliance applets don\u0027t show any results because of wrongly evaluated auth. on the Online service. This has been fixed.","Products":["CsCode-Basic","CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76991","ChangeNote":"\u0027Rounding Rules\u0027 with \u0027Field to be rounded\u0027 set to \u0027Nominal redemption\u0027 did not work anymore. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-76963","ChangeNote":"In a very specific case, a placement on an aggregated order, where part of the bundle required override and compliance override, and the other did not required any override, the bundle status was blocked, so that the placement could not proceed after all overrides were complete and accepted. This has now been resolved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77164","ChangeNote":"There was an error in Benchmark Calculation when executing the type \u0027Update Index/Benchmark using Segment\u0027. The indexes in the benchmark segment was not correctly identified. The error has been corrected.","Products":["Benchmarks"]},{"SimCorpReference":"D-76871","ChangeNote":"The userts tablespace is no longer checked and verified during update."},{"SimCorpReference":"D-77029","ChangeNote":"CA Dashboard service in case having more than 10K publication might crash on Oracle by updating the data. Was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-75667","Products":["CsCode-MiddleOffice","CsCode-RiskManagement"]},{"SimCorpReference":"D-76323","ChangeNote":"This is a client specific fix for a client to address rounding issues","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-76657","ChangeNote":"Four eye validation would wrongly alert about a change to the transaction - the  solution was to make all necessary data available for the validation to avoid this.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions"]},{"SimCorpReference":"D-76803","ChangeNote":"Previously, if the \u0022Shows checks only for released orders\u0022 setting was checked in Front Office options, then placement validations were only shown in the pre-trade monitor if they had a pending Compliance Override request.\n\nThis has now been changed so that the setting no longer affects the display of placement validations. All placement validations are always shown in the Pre-trade monitor, regardless of whether or not they require compliance override or the above setting has been checked.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76215","ChangeNote":"Enabling calculation of accrued interest, dirty and clean prices for structured bonds that have such high quote that spread calculation is impossible. Applies to pricing of structured bonds with Quoted price \u002B yield curve, structured products pricing method.","Products":["Valuation"]},{"SimCorpReference":"D-77035","ChangeNote":"Field \u0027line\u0027 on reconciliations applet of reconciliation manager was opened by mistake. Now it is closed again","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-76826","ChangeNote":"When using the \u0027Price method\u0027 \u0027Quoted price \u002B yield curve, structured products\u0027 and having \u0027Use auxiliary market data\u0027 checked in the relevant \u0027Pricing Definition\u0027 line the valuation with this \u0027Pricing method\u0027 erroneously failed in case no \u0027Conv. Adj. vol. curve\u0027 was defined on the relevant \u0027Bond\u0027.","Products":["MarketData"]},{"SimCorpReference":"D-77026","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"S-140803","ChangeNote":"The database load generated by the Trade Processing Dashboard service has been reduced.","Products":["Business-SettlementManager","Framework-Database"]},{"SimCorpReference":"S-171219"},{"SimCorpReference":"D-76696","ChangeNote":"When saving a bond, it is no longer validated that the coupon and/or redemption frequency is 6M, when using the EOM Convention \u0027Last, no leap\u0027. Furthermore any anchor date can be used together with EOM Convention \u0027Last, no leap\u0027.","Products":["StaticData","Instruments"]},{"SimCorpReference":"D-75815","ChangeNote":"Fixed an error where the Portfolio/Fund Administration Manager in the Alarms Inbox Applet would not restrict shown alarms based on the corresponding setup in the Setup Applet.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76917","ChangeNote":"AxR Position Integration batch job does not support reference dates. Fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-76127","ChangeNote":"Strategy Manager: fixed Solvency2 unshocked DV inconsistent results","Products":["Business-Risk"]},{"SimCorpReference":"D-76569","ChangeNote":"With tax buckets, the match calculation, when booking the sell, is done in a different function than usual fifo or lifo.\n Tax bucket was missing a piece of code that prevents errors due to double floating arithmetic issues","Products":["Business-Match","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-76962","ChangeNote":"Counterparty ID in DE_ALLOCATIONS now contains the ID not the name"},{"SimCorpReference":"D-76720","ChangeNote":"Reducing number of calls to read scenario file, and adding more retries","Products":["Business-Risk"]},{"SimCorpReference":"D-76866","ChangeNote":"When checking the consistency of PCL holdings, the mix of positions with and without the errors led to a program crash on the step of making the error message report. Now it is fixed by aligning the length of faulty fields with the other variables.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-76957","ChangeNote":"Customer specific correction to Performance Calculation related to a special GIPS composite calculation flow.","Products":["Performance"]},{"SimCorpReference":"D-76662","ChangeNote":"Trade Manager: In some cases when FAP segment for OTC swaps contains created date of the contract, OTC swap transaction, created from Front Office simulation,  could be booked on a wrong FAP line. It has been fixed.","Products":["TradeManager"]},{"SimCorpReference":"D-76863","Products":["Business-Connectivity"]},{"SimCorpReference":"D-76349","ChangeNote":"Error due to domain value happens by transporting a fund extended event. Was fixed","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-76614","ChangeNote":"Fixed an error in the Asset Manager, where the position sign of historical model portfolio and benchmark positions was wrong.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76513","ChangeNote":"Forecasts in  the \u0027Alternative investments manager\\Strategy analysis \u0027  page based on existing positions relating from an \u0027Alternative investments - Internal trade\u0027 transaction transferring a position from one portfolio to another were wrong in the year with the transfer. The error has been corrected.","Products":["CsCode-AltInv","CsCode-MiddleOffice"]},{"SimCorpReference":"D-76762","ChangeNote":"Fixed environment inconsistency between Snowflake and Oracle Loads affecting BD_CALENDAR contents","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-75948","ChangeNote":"The fix suggested in this defect has been reverted. A new solution has been proposed on the defect D-76662.","Products":["StaticData"]},{"SimCorpReference":"D-76544","ChangeNote":"Not-In-Use-But-Kept fields is wrongly deleted during upgrade. \n\nMade some minor change and added more debug information to get wiser next time this error occur.  When it is not possible to update cnf.ini, the upgrade will fail instead of old behaviour that was ignoring the error.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76727","ChangeNote":"Problem importing CURCROSSES has been fixed.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-76376","ChangeNote":"Improved the robustness of endpoint registration for the look-aside load balancer.\nIn some cases the load balancer endpoints were not registered during startup, which prevented services using the look-aside load balancer to work.","Products":["CsCode-SystemOperation","Framework-Services"]},{"SimCorpReference":"D-76749","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-76649","ChangeNote":"When saving a Securities Lending Maturity\u0027 \u0027MatRepo\u0027 transaction having \u0027Actual Settlement\u0027 data wrongly the error message \u0027Underlying holdings cannot be found. Try modifying the transaction instead.\u0027  could appear. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73293","ChangeNote":"Yield for mathematical adjustment was not updated when general cost was applied to the position on settlement date of a trade. This resulted in realised interest appreciation when reallocating the whole position on settlement day of the buy which should have been zero as payment date booking was applied.","CustomerApplyNote":"Applies for new transaction being booked or when existing transactions are being rebooked.","Products":["Business-SystematicAdjustments","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-75209","ChangeNote":"Problem : When calculating NAV for Fund of funds using dependent events, some events were added to a missing event list even though the corresponding dependent event had been resolved. This caused the NAV calculation to be executed incorrectly.       \nFix : This patch ensures that the resolved dependent events are not added to the missing event list enabling the NAV flow to carry through in a correct manner.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-76389","ChangeNote":"No changes to business logic, changes to tests","Products":["CsCode-Settlement","Business-Collateral"]},{"SimCorpReference":"D-76421","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-76489","ChangeNote":"Configuration transport: An error was detected in the Compliance Configuration transporter (CMPLCONFIGURATION). The error means that when importing a Compliance Configuration record into a target installation where this does not exist, the new record will not be created correctly in the target installation. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76035","ChangeNote":"Australian Inflation Indexed Annuities will no longer show changes in the Balance nominal/number during the life time of the instrument, only at issue and maturity.","Products":["Valuation"]},{"SimCorpReference":"D-76546","ChangeNote":"Registering new Java versions in the AuCgt Java module. No changes to the application behavior are expected.","Products":["Business-AustralianCgt"]},{"SimCorpReference":"D-76618","ChangeNote":"Customer specific fix for a customer specific issue.","Products":["Business-ToolsTransactions","Business-Transactions"]},{"SimCorpReference":"D-76510","ChangeNote":"Using the field \u0027* Maturity date (FX forwards)\u0027 for security generation didn\u0027t work. This has been corrected.","Products":["Business-NameGeneration"]},{"SimCorpReference":"D-76574","ChangeNote":"In Position Calculation, Book value PC and QC are now being calculated without Solvency II and Accounting balances checkboxes (therefore, no dependency on external sales modules). This means, the only dependency is Flexible Analytics Library module for Flexible Analytics to use Book value as a position value.","Products":["Business-Risk"]},{"SimCorpReference":"D-76615","ChangeNote":"Costumer specific correction to make the Balance Booking transaction respect period closure","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-76494","ChangeNote":"Checking the oracle user/proxy-user  by ignoring the case, would allow this scenario to be unblocked, and kerberos to work in upgrade scenarios.","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"D-76488","ChangeNote":"It was not possible to approve four eye changes for table FOBMPREP. This has been corrected.","Products":["Framework-Audit"]},{"SimCorpReference":"D-76518","ChangeNote":"An assertion error occurred when calculating Performance Manager for multiple nodes and including historical data. The error has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-75514","ChangeNote":"Updated InterestRateFutures Notional amount calculation to include tick values"},{"SimCorpReference":"D-76256","ChangeNote":"Sonar Qube vulnerability has been patched to 24.07 No customer code has been changed.","Products":["CsCode-Framework"]},{"SimCorpReference":"S-165205"},{"SimCorpReference":"S-167534","ChangeNote":"The flexible analytics package NFRD has been adjusted. There is now a fallback for the NACE business classification. The \u0022calculate eligible, not aligned\u0022 configuration option applies to the annex XII now too. The missing data treatment has been adjusted and there is a fallback for Flex PI data lookup to look first for security data and then for issuer data.","CustomerApplyNote":"With this patch the onboarding of the NFRD package is needed, as there are new KPIs provided. You also need the latest configuration package for all new FlexPiDefinitions","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-76535","ChangeNote":"Internal code change. No impact on user.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-76327","ChangeNote":"The causing threading issue has been solved in the Formulas node to C# code generation","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76460","ChangeNote":"Error when importing CONFSUPPORT entities. This has been corrected.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-74721","ChangeNote":"The log viewer could in some circumstances crash when being closed down.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"S-165201"},{"SimCorpReference":"D-76477"},{"SimCorpReference":"D-76040","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-76452","ChangeNote":"For CONFONL a \u0027Number must be positive\u0027 error could occur when importing \u00270\u0027. This has been corrected.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-76457","ChangeNote":"Import of CONFMISC values failed if the value was negative (e.g. -1 for Default order for rebalancing portfolios). This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-76018","Products":["CsCode-Accounting","CsCode-AltInv","CsCode-AplInterface","CsCode-Basic","CsCode-Collateral","CsCode-Compliance","CsCode-Connectivity","CsCode-DataWarehouse","CsCode-ExampleDedicatedService","CsCode-Framework","CsCode-FrontOfficeData","CsCode-FundAccounting","CsCode-IBOR","Benchmarks","Instruments","TradeManager","Mandates","CsCode-Mediator","CsCode-MiddleOffice","CsCode-PortfolioManagement","CsCode-Prototyping","CsCode-Settlement","CsCode-SystemOperation","CsCode-Trading","CsCode-Transaction","CsCode-UC","CsCode-UP"]},{"SimCorpReference":"D-76428","ChangeNote":"Changed GS_DATA_VER (MUCS.rcv file version) from 7 to 8"},{"SimCorpReference":"D-76469","ChangeNote":"Tests were failing due to assembly versions update. So dependentAssembly were added in App.config","Products":["CsCode-IBOR","CsCode-Transaction"]},{"SimCorpReference":"D-76252","ChangeNote":"A crash could occur when importing WIDGETCONFIGS. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75058","ChangeNote":"Performance Calculation has been updated with a new setting named \u0027Negate ALM positions in funds\u0027. The setting is available when \u0027Prepare composite calc.\u0027 is selected. The effect of the new setting is that balance nominal/number and all amount fields are negated on ALM positions in fund liability portfolios.","Products":["Performance"]},{"SimCorpReference":"D-76249","ChangeNote":"This regards the Reallocation Collateral window. Automated handling of the import of the same collateral ID on both legs. The collateral on the 2 positions must not be the same but certain customers have old/existing Data Format Setups where they specify the same collateral on both legs. The system is now able to automatically place the provided collateral information on the right leg and clear this information on the other leg whenever it is relevant.","Products":["Business-Transactions"]},{"SimCorpReference":"D-76015","ChangeNote":"It wasn\u0027t possible to import PFDDIRECTORIES. This has been corrected.","Products":["Business-Connectivity","Framework-ConfigurationTransport","Framework-CoreFramework"]},{"SimCorpReference":"D-76436","ChangeNote":"Fix for position values to get generated when transaction date=portfolio booking date in Portfolio Calculation","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"S-169687","ChangeNote":"The implementation of non-cache based cost/tax defaults calculation does NOT work. The solution has been rolled back.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-75745","ChangeNote":"This is a customer specific correction, which will NOT affect other customers.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-76370","ChangeNote":"FIX message (35=G or 35=D is sent to Liquidnet) when Amend allocated a placement from Full to partial qty"},{"SimCorpReference":"D-75887","Products":["Business-Risk","Framework-Common"]},{"SimCorpReference":"S-168700","ChangeNote":"Verification of performance data","Products":["CsCode-Framework"]},{"SimCorpReference":"S-167352","ChangeNote":"Business description\nFrom version 24.10, it is possible to configure more instruments with daily reference terms (Alternative Reference Rates). The following is now supported:\nSwaps and bonds with daily fixing interest type legs and swaps with a floating rate type leg for certain compounding methods.\nAfter the upgrade but before you create any bookings, ARR-like bonds already in the system must be transitioned to the new logic. Hence, before the upgrade, positions using any such bonds must be found so that the customer can take further action on those positions.\n\nError and warning messages\nThe following warning can occur:\n\nHeader: \n[[Positions on swaps and bonds with daily fixings properties exist in the system.]] \n\nSub-header:\nWarning\n[[The following positions may need to be transitioned. These have been found by searching on the following:]]\n[[Swaps with a Floating interest type leg, daily reference rate term and compounding methods \u0022Average\u0022 or \u0022Daily compounding\u0022.]]\n[[Swaps with a Daily Fixing interest type leg, daily reference rate term and compounding methods \u0022Arithmetic Average\u0022, \u0022Compound\u0022, or \u0022OIS\u0022.]]\n[[Bonds with a Daily Fixing interest type, daily reference rate term and compounding methods \u0022Arithmetic Average\u0022, \u0022Compound\u0022, or \u0022OIS\u0022.]]\n[[]]\n[[If the \u0027LIBOR Reform\u0027 module is already configured or is to be configured after the upgrade, the FAM must be checked for each of the]]\n[[found positions. In case \u0027Interest appreciation\u0027 method is different from \u0027None\u0027, then SimCorp must be contacted through a business]]\n[[consultant in order to correctly transition these positions to the new calculation logic.]]\n\nHow to correct\nThe business consultant in collaboration with the customer must determine the actions needed in order to transition the positions found.\n\nConsequences of the correction\nAfter the data have been cleaned up, the system can be taken into use.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76245","ChangeNote":"Issue in Compliance rule fragment edit window where the \u0027Not\u0027 operator line could not be deleted, is now fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76019"},{"SimCorpReference":"D-75641","Products":["Business-Risk","Framework-CoreFramework"]},{"SimCorpReference":"D-76123","ChangeNote":"Tests were failing due to assembly versions update.  So dependentAssembly were added in App.config","Products":["CsCode-IBOR","CsCode-Transaction"]},{"SimCorpReference":"D-76079","ChangeNote":"Ensure locally cached sessions states are set to idle when we lose communication with FixNetServer via heartbeat event.  This way when we successfully reconnect via the heartbeat the change is status is correctly broadcast to the OM client and Operations Console."},{"SimCorpReference":"D-76332","ChangeNote":"DWH: Fix \u0022Value must not be NULL\u0022 when loading a rolling window fact","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-75950","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-76107","ChangeNote":"Position API response to include Pre Simulation fields and the correct Simulation values","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75777","ChangeNote":"Fixed Elimination-modified virement issue in PFC","CustomerApplyNote":"Fixed Elimination-modified virement issue in PFC","Products":["Business-GroupAccounting"]},{"SimCorpReference":"D-76253","ChangeNote":"For CURCROSSES using opposite cross a dependency to the opposite cross has been added (to ensure data is imported in the correct order).","Products":["MarketData","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75418","ChangeNote":"Upgraded Mircosoft .Net library according to security advisory.","Products":["CsCode-Accounting","CsCode-AltInv","CsCode-AplInterface","CsCode-Basic","CsCode-Collateral","CsCode-Compliance","CsCode-Connectivity","CsCode-DataWarehouse","CsCode-ExampleDedicatedService","CsCode-Framework","CsCode-FrontOfficeData","CsCode-FundAccounting","CsCode-IBOR","Benchmarks","Instruments","TradeManager","Mandates","CsCode-Mediator","CsCode-MiddleOffice","CsCode-PortfolioManagement","CsCode-Prototyping","CsCode-Settlement","CsCode-SystemOperation","CsCode-Trading","CsCode-Transaction","CsCode-UC","CsCode-UP"]},{"SimCorpReference":"D-76246","ChangeNote":"Compliance calculations: Scope filtering (Pre-trade and Rule) should not affect external values.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76159","ChangeNote":"Don\u0027t add the validation of Initial Rate value when it is expected to be null and shown as Interpolate in the UI."},{"SimCorpReference":"D-75902","ChangeNote":"The system provides different results when creating transactions via the Credit Loss Allowance single transaction screen. \nThe issue was corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-75315","ChangeNote":"A possible crash was fixed when working with futures in the AM Order Outbox quick input grid.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-169279"},{"SimCorpReference":"S-168903"},{"SimCorpReference":"D-76024","ChangeNote":"It wasn\u0027t possible to bootstrap TRASTATJOB as the system require all records to be present, and import work record by record. A workaround for this has been implemented.","Products":["Business-TransactionBookingAccounting","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75143","ChangeNote":"Refactoring Risk alert cleanup functionality, case when one WFEVENTIK assigned to multiple ECNODEIK in tECNODES table, that causing a crash, has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-76177","ChangeNote":"Liquidnet placements will now default to Allocation method as defined at desk level defaults"},{"SimCorpReference":"D-74173","ChangeNote":"Fixed an error that could lead to missing business class attributes in Compliance validations after business classes time series records were deleted.","Products":["CsCode-Compliance","CsCode-FrontOfficeData"]},{"SimCorpReference":"S-167735","ChangeNote":"The formula function getparswiftbicex is available in 24.01 and 24.04 now.","Products":["Framework-Common","Framework-Formulas"]},{"SimCorpReference":"D-73646","ChangeNote":"When the transaction with deleted actual payment and active expected payment is reversed by a system, the reversal and new active transactions do not get Payment Reconciliation P/L records. However, the corresponding flag in the \u0027Transactions\u0027 table was wrongly set to an active state for those transactions, causing \u0027Verify Business Data\u0027 job to report an inconsistency of flag where it is set while no sub-data exists.\nOn this CR it has been fixed, ensuring that the flag is not set for the transactions with no Payment Reconciliation P/L data.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-76179","Products":["Tools-Utilities"]},{"SimCorpReference":"D-75491","ChangeNote":"Fixed a problem in compliance calculations of Capital requirement regulation rules, that would cause data exceptions for CurrencyCross attribute on FX NDF positions. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76117","ChangeNote":"Fix for error in automation service when orders are cancelled"},{"SimCorpReference":"D-75771","ChangeNote":"Log is added for ADIA client only for 24.07 version only.\nPurpose is investigating an issue when sometimes cancellation SWIFT messages aren\u0027t sent for cancelled netting.","Products":["Business-Netting"]},{"SimCorpReference":"D-75893","ChangeNote":"Adding short redemptions to the transaction types covered by the checkbox ‘Redemption amount’ in the ‘Cancel and Correct’ screen.","Products":["Business-Transactions"]},{"SimCorpReference":"D-75527","ChangeNote":"User schema tablespaces can be transported now via XMGR and Configuration Transport. Applicable for DWH and Internal user schema types.","Products":["Business-DEX"]},{"SimCorpReference":"D-73492","ChangeNote":"NAIC fields are not updated on Capital Reduction transaction. It has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-75988","ChangeNote":"For FX simulations use maturity date to determine instrument type, when merging FX forward and FX Spot","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76039"},{"SimCorpReference":"D-76070","ChangeNote":"Exec report with 150=8 is no longer DKed"},{"SimCorpReference":"D-75958","ChangeNote":"Front office holdings are not pre-calculated for tomorrow for holdings that belongs to sub-fund frameworks only. As a result user might experiense missing holdings positions in sub-fund portfolios.\nThis fix adds sub-fund frameworks into scope for holdings lookup so, we have sub-fund related holdings pre-calculated as well.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-75799","ChangeNote":"Batch Job Function \u0022Cancel and Correct\u0022: fix error that may occur with redemptions.","Products":["Framework-ApplicationFramework","Framework-InternalApplicationFramework"]},{"SimCorpReference":"D-75750","ChangeNote":"There was a regression of Transformation service performance that seem to be caused by #20851"},{"SimCorpReference":"D-76008","ChangeNote":"Problem importing SCHEDULES if having different regional settings (date). This has been corrected.","Products":["Business-Schedules"]},{"SimCorpReference":"D-76020","ChangeNote":"It wasn\u0027t possible to import a couple of settings in CONFSECURITY (e.g. fpPW_MINLEN and fpPW_STORENO). This has been corrected.","Products":["Framework-Users"]},{"SimCorpReference":"D-76012","ChangeNote":"Importing records of type WIDGETCONFIGS could fail, if the package included other types. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75982","ChangeNote":"A program error occurred when trying to import CURCROSSES in an empty installation. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-166681","Products":["Business-Risk","Performance","Framework-Batch","Framework-Services"]},{"SimCorpReference":"D-75310","ChangeNote":"All data in CAE matrices is now updated with narrative data","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-75848","ChangeNote":"Compliance: Coverage factor should be calculated as Total collateral / Market value, and NOT as Total collateral / Market value incl. margin","Products":["Framework-Batch"]},{"SimCorpReference":"D-76003","ChangeNote":"On a deviations applet of reconciliation manager it\u0027s possible to select a line now","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-75708","ChangeNote":"Compliance Update Collateral Table batch job: \u0022Cash to security map (group code)\u0022 does not work for post trace calculations. This has been fixed","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75489","ChangeNote":"If the import crashed, the crash was correctly trapped. But the forms the import had open was never closed, meaning when having \u0022enough\u0022 crashes all resources had been used.\nThe system will now ensure \u0022loose\u0022 forms are closed.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75772","ChangeNote":"This corrects an error that could happen during Payment reconciliation when transactions was stopped for booking.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-75395","ChangeNote":"OM changes to address vulnerability in 3rd party library Azure.Identity highlighted by Mend."},{"SimCorpReference":"D-75661","ChangeNote":"Removal of excessive validation in the adjustments grid in Trade Manager","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-74264","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75742","ChangeNote":"The size of an hidden internal key field was increased to avoid running out of unique keys.","Products":["PrivateDebtStaticData"]},{"SimCorpReference":"D-75613","ChangeNote":"The defect fixes the following problem - Instrument type on new FX swap legs is FX forward. It means that even if you have a rule for FX swap instrument type it will not be applied. At the same time a rule for FX forward in the same Portfolio/segment will be applied, and FX swap will be rolled as two separate FX forwards.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75936","ChangeNote":"In the flexible analytics bundle NFRD the analytics were looking for the wrong NACE group code (expected: 65.1, actual: 66.1) and NACE division (expected: 65, actual: 66) for Life insurance. This has been corrected now.","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-74246","ChangeNote":"Sign of Nominal/Amount should be taken into consideration when master transaction is selected for netting record.","Products":["Business-Netting"]},{"SimCorpReference":"D-74777","ChangeNote":"Fixed the following problem: When cash management is linked to payment reconciliation, and period closure has been installed, and a payment has been reconciled and deleted and reconciled again before the period closure initiation date, then a portfolio calculation calculating open payments and early payments, would wrongly report an open payment.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-75873","ChangeNote":"Patch of flaky unit test","Products":["Pkr"]},{"SimCorpReference":"S-167175","ChangeNote":"New orders will now be auto-accepted if not available to aggregate into working orders as per DD configuration; or auto-aggregated into available non-Working orders. Previously they stayed in Inbox in such cases"},{"SimCorpReference":"D-73854","Products":["Business-Risk"]},{"SimCorpReference":"D-75364","ChangeNote":"Reduce effect of quadratic performance issue by use of batching."},{"SimCorpReference":"D-75307","ChangeNote":"Support Open/Close attribute on compliance rules using transactions. This is working for OTC\u0027s, but IRS and Futures are not supported","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75737","ChangeNote":"Fix for crash on attempting to select a value for an investment structure condition in the Rule tree.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75867"},{"SimCorpReference":"D-75741","ChangeNote":"Fix for issue where combined rules using rating measures were converted to xml only.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75865","ChangeNote":"Closing for input Business convention field for Inflation yield curves in Yield Curve Manager.","Products":["MarketData"]},{"SimCorpReference":"D-75045","ChangeNote":"Restore pricing of structured bonds with Theoretical pricing method and Yield to worst\\Yield to best maturity conventions and Caps\\Floors present.","Products":["Valuation"]},{"SimCorpReference":"D-75067","ChangeNote":"Error when cash carry effect was zero on a from date after recalculation has been fixed.","Products":["Performance"]},{"SimCorpReference":"D-74089","ChangeNote":"Issued certificate from Liability shared class is always sign reversed, no matter the selection of \u0022include fund holdings as\u0022 is Class holdings, Issued certificates, or both.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75637","ChangeNote":"The error happens when there are accrued interest transactions and balance booking transactions on the same date:\nIf the balance booking transaction is created after the accrued interest transaction, it removed the data that was generated by the accrued interest in the table \u0022Contract Holdings Per Leg\u0022, which led to the missing A/L details for the CCP IRS netting transaction.\nIf the balance booking transaction is created before the accrued interest transaction, the above would not happen and A/L details would be generated correctly.\n\nThe error was solved by correcting the behavior of the balance booking transaction so that it does not reset the data in the \u0022Contract Holdings Per Leg\u0022 that was generated by other intraday transactions which are booked before the balance booking transaction.\nThis is how other transactions like “Initialise Holdings RPH framework” and “Initialise Holdings, Nom.” behave.","Products":["Business-PrivateDebt"]},{"SimCorpReference":"D-75598","ChangeNote":"Changed error descriptions to be aligned with Full Deployment"},{"SimCorpReference":"D-75299","ChangeNote":"With this change, CurrencyCross attribute in CM will now behave like it does in AM, where EUR/USD is different from USD/EUR. When grouping crosses for capital requirement rules, the existing behavior, that considers EUR/USD the same as USD/EUR , will be kept.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75412","ChangeNote":"Fixed an issue where sometimes ASTRA fund forecasting would produce erroneous TVPI values.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-75476","ChangeNote":"Cash effect from orders could be missing when using \u0022Issuer\u0022, \u0022Security\u0022 or \u0022Quotation currency\u0022 fields in cash API filter condition. The error has been fixed.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75643","ChangeNote":"An error in hedge target instrument type validation in Asset Manager FX roll functionality has been fixed.","Products":["CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75257","ChangeNote":"\u0027Accrued Interest QC/PC\u0027 and \u0027Accrued Interest EOP QC/PC\u0027 were not scaled in the same way with regards to the \u0027Quotation factor\u0027 for \u0027Caps/Floors\u0027. This has been fixed.","Products":["Valuation"]},{"SimCorpReference":"D-74770","ChangeNote":"In rare cases in the \u0027Risk Measurement\u0027 Dividends were taken into account twice when calculating \u0027P/L for backs testing\u0027. This could only happen in case an Equity was contained more then once in the calculation due to several positions. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-75574","ChangeNote":"Fix possible error when running reference rate fixings","Products":["StaticData"]},{"SimCorpReference":"D-75666","ChangeNote":"Use business adjust convention from standard contracts in inflation curve estimation.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-75155","ChangeNote":"When changing the fund structure from a Normal fund to a Pool fund, the system could not handle this type of fund structure if it had Multi-class fund in it.\nExecuting the \u0022Create Fund Figures\u0022 functionality on such a fund structure would give the following error message because the Multi-class fund does not have a class defined in it: Pool fund must have at least one certificate. \n\nThe error was corrected by handling the Multi-class fund in the same way as a Multi-master fund is handled in the code because both fund structures are defined in the \u0022Fund Definitions\u0022 without classes.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-75429","ChangeNote":"Changes to internal tools. No changes to any SCD calculations.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-75617","ChangeNote":"Fix for Amendment of FX GTD order allocation failing due to invalid Expiry Date"},{"SimCorpReference":"D-75622"},{"SimCorpReference":"D-75196","ChangeNote":"We do not generate Explain Calculation file if no calculation/estimation details are available.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-75557","ChangeNote":"Fixed problem with Initial balance record in Cash Viewer Cash details in some specific cases.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75375","ChangeNote":"hello","CustomerApplyNote":"Add Settlement convention functionality to Position Calculation (add a unit test and fix issues).","Products":["Business-Risk"]},{"SimCorpReference":"D-75610","ChangeNote":"DWH: Fix incremental condition generation to avoid re-loading existing records","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"S-167332"},{"SimCorpReference":"D-74638","ChangeNote":"Display Bond Redemption payment in Cash Viewer","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75576","ChangeNote":"Fix issue with Base Mart DMS_ACC_FWK_Extended not being found","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-75550","ChangeNote":"It is no longer possible to define a custom fields that uses a field that is marked for future deletion."},{"SimCorpReference":"D-74232","ChangeNote":"Fixing incorrect payments in Cash Management for Total Return Swaps.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-75328","ChangeNote":"Make the Unrealised security negative Adj. QC and PC fields available for (fund) figures.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-75461","ChangeNote":"FX forwards are included in select condition together with FX swaps.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75486","ChangeNote":"In Mexican Inflation curve estimation, coupons were adjusted with index on payment date instead of term date. It has been fixed.","Products":["MarketData","CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-74760","ChangeNote":"Issue with formula values for formulas defined in child mapping not shown in Asset manager is fixed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-75097","ChangeNote":"During execution of an auxiliary job an assertion could occur and the execution was halted. This has been corrected.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-75464","ChangeNote":"German language support for compliance audit report","Products":["CsCode-Compliance"]},{"SimCorpReference":"S-166029"},{"SimCorpReference":"D-75224","ChangeNote":"Fix issue with blank floating rate index in GUI of some TM swap instruments","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-74593","ChangeNote":"An index error could occur if a bank holiday was added to the calendar and the Performance Measurement was recalculated from the day after the added bank holiday. The error has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-75504","ChangeNote":"Fix to allow NOMA allocation defaults to taking Currency value into account when looking-up Counterparty"},{"SimCorpReference":"D-75245","ChangeNote":"Excel pagebased format has been added to the list of the output formats in the Report Properties","Products":["Business-Reporting","Tools-AplFuncCheck"]},{"SimCorpReference":"D-72425","ChangeNote":"When MUCS is restarted without restarting the service platform, the services might end up with a new AplNid.\nThe services did not register that, and as a consequence the services are not able to activate single instance functionality, like for example the \u0027Look-Aside load balancer\u0027 in the Directory service.\nThis has now been corrected, so service will always have the AplNid that was assigned by the currently running MUCS.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-74557","ChangeNote":"In case REPROLE is equal to DEXROLE  client gets an ORA crash. Was fixed","Products":["Business-DEX"]},{"SimCorpReference":"D-75445","ChangeNote":"Order Manager - External Integration service can start (in \u0027Online passive\u0027 mode) if it is not configured to run AzSB messaging.","CustomerApplyNote":"Order Manager - External Integration service can start (in \u0027Online passive\u0027 mode) if it is not configured to run AzSB messaging."},{"SimCorpReference":"S-167273"},{"SimCorpReference":"D-74955","ChangeNote":"Fixes issue with deploy in case target and source models have fact with same alias but different name- the load plan might point to the wrong item, and crash","Products":["Business-DWH"]},{"SimCorpReference":"D-75424","ChangeNote":"No impact on clients","Products":["Business-AustralianCgt"]},{"SimCorpReference":"D-75436","ChangeNote":"will be fixed on D-75426","Products":["Business-FundAccounting","Business-Modelling","Business-PortfolioManagement","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-75116"},{"SimCorpReference":"D-75366","ChangeNote":"A conversion program could fail when processing compliance alerts.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-75253","ChangeNote":"No changes to customer functionality","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-75088","ChangeNote":"This increment solves a problem with results from cancelled placements not being removed from pre-trade monitor","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75168","ChangeNote":"Cash bucket synchronization was not executed when running modeling way","Products":["Business-Cash"]},{"SimCorpReference":"D-75135","ChangeNote":"This increment solves a problem with fills and allocations on cancelled placements not showing up in compliance results","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75161","ChangeNote":"Fixed an issue where the value of a floating fx (spot/forward) leg would not be calculated.  Happened if the fixed leg had issues with any of the user defined key ratio.  But if the exposure can be calculated this should not block calculating the value of the floating leg","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"S-164149","ChangeNote":"Change the logic for sampling TVPI values when doing ASTRA forecasts. New implementation should make more realistic predictions, when the TVPI values on actual state date are extreme. This includes both implementations for Forecast Model driven prediction and predictions driven by Private Market Benchmark Data","CustomerApplyNote":"Change the logic for sampling TVPI values when doing ASTRA forecasts. New implementation should make more realistic predictions, when the TVPI values on actual state date are extreme. This includes both implementations for Forecast Model driven prediction and predictions driven by Private Market Benchmark Data","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-73481","ChangeNote":"A possible crash in Position Analyses online prices functionality has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-75134","ChangeNote":"This increment solves a problem with working order lines being present for fund constituents","Products":["CsCode-Compliance"]},{"SimCorpReference":"S-166247"},{"SimCorpReference":"S-166827","ChangeNote":"script created","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"S-166835","ChangeNote":"Renaming of mCOMSRV_SWIFT MX LAU functions to ensure CHKXTRA compatibility. The new communication server gateway command scdSwiftMx_LAU is implemented that allows you to generate or validate the Swift MX Local Authentication (LAU) data.","CustomerApplyNote":"Renaming of mCOMSRV_SWIFT MX LAU functions to ensure CHKXTRA compatibility","Products":["Business-Connectivity","Business-Swift"]},{"SimCorpReference":"D-74215","ChangeNote":"Enabling rule option \u0022initial group by holding\u0022 would occasionally lead to indeterministic compliance results for rules using legal exposure in combination with fragments.  This is now fixed","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-75262","ChangeNote":"In case when post-trade compliance validation return an error we observed a crash in the code. This was corrected.","Products":["CsCode-Transaction"]},{"SimCorpReference":"S-166124"},{"SimCorpReference":"D-74527","ChangeNote":"CVE-2024-35255: Upgrade Azure.Identity to 1.12.0  and Microsoft.Identity.Client to 4.61.3.0","Products":["CsCode-AltInv","CsCode-Connectivity","CsCode-DataWarehouse","CsCode-Framework","CsCode-FrontOfficeData","CsCode-FundAccounting","CsCode-Mediator","CsCode-PortfolioManagement","CsCode-Settlement","CsCode-SystemOperation","CsCode-UC","CsCode-UP"]},{"SimCorpReference":"D-75266","ChangeNote":"Fixing rate estimation before settlement date was corrected","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-74977","ChangeNote":"Improve performance of Business class time series updates in compliance services.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-74827","ChangeNote":"Fixed an issue where the AM Cache did not release all the memory that were used while processing a job.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75030","ChangeNote":"If a Franking Credit Invalidation transaction is made on a holding with multiple tax lots on the same day as a dividend transaction, then the time series validation might fail.  This happens if the invalidation only affects some of the tax lots and Franking Credit At-Risk was enabled.  The error has been corrected.","Products":["Business-TaxAccounting"]},{"SimCorpReference":"D-74164","ChangeNote":"Forward points need to be formatted and displayed in the Order Manager Allocate window, up to 8 d.p. if such value is provided."},{"SimCorpReference":"S-166250"},{"SimCorpReference":"D-75141","ChangeNote":"Some compliance data was incorrectly deleted during cleanup","CustomerApplyNote":"Some compliance data was incorrectly deleted during cleanup","Products":["Business-Compliance"]},{"SimCorpReference":"D-75169","CustomerApplyNote":"Make Align Objects more robust when we have tables without tablespace"},{"SimCorpReference":"D-73934","ChangeNote":"Switched few logging calls from the no-commit mode to the autonomous transaction mode.\nAdded more information to the tracing function so it\u0027s easier to analyze the Application logs.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-72115","ChangeNote":"NA: none code change. Needed to be done on site oracle updates."},{"SimCorpReference":"D-74986","ChangeNote":"Amended processing for dissolving any earlier draft placement."},{"SimCorpReference":"D-74699","ChangeNote":"For bonds having Interest type \u0027Adjust\u0027: When using \u0027Coupon at Acquisition\u0027 and trading the bond earlier than the Coupon from date of the bond, but later than today\u0027s date, the \u0027Rate used until first fixing\u0027 will now be taken into account in key ratio calculation and cash flow generation.","Products":["Valuation"]},{"SimCorpReference":"D-75035","ChangeNote":"In the \u0027Configure AWV Report\u0027 is was not possible anymore to select \u0027Segments\u0027. This has been fixed.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-74086","ChangeNote":"Fixes issue with Fact BF_USER_DEFINED_KEY_RATIOS getting  a unique constraint violation error."},{"SimCorpReference":"D-74461","ChangeNote":"When loading transactions in the \u0027View Transactions\u0027 window a performance loss could appear due to SCD trying to restrict corporate action event reference fields. This has been fixed.","CustomerApplyNote":"When loading transactions in the \u0027View Transactions\u0027 window a performance loss could appear due to SCD trying to restrict corporate action event reference fields. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73562","ChangeNote":"Fixed an issue with exporting to Excel not containing all the fields.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75017"},{"SimCorpReference":"D-74737","ChangeNote":"If serveral ISINs are requested from a consumer installation, either by sending a semicolon separated list or saving the ISINs directly in the WM Selection By ISIN table, a length error occured. This has been fixed.","Products":["Business-Connectivity"]},{"SimCorpReference":"S-165935"},{"SimCorpReference":"D-74968","ChangeNote":"This increment solves a problem with missing placements in compliance results for expired orders in order manager","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-74575","ChangeNote":"This increment solves a problem with missing placements allocation and fills in compliance results for orders in order manager that was previously rejected by order manager","Products":["CsCode-Compliance"]},{"SimCorpReference":"S-157666","ChangeNote":"the new check-box \u0027Suppress leading/trailing dots for SWIFT Alliance Server\u0027 was introduced on the screen \n\u0027Interface   Options\u0027 tab \u0027SWIFT-1\u0027.  When this check box is activated for the Alliance Server, the SWIFT MT messages will be generated without dot. \nIn case  this check box is deactivated for the Alliance Server, the SWIFT MT  will keep dot in SWIFT messages.","Products":["Business-Connectivity","Business-Swift"]},{"SimCorpReference":"D-74922"},{"SimCorpReference":"D-74895","ChangeNote":"Avoid division by zero in case when there are no positions to trade in security rebalancing with level-out Cash distribution method.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-74358","ChangeNote":"Fixed 500 error when executing CreateReleasedOrdersBegin API command with program trades","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74689","ChangeNote":"Fixed an issue where the Asset Manager crashed in some specific situations if layout were applied for a portfolio sheet from another portfolio where distribution sets existed","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-75000","ChangeNote":"Check of partition groups in scdUpdate did not allowed for deleted groups in new ins file.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-74686","ChangeNote":"Improve error messages from the batch job  \u0022Generate Time Series Cash Flow\u0022  by including name of failing securities.","Products":["StaticData"]},{"SimCorpReference":"D-74705","ChangeNote":"Make match APL unit test testMatchIntSimpleRecCo11 more stable","Products":["Business-Match"]},{"SimCorpReference":"D-74723","ChangeNote":"It was not possible to update the field \u0027Holiday adjust coupons\u0027 to \u0027False\u0027 via the WM Field GD814A on a WM import, even though the \u0027Interface Option\u0027 \u0027Update the static data field \u0022Holiday adjust coupons\u0022 by GD814A\u0027 was checked and in the \u0027WM Filed Update rules\u0027 \u0027Update Always\u0027 was set for this field. This has been fixed.","CustomerApplyNote":"see change note","Products":["Business-Connectivity"]},{"SimCorpReference":"D-74431","ChangeNote":"Updated the placement file export process to always use . as the decimal separator for stop and limit prices even if the localized regional setting is different"},{"SimCorpReference":"D-74549","ChangeNote":"Fixed an issue where multiple AM Cache service instances would pick up incorrect jobs if jobs were created in quick succession","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74853","ChangeNote":"Add Mapping for Netting Rule to FI instruments in OM Data Extract"},{"SimCorpReference":"D-74607","ChangeNote":"Fix error where Trade Manager repo contracts would give validation error on Yield field, if the Yield was too high. Now instead the Yield is rounded.","Products":["TradeManager"]},{"SimCorpReference":"D-74601"},{"SimCorpReference":"D-74584","ChangeNote":"Add two missing UDKR UnitBm and BmQCScaled when \u0022Scale by nominal\u0022","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-74890","ChangeNote":"For FX-rates it wasn\u0027t possible to search for price and base currency. This has been corrected.","Products":["Framework-Search"]},{"SimCorpReference":"D-74499","ChangeNote":"Problem with importing into Reallocation Collateral using a user defined filter has been solved","Products":["Business-Connectivity"]},{"SimCorpReference":"D-74759","ChangeNote":"Flaky unit test was fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-73816","ChangeNote":"A crash could happen, when executing a performance measurement, using pre-calculated benchmark data, due to the system trying to use a wrong cache. This has now been fixed.","Products":["Benchmarks"]},{"SimCorpReference":"D-74302","ChangeNote":"Fixed various errors with leg-specific compliance attributes (like \u0022Currency opposite leg\u0022 or \u0022Nominal absolute legged\u0022). In certain scenarios, the compliance engine was not able to find the other leg so the value of the attribute was incorrect.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-74695","ChangeNote":"Bond to ABS general exchange could result in incorrect book value calculated. Fixed here.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-74244","ChangeNote":"Classic OM Client doesn\u0027t remove Assignment Alert after Assignment is Undone. This was fixed."},{"SimCorpReference":"D-74363","ChangeNote":"An error could occur on the \u0027STP-Order status\u0027 service in case orders with \u0027Order approval status\u0027 \u0027Not started\u0027. were to be processed and the \u0027Order Option\u0027 \u0027 \u0027Use threshold-based order approval\u0027 \u0027 was not checked. This has been fixed.","Products":["Business-STP"]},{"SimCorpReference":"D-74245","ChangeNote":"Bonds static data screen, using a Reference rate having Compounded index as its Rate convention: The Date column in the Coupon Rates sub-screen will be populated, even though the Adjust fixing frequency check box isn\u0027t yet ticked.","Products":["StaticData"]},{"SimCorpReference":"D-74644","ChangeNote":"System Performance issue while executing Middle Office Calculation Manager with Save explain stress test information set to Never or Number of days has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-74802","ChangeNote":"It was not possible to import Fund Schemes. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-131689"},{"SimCorpReference":"D-74260","ChangeNote":"Changed AI Manager Look-Through Precision, \u0022% value QC\u0022  is set to 9999999 if the value is larger than 7 digits. Max integer allowed 9999999.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-74519","ChangeNote":"When matching \u0027FX Spot\u0027 \u0027Buy/Sell\u0027  transactions and using the \u0027Closing\u0027 legs instead of the \u0027Opening \u0027leg,  the \u0027Nominal\u0027 and/or \u0027FX rate\u0027  of the \u0027Price currency amount\u0027 was not updated properly. This has been fixed.","CustomerApplyNote":"Problem fixed. See change note.","Products":["Business-Match"]},{"SimCorpReference":"D-74811","ChangeNote":"Improve exception flow when a UP session with a running task is being disposed.","Products":["CsCode-Prototyping"]},{"SimCorpReference":"D-74773","ChangeNote":"Added guard to prevent crash on match window open"},{"SimCorpReference":"D-74603","ChangeNote":"When changing password the 2 entries of the new password are validated to be identical","Products":["Framework-Users"]},{"SimCorpReference":"D-73717","ChangeNote":"Patch fixes failed auto allocation due to precision loss induced by FX conversion and rounding of collateral value of available/collateral positions.","Products":["Business-Collateral"]},{"SimCorpReference":"D-73991","ChangeNote":"This increment solves a problem in handling of allocations","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-74521","ChangeNote":"It wasn\u0027t possible to import records of type \u0027DXUSCHEMA-ADMIN\u0027. This has been corrected.","CustomerApplyNote":"Fix error ocurring during the import of DXUSCHEMAS-ADMIN entity via XMGR.","Products":["Business-DEX"]},{"SimCorpReference":"D-74778","ChangeNote":"Front Office API - compliance endpoints: Support multitenancy in api commands.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-73943","ChangeNote":"Corrections made to the residuals calculations for TRS during index decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-74282","ChangeNote":"No actual changes"},{"SimCorpReference":"D-74706","ChangeNote":"Adding rerun to the failed test due to their flakiness","Products":["Business-Match"]},{"SimCorpReference":"D-74707","ChangeNote":"Improve a unit test","Products":["Dates"]},{"SimCorpReference":"D-74530","ChangeNote":"After this change G/L reverse date on Accrued interest transaction will be always set to the next day regardless of the calendar conventions","Products":["Business-GeneralLedger","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-73923","ChangeNote":"Fixed: UDKR contribution fields are not populated","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-73392","ChangeNote":"Two issues are fixed with this change:\nIncluded support for pointer names up to 32 characters.\nIf ref constraint validate is triggered in align objects, parallel attribute needs to be set on both tables in the relationship, for the validation to be done in parallel on partitioned tables. This has been fixed. This change is patched to 24.07."},{"SimCorpReference":"D-74525","ChangeNote":"Fixed estimation of Australian inflation curve in cases with index for previous quarter is not published yet. Inflation curve is always estimated from last known index value instead of last quarter.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-73852","ChangeNote":"Dead Security Lendings positions are no longer being grouped with their underlying during Portfolio Calculation. This should improve performance in situation with \u0022Include zero positions\u0022 set to \u0022Always\u0022 and a lot of dead security lending positions.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-74462","ChangeNote":"There was not possible to delete order created via order API using order API because of warning issued. This fix allows user to ignore the warning and proceed with order deletion.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-74653","ChangeNote":"There was an error in Benchmark Calculation related to the Segment column in the Freely definable Index/Benchmark tab in Benchmark Calculation Settings. The error has been solved.","Products":["Benchmarks"]},{"SimCorpReference":"D-74657","ChangeNote":"Front Office Order cache Service can now be started on external installations","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74540","ChangeNote":"Enable Pre trade compliance API endpoints:\nCheckOverrideStatus, Override, RequestOverride, ValidateSimulatedOrders and ViewDetails","Products":["CsCode-Framework"]},{"SimCorpReference":"D-74710","ChangeNote":"Ignore two tests for DataContext as they are dependent on environment (DB) and are unjustified to fix right now. They are also partially covered with L0 tests.","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-74102","ChangeNote":"Fixed an error in compliance pre-trade regarding various data exceptions for released preliminary transactions. These transactions have already been validated and released but haven\u0027t reached a booked status yet, so they appear in subsequent compliance validations as \u0022working transactions\u0022. Certain fields like “Nominal” or “Counterparty” were missing for “working transactions” and led to data exceptions.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-73499","ChangeNote":"WM interface: In case of Owner-Consumer setup there was a misleading user notification on the consumer instance. This has been fixed.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-74690"},{"SimCorpReference":"D-74648","ChangeNote":"For General Exchange transactions it wasn\u0027t possible to update cost tax, this has been corrected.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-71699","ChangeNote":"Change is rollback so no impact and change.","Products":["Valuation"]},{"SimCorpReference":"D-74317","ChangeNote":"Fixing an index error  that can happen while executing Risk Measurement Backtesting calculation.","Products":["Business-Risk"]},{"SimCorpReference":"D-74384"},{"SimCorpReference":"S-165410"},{"SimCorpReference":"D-74210","ChangeNote":"Book values are rounded up to the required precision after interest appreciation calculations","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-74578"},{"SimCorpReference":"D-70000"},{"SimCorpReference":"D-74312"},{"SimCorpReference":"S-163604","ChangeNote":"Readme file was updated for Transactions RVPs"},{"SimCorpReference":"D-74093","ChangeNote":"Now the counterparty from the last fill is taken during allocation"},{"SimCorpReference":"S-12345"},{"SimCorpReference":"D-74276","ChangeNote":"Add check for installed CSDR module in functions that are responsible for assigning default values on transaction creation.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73647","ChangeNote":"To fix a crash in Corporate Action Synchronization service","CustomerApplyNote":"New function added. Fixed crash on synchronization service.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-73904","ChangeNote":"1) If both transaction code sets are identical, with one or more passive transaction selected, then the active passive code set should return a non-empty list.\n2) Transactions should always be loaded for a portfolio if ActivePassiveDetermination using Transaction code sets is enabled in Branch Configuration.\n3) Active trades should also be detected on rules without grouping ( affects both ActivePassiveDetermination using Transaction code sets and OnlyFailOnActiveTrade logic. )\n4) If ActivePassiveDetermination using Transaction code sets is enabled, always update active/passive determination on each validation, so long as the alert\u0027s current active / passive status is not Active.","Products":["Business-FrontOfficeData","CsCode-OrderManager","CsCode-Compliance"]},{"SimCorpReference":"D-73642","ChangeNote":"This patch will add an extra customer to the list of customers that require to have an extra check for PCL inconsistency.","CustomerApplyNote":"Customer specific patch","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-74545","ChangeNote":"FIX Case# 00377496: Issue on Order manager - data extract service"},{"SimCorpReference":"D-74248","ChangeNote":"Calculation method Canadian is now supported for fixed-rate MIT legs","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-74510","ChangeNote":"Optimization: Using Select as Single Security could be very slow in the a setup where there was many UDKRs","Products":["Instruments","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74272","ChangeNote":"Fixed a null reference exception which could occur in Asset Manager for workflows utilizing the \u0022OutBox Only Selection\u0022 feature.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74336","ChangeNote":"Correct form fmSECFACILITIES in 2T. Put grid on the form.","Products":["StaticData"]},{"SimCorpReference":"D-73599","ChangeNote":"Corrected issue when forecasting in the Asset Manager with Alternative Investments assets","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-73870","ChangeNote":"Corrected the NAV calculation when the foreign exchange is not found","Products":["CsCode-AltInv"]},{"SimCorpReference":"S-161645"},{"SimCorpReference":"D-74440","ChangeNote":"In rare cases the formulas compilation could fail due to a threading issue. The error has been corrected","Products":["CsCode-Framework"]},{"SimCorpReference":"D-74477","ChangeNote":"Fix : Comments from Asset Manager are missing in DE when DE is stopped and then started"},{"SimCorpReference":"D-74252","ChangeNote":"In the \u0027Central Trade Manager\u0027  when a setup was opened that had information  in the \u0027Settings/Options\u0027 - \u0027Messages\u0027 tab in the sections \u0027Match status\u0027, \u0027Match agreed status\u0027 or complete status\u0027 this information was kept always even after \u0027Clearing\u0027 and loading a new setup. This has been fixed.","Products":["Business-InvestmentOperations"]},{"SimCorpReference":"D-72341","ChangeNote":"When simulating an option  in the AM the system uses the independent position price as balance off balance value instead of the premium.","Products":["Instruments"]},{"SimCorpReference":"S-164897","ChangeNote":"[Business description]\nFrom version 24.10 the ‘Use function from = target line’ is not longer valid for the batch task ‘Specific Function - Batch Execution’, as this is a potential security risk.\n\n[Error and warning messages] \nFor \u0027Specific Function - Batch Execution\u0027 the \u0027Use function from = Target line\u0027 will be discontinued from 24.10.\nThe following batch jobs must be updated before upgrading.\n\n[How to correct]\nChange the job to use ‘Use function from = Batch window’ and specify the function to execute in the ‘Function name’ field.\nIf the possibility of executing multiple functions is used, then multiple batch jobs must be created, as each batch job can only execute one function.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-74030","ChangeNote":"Added handling of default for Auxiliary Market Data Max age for Inflation curves","Products":["MarketData"]},{"SimCorpReference":"D-73933","ChangeNote":"Avoid crash when using Auxiliary market data","Products":["MarketData"]},{"SimCorpReference":"D-74422","ChangeNote":"When  using the GetReferenceFilesInformation the result could contain the components for a reference file in a random order. And the tagged reference file name would be wrong","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-73536","ChangeNote":"Add instrument segment as search criterion for fetch party\u0027s information for transaction Netting.","Products":["Business-Netting"]},{"SimCorpReference":"D-74402","ChangeNote":"Selecting a transaction row in the grid in \u0027Unsettled Loan Facility Trades\u0027 and choosing \u0027Settle Loan Facilities\u0027 effects that we generate pre-transaction data by copying the existing transaction\u0027s data from the grid to the latter window. The actual transaction status must not be copied.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73705","ChangeNote":"The setup for using bank accounts is complicated by using the functionality booking across portfolio. Thus, the reporting period holding bookkeeping calculations method included 2 different portfolios, which created input data for two different nominal holding keys.\n\nThe code for defining the correct holding key for the nominal level has been fixed by adding additional restrictions on the Portfolio Cash Management, which is defined on the static date of the Bank account .","Products":["Business-PeriodClosure"]},{"SimCorpReference":"D-74234","ChangeNote":"Fixed crash happening in Structured FRN calculation before or on maturity.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-73538","ChangeNote":"DWH Variables were not applied to Base Mart with design pattern View. Fixed now.","CustomerApplyNote":"Fix process of apply DWH Variables to Base Marts with design pattern View.","Products":["Business-Connectivity","Business-DEX","Business-DWH"]},{"SimCorpReference":"D-69853","ChangeNote":"Actual Settlement data update now suported correct for security lending transactions and its booking. This all making it possible to use NOMINALACT framework to ensure collateral return in sync with actual return of security lended before and covered with the collateral.","Products":["Business-GeneralTransactions","Business-Tapi","Business-Transactions"]},{"SimCorpReference":"D-73361","ChangeNote":"In the case where the decomposition profile used in the compliance calculation has \u0022Distribute residual\u0022 checked on the fund decomposition line(s) AND where the Front Offile Options setting \u0022Decompose fund book value into constituents\u0022 is NOT checked, synthetic cash lines related to decomposition constituents are missing from the compliance results. This has been fixed.","Products":["CsCode-Compliance","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-73796","ChangeNote":"Correcting issue where an error stating \u0027The initial FX rate was not found\u0027 occurred for forward starting cross-currency swaps when doing pricing in PFC with analysis after effective date of such swap.","Products":["Valuation"]},{"SimCorpReference":"D-73882","ChangeNote":"Selecting the \u0022Paydown and forecast transactions\u0022 and/or  \u0022Loan and forecasted transactions\u0022 check boxes no longer excluded forecasted transactions in the Cash Viewer applet of the Asset Manager. This has now been corrected. The checkboxes are available in the \u0022Exclude Payment Types\u0022 section in the \u0022Cash Viewer\u0022 tab of the \u0022Settings Template\u0022 specified in the Properties of the Asset Manager.","Products":["Business-CashManagement"]},{"SimCorpReference":"D-74240","ChangeNote":"Reverted back to the correct approach.","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-74141","ChangeNote":"DWH: Fixed - Execution of schema creation script results in loss of user worksheets in Snowflake","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-73665","ChangeNote":"This is reversal of changes made on D-68649 which unintentionally disabled validation of variable yield adjustments when the P/L method is average-like.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-73922","ChangeNote":"When saving a Securities Lending Maturity\u0027 \u0027MatReverse\u0027 transaction having \u0027Actual Settlement\u0027 data wrongly the error message \u0027Underlying holdings cannot be found. Try modifying the transaction instead.\u0027  could appear. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-74131","ChangeNote":"Close call money was not simulated in the PFC cash flow. Has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-73823","ChangeNote":"Fix performance issues in Order Manager Client for classic orders."},{"SimCorpReference":"D-73867","ChangeNote":"In Order API for FX instruments we cannot use quotation currency we have to use base currency and price currency depending on amount type.\nPR and RC values are now shown in version 2 of the api. DollarDuration PC and RC figure should be blank and not zero","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74176","ChangeNote":"Fixed an issue that would cause a crash in the Data Selector for specific (probably old) data selections","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-73751","ChangeNote":"When the transactions for Bonds are created in Dealer Window the value in Yield is calculated differently after the user removes it. This was corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-74004","ChangeNote":"For APL modules mTRU_FILL and mTRU_GEN don\u0027t add to the module list initially loaded modules.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73927","ChangeNote":"Sometimes during match system could crash due to side effect of the CR  651772. This error has been fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-74192","ChangeNote":"Free code fields that have been renamed by user do not keep the same name in the View Historical Changes screen.  This error has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-73847","ChangeNote":"There was a crash while fetching position in Coupons screen for bonds with Interest type Multiple. That is fixed now","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-73919","ChangeNote":"Fixed a crash when importing domain values using DFS with \u0022Create order fills before importing main dealer transactions\u0022 reformat function.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-74108","ChangeNote":"Even if the ‘Always return error level if job fails’ was checked, the batch job group returned ‘Executed’ instead of ‘Failed’ if one or more batch jobs within the batch job group failed. This has been corrected.","Products":["Framework-Batch"]},{"SimCorpReference":"D-74263"},{"SimCorpReference":"D-74097","ChangeNote":"Selecting a transaction row in the grid in \u0027Unsettled Loan Facility Trades\u0027 and choosing \u0027Settle Loan Facilities\u0027 effects that we generate pre-transaction data by copying the existing transaction\u0027s data from the grid to the latter window. The actual transaction status must not be copied.","Products":["Business-Transactions"]},{"SimCorpReference":"D-73490","ChangeNote":"Fixed Order Outbox update when program trade is not in segment, but its underlying dealer order is.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-74119","ChangeNote":"Fix - Order Manager  - Duplicate FIX orders in NOMA"},{"SimCorpReference":"D-73357","ChangeNote":"Went back to storing decimal defaults such that the typelet can be reused with metadata leaks.","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-73498","ChangeNote":"Global exposure: Initial exposure on conv. bonds positions should be calculated as \u0022delta * dirty value underlying\u0022, where \u0022dirty value underlying\u0022 is calculated as \u0022Number of referenced shares * market value of underlying reference shares\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-74293","ChangeNote":"FlexAnalytics (NFRD package) calculation fails if issuers are not specified on a security and NACE codes are stored on security level. This has been fixed.","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-73871","ChangeNote":"The Validate Market Data Using Service Platform window\u0027s initialization functionality attempt to acquire exclusive database lock on the Market Data Validation Queue (MKTDATAVALQUEUE) table.\nPreviously it did so with a no wait statement and then waited for 6 seconds before trying again. Now it will attempt to acquire the exclusive lock for 6 seconds, and then wait for another 6 seconds before trying again.\nThis should make it more likely to acquire the exclusive database lock.","Products":["Business-FundAccounting","Framework-Database"]},{"SimCorpReference":"D-73877"},{"SimCorpReference":"D-74226","ChangeNote":"Customer specifc fix.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-74153","ChangeNote":"With this fix, MDV database busy during initialization should be reduced","Products":["TradeManager"]},{"SimCorpReference":"D-74241","ChangeNote":"Check of partition groups in scdUpdate did not allowed for deleted groups in new ins file."},{"SimCorpReference":"D-74304"},{"SimCorpReference":"D-74325"},{"SimCorpReference":"D-73930"},{"SimCorpReference":"S-163539"},{"SimCorpReference":"S-163412"},{"SimCorpReference":"D-74152"},{"SimCorpReference":"D-74138"},{"SimCorpReference":"D-74187"},{"SimCorpReference":"D-74134","ChangeNote":"Fixed on D-74136","Products":["CsCode-Framework"]},{"SimCorpReference":"S-161904","Products":["Tools-Progvers"]}]