[{"SimCorpReference":"S-170867","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-77569"},{"SimCorpReference":"D-77374","ChangeNote":"Data Clean-up service crashes with ORA-02292 in compliance cleanup","Products":["Business-Compliance"]},{"SimCorpReference":"D-77394","Products":["Business-Risk"]},{"SimCorpReference":"D-74324","ChangeNote":"Fill Payment Date and Security ID in alert","CustomerApplyNote":"Add Security ID and Payment Data to TPD alerts","Products":["CsCode-Settlement"]},{"SimCorpReference":"D-77238","ChangeNote":"Fix position scope at PS if we modify simulation for holding with Bm \u002B Bm2 position scope","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76614","ChangeNote":"Fixed an error in the Asset Manager, where the position sign of historical model portfolio and benchmark positions was wrong.","Products":["Benchmarks","Business-Modelling","CsCode-FrontOfficeData","CsCode-MiddleOffice"]},{"SimCorpReference":"D-77019","ChangeNote":"Do not ignore rebase factors for XpressInstruments and OTC","Products":["MarketData","TradeManager","Valuation","XpressInstruments","CsCode-AltInv"]},{"SimCorpReference":"D-77434"},{"SimCorpReference":"D-77523","Products":["Business-Cash"]},{"SimCorpReference":"D-77089","ChangeNote":"An error could occur when creating \u0027Payments\u0027 i the \u0027Reconciliation Manager\u0027 in case more than one payment instructions were to be reconciled. This has been fixed.","Products":["Business-Cash","Business-Reconciliation"]},{"SimCorpReference":"D-77030","ChangeNote":"An error could occur in the \u0027Covariance Manager\u0027 in case \u0027Merger\u0027 \u0027Corporate Actions\u0027 existed for at least one of the by the \u0027Risk Factor\u0027 implied securities. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-77320","ChangeNote":"Allocation defaults data sent via AzSB does not contain allocation defaults for Securities lending SCD instrument type which is interpreted as Repo on OM side. This change should fix this and such allocation defaults should be sent."},{"SimCorpReference":"D-75743","ChangeNote":"Support SCD System Variables for the Export folder path pre-saved on Party setup."},{"SimCorpReference":"D-77251","ChangeNote":"Exclude orders with cancelled allocation from being aggregation targets"},{"SimCorpReference":"D-77123","ChangeNote":"An error could occur when trying to load a bond having \u0027Fixings\u0027 and a \u0027Reference rate\u0027 with  \u0027Rate convention\u0027 \u0027Par yield\u0027 into the  \u0027Edit Multiple Securities - Bonds\u0027  window. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-74313","ChangeNote":"Highlighting \u0026 Go to Order function in Order Manager now works properly for classic orders too"},{"SimCorpReference":"S-165972","ChangeNote":"NA"},{"SimCorpReference":"D-76374","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-76960","ChangeNote":"timestamp in om3_de_orders is updated after an order is parked"},{"SimCorpReference":"D-76816","ChangeNote":"The performance for creating OIS fixings has been improved.","Products":["StaticData"]},{"SimCorpReference":"D-77171","ChangeNote":"It is now possible to set the reference Rate Convention to Par yield for other instruments than MIT bonds if the Fixing Frequency results in a longer period than the period for the Payment Frequency. Previously this was not possible as an error message would be issued telling “The reference rate convention for this reference rate cannot be PARYIELD when adjusting fixing frequency is set.","Products":["StaticData"]},{"SimCorpReference":"D-76934","ChangeNote":"Fixed a system performance issue in Compliance that can occur if a lot of “Pool to Portfolio” mappings exist.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77003","ChangeNote":"Upgrade RestSharp from 108.0.3 -  to version RestSharp - 112.0.0","Products":["CsCode-Collateral","CsCode-Compliance","CsCode-DataWarehouse","CsCode-Framework","CsCode-IBOR","Instruments","Mandates","CsCode-MiddleOffice","CsCode-PortfolioManagement","CorporateActions","Reconciliation","CsCode-Trading","CsCode-UP"]},{"SimCorpReference":"D-76998","ChangeNote":"Availability of \u0022Full risk analytics details\u0022 in Rule entry now affected by risk measures inside formulas","Products":["CsCode-Compliance","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-77295","ChangeNote":"During the performance calculation upload results batch job, there was a problem that we were searching for pEXPCOMPTYPE in tHOLKEYS which does not exist in that table. This only happened in certain cases. Now we look in tPERFORMCALC instead","Products":["Performance"]},{"SimCorpReference":"D-76637","ChangeNote":"This change corrects a possible error in the  Performance Calculation in the calculation of the TWR based FIPA local return that could occur at maturity for swaps.","Products":["Performance"]},{"SimCorpReference":"D-77140","ChangeNote":"In Rule Entry, properties which usually require an input dialog, such as ISIN or CUSIP, should pop up a selection list, when used with a List or External List. This had stopped working, but has now been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77199","ChangeNote":"NA","Products":["Business-DWH"]},{"SimCorpReference":"D-77075","ChangeNote":"Incorrect reinvestment service url retrieved in some installations. Fixed","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"S-172540","ChangeNote":"Internal codebase refactoring. Fixed the code to improve all OTC instruments. Changes made to the code do not affect system behaviour.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-77076","ChangeNote":"Added retry on delete of APL core form temporary file.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76966","ChangeNote":"Fix is to allow user to import Funds Certificates when Settlement Days value is null (Ext Settlement Days is not checked)","Products":["StaticData"]},{"SimCorpReference":"D-77209","ChangeNote":"Technical - 3T","Products":["CsCode-Framework"]},{"SimCorpReference":"D-77244","ChangeNote":"Performance improvement","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76587","ChangeNote":"Validating data for Database parameters","Products":["CsCode-UP"]},{"SimCorpReference":"D-76877","ChangeNote":"Optimizations that will speedup a Simulation Macro that uses UDKR\u0027s.  Will also generally improve the Portfolio Sheet if it contains UDKRs","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77044","ChangeNote":"Changed the IMW update functionality to skip importing data sources whose type or subject area is not installed.","Products":["CsCode-Reporting","Business-DWH"]},{"SimCorpReference":"D-77091","ChangeNote":"CA Dashboard can crash with ORA-01628 max # extents reached for rollback segment. Was Fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-77174"},{"SimCorpReference":"D-77220","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77018","ChangeNote":"It decreases memory consumption at AM in case when we have Bm \u002B Bm2 positions scope only","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-76759","ChangeNote":"Fixed problem when we can not use .NET formulas argument name like \u0022Issuer\u0022","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76991","ChangeNote":"\u0027Rounding Rules\u0027 with \u0027Field to be rounded\u0027 set to \u0027Nominal redemption\u0027 did not work anymore. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-77120","ChangeNote":"In installations with enforced portfolio master, the Online compliance applets don\u0027t show any results because of wrongly evaluated auth. on the Online service. This has been fixed.","Products":["CsCode-Basic","CsCode-Compliance","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76963","ChangeNote":"In a very specific case, a placement on an aggregated order, where part of the bundle required override and compliance override, and the other did not required any override, the bundle status was blocked, so that the placement could not proceed after all overrides were complete and accepted. This has now been resolved.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77164","ChangeNote":"There was an error in Benchmark Calculation when executing the type \u0027Update Index/Benchmark using Segment\u0027. The indexes in the benchmark segment was not correctly identified. The error has been corrected.","Products":["Benchmarks"]},{"SimCorpReference":"D-76657","ChangeNote":"Four eye validation would wrongly alert about a change to the transaction - the  solution was to make all necessary data available for the validation to avoid this.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions"]},{"SimCorpReference":"D-77107","ChangeNote":"Fixed a failing DWH Partial Deploy when a target DWH Model didn\u0027t have a schema applied.","Products":["Business-DEX","Business-DWH"]},{"SimCorpReference":"D-75667","Products":["CsCode-MiddleOffice","CsCode-RiskManagement"]},{"SimCorpReference":"D-76900","ChangeNote":"Corrected flaky tests","CustomerApplyNote":"Corrected flaky tests, no action needed","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-76871","ChangeNote":"The userts tablespace is no longer checked and verified during update."},{"SimCorpReference":"D-76669","ChangeNote":"Fixed second benchmark status message and tooltip in case when first benchmark is missing.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-77035","ChangeNote":"Field \u0027line\u0027 on reconciliations applet of reconciliation manager was opened by mistake. Now it is closed again","Products":["Reconciliation"]},{"SimCorpReference":"D-76790","ChangeNote":"NA","Products":["Business-Tapi","Business-ToolsTransactions","CsCode-Transaction"]},{"SimCorpReference":"D-76826","ChangeNote":"When using the \u0027Price method\u0027 \u0027Quoted price \u002B yield curve, structured products\u0027 and having \u0027Use auxiliary market data\u0027 checked in the relevant \u0027Pricing Definition\u0027 line the valuation with this \u0027Pricing method\u0027 erroneously failed in case no \u0027Conv. Adj. vol. curve\u0027 was defined on the relevant \u0027Bond\u0027.","Products":["MarketData"]},{"SimCorpReference":"D-77026","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"S-171219","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76577","ChangeNote":"correcting the validation criteria","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76323","ChangeNote":"This is a client specific fix for a client to address rounding issues","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-76215","ChangeNote":"Enabling calculation of accrued interest, dirty and clean prices for structured bonds that have such high quote that spread calculation is impossible. Applies to pricing of structured bonds with Quoted price \u002B yield curve, structured products pricing method.","Products":["Valuation"]},{"SimCorpReference":"D-77029","ChangeNote":"CA Dashboard service in case having more than 10K publication might crash on Oracle by updating the data. Was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"S-140803","ChangeNote":"The database load generated by the Trade Processing Dashboard service has been reduced.","Products":["Business-SettlementManager","Framework-Database"]},{"SimCorpReference":"D-76750","ChangeNote":"Fix problems with Collateral RVP. RVP was broken by failed try to exclude API tests from it."},{"SimCorpReference":"D-76500","ChangeNote":"The not so useful telemetry information has been removed to avoid spamming.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-75815","ChangeNote":"Fixed an error where the Portfolio/Fund Administration Manager in the Alarms Inbox Applet would not restrict shown alarms based on the corresponding setup in the Setup Applet.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-77017","ChangeNote":"Fixing crash in Yield curve manager that occurs when estimating curve that has several standard contracts with identical maturity dates.","Products":["MarketData"]},{"SimCorpReference":"D-76569","ChangeNote":"With tax buckets, the match calculation, when booking the sell, is done in a different function than usual fifo or lifo.\n Tax bucket was missing a piece of code that prevents errors due to double floating arithmetic issues","Products":["Business-Match","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-76696","ChangeNote":"When saving a bond, it is no longer validated that the coupon and/or redemption frequency is 6M, when using the EOM Convention \u0027Last, no leap\u0027. Furthermore any anchor date can be used together with EOM Convention \u0027Last, no leap\u0027.","Products":["StaticData","Instruments"]},{"SimCorpReference":"D-76917","ChangeNote":"AxR Position Integration batch job does not support reference dates. Fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-76363","ChangeNote":"There were no CLAllow transaction created via create window for some positions when a lot was bought at par, (Put/Call price is par as well). In such case Interest Appreciation should not be calculated. However, CLA (based on factors) should be generated in this case. After this correction we continue with generation of CLA despite the fact that a lot is bought at par.","Products":["Business-SystematicAdjustments"]},{"SimCorpReference":"S-169278","ChangeNote":"Extra info of SQL logging removed just to be align with 2T file logs. But the original message will be logged on Appinsight.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76870","Products":["Tools"]},{"SimCorpReference":"D-76705","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-76962","ChangeNote":"Counterparty ID in DE_ALLOCATIONS now contains the ID not the name"},{"SimCorpReference":"D-76726","ChangeNote":"Update Equity, Futures, Options to show correct reason for not being able to aggregate"},{"SimCorpReference":"D-76720","ChangeNote":"Reducing number of calls to read scenario file, and adding more retries","Products":["Business-Risk"]},{"SimCorpReference":"S-169479","ChangeNote":"Internal. Updated version of Web UC package in SCD"},{"SimCorpReference":"D-76649","ChangeNote":"When saving a Securities Lending Maturity\u0027 \u0027MatRepo\u0027 transaction having \u0027Actual Settlement\u0027 data wrongly the error message \u0027Underlying holdings cannot be found. Try modifying the transaction instead.\u0027  could appear. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-76866","ChangeNote":"When checking the consistency of PCL holdings, the mix of positions with and without the errors led to a program crash on the step of making the error message report. Now it is fixed by aligning the length of faulty fields with the other variables.","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-76957","ChangeNote":"Customer specific correction to Performance Calculation related to a special GIPS composite calculation flow.","Products":["Performance"]},{"SimCorpReference":"D-76697","ChangeNote":"The editor in CustomArgumentsEditorListwas all time in new state. As the CustomArgumentsEditorList is custom editor list, it doe not work in CRUD context. Therefore it will not be switch out from new state. In this context the editor list should be set to be not in new state after create.\n\nThis was failing as in the one value CustomArgumentsEditorList the default value was 0 and in this case IsNew was honored, which is not case in other cases when the CustomArgumentsEditorList was used.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76687","ChangeNote":"\u0022More\u0022 filter button removed for Rule Search (Beta)","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76662","ChangeNote":"Trade Manager: In some cases when FAP segment for OTC swaps contains created date of the contract, OTC swap transaction, created from Front Office simulation,  could be booked on a wrong FAP line. It has been fixed.","Products":["TradeManager"]},{"SimCorpReference":"D-76474","ChangeNote":"Refactor code surrounding building base service load info","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76485","ChangeNote":"Side effect has been fixed to ensure correct autoallocation is done when Total Collateral Result is sent for allocation","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-76765","ChangeNote":"Fix compliance validation preview on place form."},{"SimCorpReference":"D-76863","Products":["Business-Connectivity"]},{"SimCorpReference":"D-76803","ChangeNote":"Previously, if the \u0022Shows checks only for released orders\u0022 setting was checked in Front Office options, then placement validations were only shown in the pre-trade monitor if they had a pending Compliance Override request.\n\nThis has now been changed so that the setting no longer affects the display of placement validations. All placement validations are always shown in the Pre-trade monitor, regardless of whether or not they require compliance override or the above setting has been checked.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76475","ChangeNote":"Fixes for null reference","Products":["CsCode-Framework"]},{"SimCorpReference":"D-76842"},{"SimCorpReference":"D-76616","ChangeNote":"A fix has been made to determine if an active trade indirectly affects a credit risk assignment unit, to ensure that an active transaction on a credit risk assignment unit, which creates an alert on more than one party, will now flag the alerts on all affected parties, as \u0022Active\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76431","ChangeNote":"SupportedAdditionalOperators are updated as not to have Year/Month or DaysofWeek operations for datetime fields in RecociliationResultsFilterEditorList","Products":["Reconciliation"]},{"SimCorpReference":"D-75948","ChangeNote":"The fix suggested in this defect has been reverted. A new solution has been proposed on the defect D-76662.","Products":["StaticData"]},{"SimCorpReference":"D-76933","ChangeNote":"The text of warning message was edited.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-76787","ChangeNote":"It is enable  handling application/xml and text/xml MIME types correctly,","Products":["CsCode-UP"]},{"SimCorpReference":"D-76855","ChangeNote":"Resolved test failure by overriding identity handling in a nested class to bypass domain controller dependency.","Products":["CsCode-UP"]},{"SimCorpReference":"D-76749","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-76850","ChangeNote":"This regards the ‘Securities Finance Manager’. Some database reference path for tTRANSFACILITY  was missing to an outer join condition in the code that updates the transaction data Container.","Products":["Business-SecuritiesFinanceForecast"]},{"SimCorpReference":"D-76743","ChangeNote":"Catch the exception and add telemetry log","Products":["CsCode-UP"]},{"SimCorpReference":"D-76714","ChangeNote":"A non-released error was resolved to ensure that Asset manager Cache  API job can be executed","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-170914","ChangeNote":"Patch refactoring: use better naming in code for reconciliation save results function","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-76865","ChangeNote":"Make APL unit test suite mTEST_MATCHFILTERWEEKLY more stable.","Products":["Business-Match"]},{"SimCorpReference":"D-76730","ChangeNote":"Manual placement in Working state should be cancelled individually"},{"SimCorpReference":"D-76584","ChangeNote":"Fixed, Prevent to add same sessions into the databaseSessions","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-76513","ChangeNote":"Forecasts in  the \u0027Alternative investments manager\\Strategy analysis \u0027  page based on existing positions relating from an \u0027Alternative investments - Internal trade\u0027 transaction transferring a position from one portfolio to another were wrong in the year with the transfer. The error has been corrected.","Products":["CsCode-AltInv","CsCode-MiddleOffice"]},{"SimCorpReference":"D-76629","ChangeNote":"Amend order context menu item should not be available for Placements in Draft State"},{"SimCorpReference":"D-76632","ChangeNote":"OM API service will send an error response with a timeout error type in case it cannot process a heavy request in time"},{"SimCorpReference":"D-76727","ChangeNote":"Problem importing CURCROSSES has been fixed.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-170852","ChangeNote":"Patch C# unit tests for reconciliation auto-fill functionality. No visible changes for user.","Products":["Reconciliation"]},{"SimCorpReference":"D-76857","ChangeNote":"Fix \u0027Unknown Paramter\u0027 error in Model Configuration Parameters window in Data Warehouse Manager","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-75639","ChangeNote":"Fixed bug in Oracle DataWarehouse when a basemart has hundreds of columns","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-76907","ChangeNote":"Correction of flaky tests (no code changes, done in D-76900)","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-76690","ChangeNote":"app.config is added again to the  projects instead of using Framework/app.config as a reference","Products":["CsCode-AltInv"]},{"SimCorpReference":"S-170529"},{"SimCorpReference":"D-76819","ChangeNote":"It wasn\u0027t possible to execute batch jobs when running 3T. This as been corrected.","Products":["Framework-Batch"]},{"SimCorpReference":"S-151352"},{"SimCorpReference":"D-76439","ChangeNote":"PoolFactorsData now is exposed to Front office applications","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-76550","ChangeNote":"Fix for the discrepancy between delivered files and sysobject meta data for AI.Search.Compliance package to work","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76544","ChangeNote":"Not-In-Use-But-Kept fields is wrongly deleted during upgrade. \n\nMade some minor change and added more debug information to get wiser next time this error occur.  When it is not possible to update cnf.ini, the upgrade will fail instead of old behaviour that was ignoring the error.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76775","ChangeNote":"An error in the calculation of synthetic FX hedge returns had the effect that inverted FX rates where used. The error has been corrected.","Products":["Performance"]},{"SimCorpReference":"D-76597","ChangeNote":"This correction changes the headers on the two return columns in the Synthetic FX Hedge Returns window. The text \u0022RC\u0022 is removed from both headers and they are now \u0022Base return\u0022 and \u0022Price return\u0022. The window does not specify any reporting currency and thus it was a source of confusion that the headers had \u0022RC\u0022 in them. Further, the number of decimals is changed from 8 to 12 to allow for higher precision.","Products":["Performance"]},{"SimCorpReference":"D-76489","ChangeNote":"Configuration transport: An error was detected in the Compliance Configuration transporter (CMPLCONFIGURATION). The error means that when importing a Compliance Configuration record into a target installation where this does not exist, the new record will not be created correctly in the target installation. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-76899","ChangeNote":"Fixed flaky unit test.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"S-169682","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-76833"},{"SimCorpReference":"S-170569"}]