[{"SimCorpReference":"D-94465","ChangeNote":"Update CBU related to sunsetting OAYSYS functionality. 2 more interfaces included in the check and changed severity of interfaces, from warning to error.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-94268","ChangeNote":"Add a delay when between attempts to reconnect to the Message Broker"},{"SimCorpReference":"D-93073","ChangeNote":"When executing Data Warehouse Load Plans containing Star Marts, with the classic version of Qlik Sense configured: a Connection to Qlik Sense is now reused across Load Plan Executions. This is because Qlik Sense cannot close the connections promptly on the server after they are closed from the client. So this change is needed to avoid running out of available sessions, in case many Load Plans with Star Marts are executed back to back.","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-93848","ChangeNote":"Disabled L0 tests consuming broken external dependency","Products":["CsCode-UP"]},{"SimCorpReference":"D-93558","ChangeNote":"fixed findings in apigw and ims","Products":["CsCode-UP"]},{"SimCorpReference":"D-93683","ChangeNote":"Webrequestcustom CDL function: Issue with \u0022multipart/form-data\u0022 content type in webrequestcustom CDL command fixed.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-93603","ChangeNote":"Fix crash in Performance calculation with NAV Performance, PCL framework and no dividends matching dates condition.","Products":["Performance"]},{"SimCorpReference":"D-93661","ChangeNote":"Support Data Warehouse Schema Connections with Managed Identity Storage Authentication when the Schema Connection is stored in a Key Vault","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-92213","ChangeNote":"gMSA account used to start service agents, and thereby starting services, must have a UPN assigned. This UPN will be used as the identity for the endpoints of the service. The endpoints will use FQDN instead of IP address. These changes will enable use of Kerberos for client and service authentication.","Products":["CsCode-Framework","CsCode-SystemOperation","Framework-CoreFramework"]},{"SimCorpReference":"D-93602","ChangeNote":"No functional change - add logging to hedge ratio calculation in Asset Manager","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-93940","ChangeNote":"Disable faulty test","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-92678","ChangeNote":"Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation could use old Model Portfolio Components after they were released from Asset Manager and MPC comments are used. Latest components are always used after this change. Prepare FO Modelling and Model Portfolio-Portfolio Transaction Generation is performed after MPC comments are saved.","Products":["Business-Modelling","Business-PortfolioManagement","CsCode-FrontOfficeData"]},{"SimCorpReference":"S-218755","ChangeNote":"Remove quote factor from the cash flow amount calculation for swap like instruments in the Trade Manager.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"S-214356","ChangeNote":"Migrate SQL Server to the new landing zone."},{"SimCorpReference":"S-214682","ChangeNote":"Added a CBU program, to ensure that portfolio life-cycle dates obey the validation restrictions in the Business Entities screen.\n\nThis is relevant due to a conversion program included in the upgrade to versions 26.01 and later, which creates new business entities based on the portfolios.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-92647","ChangeNote":"Show execution Plan was not working in some cases when using an OAuth schema","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-93546","ChangeNote":"CDS Security IMW Dimension - condition for CDS moved to extra tab in DEX"},{"SimCorpReference":"D-93623","ChangeNote":"portalIdAvailable did not return the right results","Products":["Framework-Authorisation"]},{"SimCorpReference":"D-93543","ChangeNote":"When working with Multiple payment screen the settlement defaults with other bank accounts are shown. Has been fixed.\n\nThis was earlier working for other screens where bank account is an instrument, but not for Multiple payments.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"D-93372","ChangeNote":"Orders auto-allocated outside of schedule when automation service is running for multiple days. fixed"},{"SimCorpReference":"D-93564","ChangeNote":"Parametric VaR was not calculated due to not existing setting \u0022Disable FX Option adjustments\u0022 in Asset  Manager and Compliance Manager. Crash has been fixed, and now Parametric VaR is calculated","Products":["Business-Risk"]},{"SimCorpReference":"D-91993","ChangeNote":"Only active messages that take into account  the \u0027Official CA Event Reference\u0027, are considered as the basis for MT565 creation","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-93340","ChangeNote":"In case of reversals Reconciliation result is updated with new payment reference. Now a reference to active transaction is updated as well.","Products":["Business-Cash","Business-Reconciliation"]},{"SimCorpReference":"D-93495","ChangeNote":"After doing \u0027Truncate business data\u0027 some database constraints could be missing (disabled). This has been corrected.","Products":["Business-TruncateBusinessData","Framework-Database"]},{"SimCorpReference":"D-90039","ChangeNote":"Fixed a crash that occurred when both legs of an FX position were not present while using an advanced accounting view","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-88777","ChangeNote":"Fix deadlock during multiple block trade allocations coming.","Products":["Business-PortfolioManagement","TradeManager","Framework-MessageQueue"]},{"SimCorpReference":"D-92069","ChangeNote":"Adding MDST calculation data for Market Data Stress Test Import Configuration","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-93270","ChangeNote":"Update of autotest. This will not affect any customers.","Products":["Framework-Services"]},{"SimCorpReference":"D-92945","ChangeNote":"Create an apl core on ambiguous index error.","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-93074","ChangeNote":"Use the same rounding rule for the Price field in the Amend Allocation form as in Allocation."},{"SimCorpReference":"D-93301","ChangeNote":"A crash happened when saving the order after selecting a predefined comment via F4 in the \u0027Multiple Portfolio Orders\u0027 window. This has now been corrected.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-93080","ChangeNote":"API Gateway\u0027s embedded .net runtime was upgraded to version 8.0.21"},{"SimCorpReference":"D-92619","ChangeNote":"Handling Lock not obtained db error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-92545","ChangeNote":"Batch task = Performance Calculation - Upload Results: Improved system performance during initialization phase.","Products":["Performance"]},{"SimCorpReference":"D-92951","ChangeNote":"After removing the configuration parameter \u0027Nominal framework methods enabled\u0027 in \u0027Show Installation Parameters\u0027 =\u003E \u0027\u0027Transactions\u0027 in 26.01, the CBU error was revealed when testing an upgrade to 26.01 as a preview drop. To avoid it, the usage of the configuration parameter is now disregarded in the lower versions. This will not affect the customers installation, since the functionality has been already enabled by default earlier.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-90429","ChangeNote":"The Rule entry - Credit Risk fields Collateral, issuer risk and Collateral, cpt. risk have now been re-enabled for holding base rules.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-92674","ChangeNote":"Do not create extraction definitions for standard base marts if subject areas of those are not installed.","Products":["Business-DWH"]},{"SimCorpReference":"D-92072","ChangeNote":"Fix for Custom Analytics fact to avoid key violation"},{"SimCorpReference":"D-92298","ChangeNote":"Removed or updated package dependencies in the LFT client package.","Products":["CsCode-UP"]},{"SimCorpReference":"D-85775","ChangeNote":"Tolerance in flex pi data increased to 6 decimal points","Products":["CsCode-FlexPi"]},{"SimCorpReference":"D-91867","ChangeNote":"Hide Fixing date for non deliverable FX Allocate"},{"SimCorpReference":"D-92162","ChangeNote":"Use high precision arithmetic  when  calculating order amounts.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-92179","ChangeNote":"Corrected FIX tag 57 for classic single program orders","CustomerApplyNote":"Fix the value sent in tag 57 for Classic Program Single Orders"},{"SimCorpReference":"D-92468","ChangeNote":"The TAPI APL JSON deserializer expects all the properties defined in tapiFldsListOfFlds to be specified in each node. The TAPI C# serializer must ensure that any property having a null value is included in each node to avoid crashes on the APL side.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-92276","ChangeNote":"Solve referenced child record crash in risk alert cleanup","Products":["Business-Risk"]},{"SimCorpReference":"D-91379","ChangeNote":"Making reconnect more robust and not throwing as many error logs","Products":["Framework-Database"]},{"SimCorpReference":"D-92207","ChangeNote":"We increased risk factor name field length when writing to volatility and correlation files","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-89654","ChangeNote":"Client specific correction that relates to calculation of statistical key ratios in Performance Measurement, Performance Manager and Performance Reports.","Products":["Performance"]},{"SimCorpReference":"D-90425","ChangeNote":"For Total Return Swaps with quote factor different than 100, the rates were wrong for the sub-fixing of \nthe non-TR leg on the period end date.","Products":["StaticData"]},{"SimCorpReference":"D-92157","ChangeNote":"The code checking if a command is installed has been optimized.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-92018","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations","Products":["CsCode-SimTest"]},{"SimCorpReference":"D-85967","ChangeNote":"Cleanup in Transactions RVP since the AplTest.cake used there is somewhat out of date due to changes to how APL L1 tests are run locally - that is not needed in RVP"},{"SimCorpReference":"S-212968","ChangeNote":"NZD Business center was added in 25.10 SCD version. With this change we have patched NZD Busines center to lower versions, down to 24.07. Patch includes the reference to an updated version of ccdsmktdata.dcf in external-files.json. This will update the business centers list with with only one new record for 1 NZBD business center."},{"SimCorpReference":"D-92068","ChangeNote":"Providing wrong credentials should not result in an errorlog/crash, but rather a handled exception.","Products":["CsCode-AplInterface","CsCode-Framework"]},{"SimCorpReference":"D-91650","ChangeNote":"In the \u0027Portfolio Calculation\u0027 \u0027Simulated unrealised hedge depreciation QC/PC\u0027  was not calculated in case a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-91408","ChangeNote":"Rounding for Interest in Securities Lending Maturity transaction window was corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-88825","ChangeNote":"Fixed Nominal in Modify position window to respect current Percentage change on Incremental update","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91593","ChangeNote":"When \u0027Executing \u0027 a \u0027Rebalancing\u0027 setup with \u0027Rebalancing type \u0027Currency overlay\u0027 and having \u0027Decompose funds\u0027 checked the error message \u0027You are trying to rebalance a setup containing unsupported instrument type(s)...\u0027 could wrongly also appear for decomposed positions. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-89842","ChangeNote":"Added more info when an rare occurring error happens","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-85238","ChangeNote":"When a transaction is modified on a high status with a auxiliary job that has Now (outside commit sequence) then there is a timing issue that can trigger that the cancel job on the reversed transaction is triggered twice. This has been corrected.","Products":["Business-AuxJobFramework","Business-GeneralTransactions"]},{"SimCorpReference":"D-91425","ChangeNote":"When a SimCorp Dimension installation have too many open alerts (\u003E 10.000) the Business rules alerts service could become unresponsive during processing of alert changes and therefore were shutdown by the service platform. The error has been fixed. In addition the service now logs a warning before every new change processing  in case the SimCorp Dimension installation has more than 10.000 open alerts.","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-91567","ChangeNote":"When executing the batch job task \u0022Performance Calculation - Upload Results\u0022 having \u0022Upload decomposed funds\u0022 checked in the referenced \u0022Investment Analytics Service - Data Source Configuration\u0022, a program error would occur in the case an Attribute Configuration was not set up for the investment analytics service. This has been resolved.","Products":["Performance"]},{"SimCorpReference":"D-91302","ChangeNote":"This regards transactions from the window ‘Exercise FX Options’ and similar transactions  in the Trade Manager. The calculation of the settlement amount as a sum of amount components should not be altered in the classical window.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-90306","ChangeNote":"FX placement now can be auto-allocated when done for day flag is received"},{"SimCorpReference":"D-91249","ChangeNote":"In the \u0027Portfolio Calculation\u0027 wrongly an error message complaining about missing prices could appear, incase a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-90319","ChangeNote":"When finding the settlement date for an XpressInstrument via Capture Trade in the Order Manager, the holiday calendar specified for the instrument was not taken correctly into account.","Products":["Valuation"]},{"SimCorpReference":"D-90320","ChangeNote":"When scrolling over templates in AM Settings Template, Cash Viewer tab display is updating.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90621","ChangeNote":"OM Automation service to use unmanaged oracle driver to be consistent with the rest of OM"},{"SimCorpReference":"S-206807","ChangeNote":"Update OASYS CBU to handle auxiliary job definitions.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-90638","ChangeNote":"In the Asset Manager (Order Outbox applet), data is not displayed when the user changes the default role. The resolution is to consume the User Context in the Authorization Handler Provider class.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-208961","ChangeNote":"CBU waring message for deprecated reporting pool data fields","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-91016","ChangeNote":"For External and Internal message queues updated a mechanism that check if the data received from DB is correct and non-ambiguous. Add solution for cases when we retrieve only one data row with data info for requested transaction number.","Products":["Business-STP"]},{"SimCorpReference":"D-90758","ChangeNote":"The CBU routine for moving past version 24.07 could report a false positive about 4-Eyes approvals needing changes even when no approvals existed. This has been fixed.","Products":["Framework-Audit"]},{"SimCorpReference":"D-90444","ChangeNote":"Apply price rounding correctly when allocating multiple Future placements from OM","CustomerApplyNote":"Apply price rounding correctly when allocating multiple Future placements from OM"},{"SimCorpReference":"D-90991","ChangeNote":"In some situations the message queue service did not respect the creation order of messages within a discrete group. This has been corrected.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-86010","ChangeNote":"Crash in Asset manager after deletion of FX Swap simulation. Fixed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-90955","ChangeNote":"Fixed a possible crash in order auxiliary job functionality. The crash could happen during the order update when the aux job fields include some security static data field.","Products":["Business-AuxJobOrders","Business-PortfolioManagement"]},{"SimCorpReference":"D-90894","ChangeNote":"When the same risk factor was mapped to multiple positions and imported sensitivities were used for pricing risk models (e.g., Monte Carlo, Historical), the imported sensitivities were taken incorrectly from Key Ratios Calculation =\u003ERisk Factor Sensitivities. This issue has now been corrected.","Products":["MarketData"]},{"SimCorpReference":"D-90899","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations"},{"SimCorpReference":"D-90768","ChangeNote":"A correction is made to the factor based FIPA fair cash flow on decomposed spot legs of IRF positions in Performance Calculation. This affects the fair cash flow itself as well as the factor based FIPA local return, when this is calculated using the TWR based approach. The correction ensures that the cash flow adjustment is consistently based on exposure, which removes spikes in the factor based FIPA local return on decomposed IRF positions on days with buy or sell transactions.","Products":["Performance"]},{"SimCorpReference":"D-90791","ChangeNote":"When using the formula function  \u0027gettransfreecom\u0027 an unexpected amount of whitespaces was added. This has been fixed.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-90558","ChangeNote":"Rounding rules were not applied to the suggested margin amount for Margin Call with Return/Recall actions when the setting in Collateral Manager setup =\u003E Collateral Calculations =\u003E \u0022Ignore MTA and rounding on full return/recall amount\u0022 is On. It was fixed.","Products":["Business-Collateral"]},{"SimCorpReference":"D-90718","ChangeNote":"A problem with generic payment matching using manual payment reconciliation and external netting was found and fixed","Products":["Business-STP"]},{"SimCorpReference":"D-90774","ChangeNote":"A crash could occur when creating swap orders from simulations via the Asset Manager. This was due to missing swap legs. The error handling has been improved and a proper error message is now provided instead.","Products":["TradeManager"]},{"SimCorpReference":"D-89819","ChangeNote":"CompetingBids now contains quotation type IndexedPrice for received FIX bids with PriceType Price when instrument quotation type is IndexedPrice"},{"SimCorpReference":"D-90300","ChangeNote":"For External and Internal message queues add a mechanism to check if the data received from DB (that is used to update Int and Ext message queues) represents the correct \u0022Security\u0022 in scope of the requested \u0022Transaction No\u0022.","Products":["Business-STP"]},{"SimCorpReference":"D-89995","ChangeNote":"Fix crashes on mapping counterparty exposure responses on Order Manager - Order service."},{"SimCorpReference":"D-88617","ChangeNote":"Technical changes to resolve an internal automatic test issue. No changes to any business logic.","Products":["Performance"]},{"SimCorpReference":"D-89887","ChangeNote":"buffer size for  streamreader for DatabaseTypeConversionUnManagedInternal.ToCharArray() method was increased from 1024 bytes(default) to 16384 bytes to improve performance for PKR Service that uses queue handler worker services","Products":["CsCode-Framework"]},{"SimCorpReference":"D-90259","ChangeNote":"When modifying a \u0027Reallocation Collateral\u0027 transaction, based on a \u0027Bond\u0027 with \u0027Quotation\u0027 \u0027Dirty price\u0027 it could happen that the \u0027Current Value xC\u0027s were filled wrongly along  with that. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90005","ChangeNote":"Fixed disposal of named pipe in logger so it no longer crashes during shutdown"},{"SimCorpReference":"D-89890","ChangeNote":"Excluding initial holding record from the scope of the correction made on D-70970. The initial holding record shouldn\u0027t be merged with other holding records if the holding becomes dead.","Products":["Business-FundAccounting","Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-90056","ChangeNote":"The storage option \u0027drop all storage\u0027 has been added when truncating tables.","Products":["Framework-Database"]},{"SimCorpReference":"D-88615","ChangeNote":"Lock the records in the db until the user finished with his updates and if there is a case of concurent updates notify a user whos changes didn\u0027t pass to redo the operation and the Approval window will be closed","Products":["Business-CorporateActions"]},{"SimCorpReference":"S-198287","ChangeNote":"Create CBU to inform users that OASYS records can no longer be processed.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-88698","ChangeNote":"Internal changes with no affect on customers functionality.","Products":["Business-HedgeAccounting"]},{"SimCorpReference":"D-89118","ChangeNote":"MUCS outgoing messages only on subscribers for flex pi data numerics table. Reduce MUCS load on flex pi data import","Products":["Business-FlexPi"]},{"SimCorpReference":"D-89789","ChangeNote":"Better error handling of sub formulas.","CustomerApplyNote":"This change affects the way formulas of type \u0022Key Ratio Mapping\u0022 are calculated. Before this change, formulas calling other formulas that returned an error AND the erroneous formula is also called on its own, the formula calling the erroneous formula was not marked as erroneous as it should. Now these kinds of formulas will also return an error.\nThis change can affect the output from “Pricing and Key Ratios Calculations”.\nExample of a case that will work differently. F1 is calling F2. F2 fails (perhaps for some rows only). If the formulas are requested to be calculated in the order F2 then F1, then F1 did not fail even though there were errors in F2.","Products":["Framework-Formulas"]},{"SimCorpReference":"D-89859","ChangeNote":"An error could occur in the \u0027Portfolio Calculation\u0027 in case \u0027Adjustment frequency\u0027 was not set to \u0027\u0027No adj.\u0027 and in case at least one \u0027Hedge\u0027 position with Hedge adjustment\u0027 \u0027Freeze\u0027 and \u0027Hedge risk free price adjustment method\u0027 \u0027Dollar offset - Retrospective (constant spread and curve)\u0027 was supposed to be calculated. This has bene fixed.","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-89089","ChangeNote":"Make sure the full error message is returned when an order validation fails via the API","Products":["CsCode-Compliance","CsCode-PortfolioManagement","Business-Compliance","Business-PortfolioManagement"]},{"SimCorpReference":"D-89241","ChangeNote":"Risk Measurement. Ignore adjustment factors for FX Options in case of Imported Sensitivities calculation","Products":["Performance","Pkr","Business-PortfolioCalculation","PositionBasedCalculation","Business-Risk","Valuation"]},{"SimCorpReference":"D-89960","ChangeNote":"An error could occur when trying to delete \u0027Formula values\u0027 setup via DFS. This has been fixed.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-89699","ChangeNote":"Enable IMW Compare in DWH Developer Mode","Products":["CsCode-Reporting"]},{"SimCorpReference":"D-88894","ChangeNote":"Enhanced mechanism for filling  \u0022Security\u0022  fields in cases  when transactions from different portfolios with identical \u0022Trans No\u0022 s can be involved in match process for a single SWIFT message","Products":["Business-STP"]},{"SimCorpReference":"D-89990","ChangeNote":"Data Ingest Service fails on BM upload after Primary index currency change to Primary reporting currency from Data Source Configuration. Error was fixed.","Products":["Performance"]},{"SimCorpReference":"D-89826","ChangeNote":"Fixed crash in Alert Inbox caused by recent change of TreeNode id type","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-89132","ChangeNote":"When a bond was bought at par and had put/call price is also at par, and when Maturity simulation is Put/Call, there was problem with generation of Mathematical adjustment transaction after user manually inserted amounts on the previous Math. Adj. transaction. This error was corrected here. Now for such cases when initially there was no amortisation(a security is bought at par), but a user manually inserts the needed adjustment amounts, the presence of Put/Call data is not preventing generation of subsequent Mathematical Adjustment transactions.","Products":["Business-SystematicAdjustments","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-88173","ChangeNote":"Fix SonarQube issue","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-87667","ChangeNote":"Fix the insufficient memory error by splitting the covariance import into chunks.","Products":["Business-Risk"]},{"SimCorpReference":"D-89695","ChangeNote":"Fix a crash when enabling \u0022Decompose structured bonds\u0022 in Position Analysis and calculating / updating the data","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-88711","ChangeNote":"Implemented mechanism to avoid filiing the \u0022Portfolio\u0022  fields in cases  when transactions from different portfolios with identical \u0022Trans No\u0022s can be involved in match process for a single SWIFT message.","Products":["Business-STP"]},{"SimCorpReference":"D-87751","ChangeNote":"Netting manager shows negative amount for some netted transactions. This was fixed","Products":["Business-Netting"]},{"SimCorpReference":"D-89084","ChangeNote":"An issue occurred in the \u0027Position Analysis\u0027. When a \u0027Pricing profile\u0027 with fund decomposition and a \u0027Decomposition profile\u0027 was applied. The order of the \u0027Component types \u0027 was altered after updating the analysis, while other attributes (e.g., the order of the Issuer\u0027) remained unchanged. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-89026","ChangeNote":"Fix for Transaction not being released despite calling Abort transaction","Products":["CsCode-Framework"]},{"SimCorpReference":"S-202735","ChangeNote":"Check that there are no duplicate Dividend IDs against existing securities in Capital Events window under Equities static data","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-89339","ChangeNote":"DWH: Use bind variables when executing the SQL extracting data from SCDAT","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-87636","ChangeNote":"Value that is saved in \u0022Change date\u0022 is taken by another way.","Products":["Business-Cash","Business-Match","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-88844","ChangeNote":"Resolved an issue where information messages related to the max age functionality in the decomposition flow would sometimes be incorrectly shown on rows where they did not belong.","Products":["MarketData"]},{"SimCorpReference":"S-205260","ChangeNote":"field id PORTFOLIO_MANAGER in BD_PORTFOLIO is depreciated and removed from standard model"},{"SimCorpReference":"D-89289","ChangeNote":"Enable IMW Deploy in DWH Developer Mode","Products":["Business-DWH"]},{"SimCorpReference":"D-89190","ChangeNote":"Improved performance of fix allocation processing"},{"SimCorpReference":"D-88872","ChangeNote":"Changes in the error message text only that appears on the internal trade","Products":["Business-Transactions"]},{"SimCorpReference":"D-88211","ChangeNote":"To fix an issue when currency field in Election Defaults is not considering the Option currency on applying the defaults","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-88583","ChangeNote":"Change criteria for finding Initial FX rate to account for settlement days","Products":["Valuation"]},{"SimCorpReference":"D-86958","ChangeNote":"NextLink functionality for DWH Apis added","CustomerApplyNote":"NextLink functionality for DWH Apis added","Products":["CsCode-Framework","CsCode-PortfolioManagement","CsCode-UP"]},{"SimCorpReference":"D-89052","ChangeNote":"Adding ORA-42294 to the error handling when creating a role that already exists","Products":["Framework-Database"]},{"SimCorpReference":"D-88496","ChangeNote":"Hidden pTRAQUOTE field is cleared during sim to transaction flow to prevent logic execution which depends on this field when user modifies transactions in the form","Products":["Business-DealerSecurityTransactions","Business-Transactions"]},{"SimCorpReference":"D-87083","ChangeNote":"FX order update handling in Asset Manager Order outbox applet is optimized. New configuration is added to Asset manager settings template to control Order update events  throttling threshold. Default value is 5 seconds. New configuration is added to SCD 25.10.","Products":["Business-PortfolioManagement","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-88287","ChangeNote":"Adjustments to the fields’ post-change logic for the ‘Reallocation Collaterals’ window.","Products":["Business-Transactions"]},{"SimCorpReference":"D-87669","ChangeNote":"Optimization of database query for transaction list in Alerts Inbox","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87331","ChangeNote":"Fix threading issue when \u0022Goto Order\u0022 is used in conjunction with Accepting multiple orders from inbox"},{"SimCorpReference":"D-88161","ChangeNote":"Rule scope filter should work properly in conjunction with another condition in Within clause","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-85968","ChangeNote":"Refinitiv interface: Updated Real-Time SDK (EMA) to version 2.2.3.1 and its dependencies to the latest supported versions.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-88778","ChangeNote":"No visible changes for user. After changing Product Area names update product map file. The changes are:  1. Enrich \u0026 Reconcile -\u003E Reconcile \u0026 Trade Lifecycle\n2. Lifecycle \u0026 Settlement -\u003E Corporate Actions"},{"SimCorpReference":"D-87805","ChangeNote":"Added correction to the Cancel and Correct window for the case where the Pool factor is repeatedly updated","Products":["Business-Transactions"]},{"SimCorpReference":"S-197392","ChangeNote":"Internal testing tool for Alternatives Release Verification Pipeline. Rerun flaky tests to reduce developer time spent on false positives"},{"SimCorpReference":"D-87416","ChangeNote":"Client will now show forward-based form when manual allocating spot with non-zero ticks"},{"SimCorpReference":"D-88337","ChangeNote":"Swift MX LAU validation could fail when incoming message contained  the caret \u0027^\u0027 character. This is now fixed.","Products":["Business-Connectivity","Business-Swift","CsCode-Mediator"]},{"SimCorpReference":"D-88265","ChangeNote":"Fix for a crash that would happen when opening Deal Capture Bonds","Products":["Business-HedgeAccounting","Performance","Business-Transactions"]},{"SimCorpReference":"D-87046","ChangeNote":"When creating \u0027MatRepo\u0027 transactions using the \u0027Create Securities Lending Transactions\u0027 window the \u0027Redemption Factor\u0027 was wrongly always determined as 0. This has been fixed.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-87902","ChangeNote":"Accrued interest has been excluded from the list of modified fields during the matching process for Dealer FX Forward transaction codes.","Products":["Business-Match"]},{"SimCorpReference":"D-87654","ChangeNote":"User Marts load outputs reports in a single file (instead of multiple parts) with correct file extension","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-87397","ChangeNote":"Add Pricing Profile IK to source keys to avoid key violation in some specific scenarios"},{"SimCorpReference":"D-88208","ChangeNote":"A failed upload of Performance Calculation - Upload results will no longer block Performance Measurement from running. When the Performance Measurement is looking at latest execution of the Performance Calculation it will exclude all executions of type \u0022Upload to PERFaaS\u0022","Products":["Performance"]},{"SimCorpReference":"D-88189","ChangeNote":"For AUTPROFILES PMGIK should be excluded if the installations do not support multiple portfolio masters.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-87280","ChangeNote":"When saving securities lending like transactions in the Trade Manager period closure dates and definition was not added for underlying legs. It also not possible to apply privileges to a securities lending like transaction in the Trade Manager.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-86855","ChangeNote":"Add opportunity to create empty bm files, even if on uncalculated date","Products":["Business-Risk"]},{"SimCorpReference":"D-87959","ChangeNote":"Create manual compliance failure alert in some cases happens where Branch column has no value and it effects directly on the setting up a cause for the alert.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-84609","ChangeNote":"When Decompose derivatives, Calculate synthetic interest and Decompose index contracts is selected in performance calculation, the cash flow values for constituents also include Decomp synth accrued interest xOD, according to the cash flow timing setting in the performance calculation. Previously that only applied to the component type Spot (decomposed to constituents), but not Constituent from spot.","Products":["Performance","Framework-Database"]},{"SimCorpReference":"D-87752","ChangeNote":"When reconciliation tries to do a one side matching it could count results that were marked as deleted. This could lead to one side matching when amount is not netted to 0. This error was fixed","Products":["Business-Reconciliation","CsCode-UP"]},{"SimCorpReference":"D-87904","ChangeNote":"Crash in Asset Manager on displaying PFC status in some specific cases. Fixed.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87491","ChangeNote":"Check service config on launching thread"},{"SimCorpReference":"D-87607","ChangeNote":"After this change it will be possible to reconcile using the reconciliation free code fields also when re-executing with \u0022replace\u0022 or \u0022append\u0022 on the internal side. For external side, only \u0022keep\u0022 is supported\u0022.","Products":["Business-Reconciliation","CsCode-Framework","CsCode-Trading"]},{"SimCorpReference":"D-87794","ChangeNote":"N/A","Products":["CsCode-Trading"]},{"SimCorpReference":"D-85926","ChangeNote":"Fix random selections in Source Fields grid after statement change , scroll and other row selection.","Products":["Business-DEX"]},{"SimCorpReference":"D-87582","ChangeNote":"Flaky test ignored","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-87792","ChangeNote":"Reenable test. Time out due to agent","Products":["CsCode-Trading"]},{"SimCorpReference":"D-87789","ChangeNote":"Fix a vulnerability in showing SWIFT messages","Products":["Business-Transactions"]},{"SimCorpReference":"S-196702","ChangeNote":"New Check Before Upgrade","Products":["Tools-UpgradeProgram","Business-FrontOfficeData","CsCode-UP"]},{"SimCorpReference":"D-87637","ChangeNote":"The issue is fixed by adding an extra check in the code.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-87651","ChangeNote":"Auxiliary double check job for US MBS Pools didn’t work correctly when creating trade via External client trade window and having parameter ‘only status changed’ set to Yes. It was fixed.","Products":["Business-AuxJobFramework","Business-AuxJobTransactions","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-87674","ChangeNote":"Disabled performance tests. Changes made to the code do not affect system behavior.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-83706","ChangeNote":"The created date timestamp could be later than the changed date timestamp on finance transactions, when using the \u0022Finance booked and GL holding update\u0022 transaction status job. The error has been corrected.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-87562","ChangeNote":"Standard Product with the Index which had Termination Date = 20-06-2025, was removed from the SpecFlow tests","Products":["CsCode-Trading"]},{"SimCorpReference":"D-87301","ChangeNote":"Added two null guards to protect code from crashing in DataLayerClients","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87038","ChangeNote":"The sanity check for the loan facilities tables has been revised. Previously, it was incorrectly triggered when the substitution framework functionality was used.","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-86801","ChangeNote":"Added retaining of the \u0022selected\u0022 state of the Use Outbox Selection button when switching layout/setup","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-87473","ChangeNote":"Fixed an error in the fund decomposition area, where the decomposition profiles \u0022Max Age\u0022 functionality would sometimes exclude too many components.","Products":["Decomposition","MarketData","Business-PortfolioManagement"]},{"SimCorpReference":"D-87437","ChangeNote":"Fix error in TRS reset functionality \nPatch the fix from D-81197 to 25.01.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-87139","ChangeNote":"Fixed filtering out direct brokers for FX \u0026 FI orders"},{"SimCorpReference":"D-87344","ChangeNote":"\u0022Permission to establish database connection has not been granted\u0022 was returned when after writing a new password if the password was reset. This has been corrected.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-87447","ChangeNote":"Transaction List in Alerts Inbox can be a huge and that impacts performance. We need to limit how much we can load, max 1000 transactions and not older than 1 month.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87297","ChangeNote":"When decomposing an index contract in the Portfolio Calculation the end of day nominal weights were scaled incorrectly with the effect that among others the \u0027Clean Value QC/PC\u0027 and the \u0027Balance Nominal/Number\u0027 were  incorrectly calculated. This has been fixed.","Products":["Benchmarks"]},{"SimCorpReference":"D-87163","ChangeNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","CustomerApplyNote":"Made a performance enhancement for loading the Event Status in the Fund Administration Manager","Products":["CsCode-FundAccounting"]},{"SimCorpReference":"D-86804","ChangeNote":"Fixed 2nd Benchmark validation error being shown and preventing from saving changes on the Settings Template when multiple Settings Templates are loaded and being toggled, modified and saved iteratively while having blank Benchmark fields","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86352","ChangeNote":"The crash in the PFC that could occur for positions that have internal sell transactions is fixed by this development.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-195786","ChangeNote":"Fixed Missing InsType Invalidates IMW Swap Security Dimension","Products":["CsCode-Framework"]},{"SimCorpReference":"D-85223","ChangeNote":"In certain specific cases, the user role password could unintentionally be part of a memory dump. This has now been corrected.","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"D-87037","ChangeNote":"Trim long message about multiple force finished orders, so that it does not crash the message service","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-86119","ChangeNote":"Remove default query on active passive determination","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-87186","ChangeNote":"The memory execution of segments when applying settlement defaults for many transactions has been optimized. E.g. when applying settlement defaults for forecasted transactions generated during a portfolio calculation.","Products":["Framework-Segments"]},{"SimCorpReference":"D-86844","ChangeNote":"Fixed an error that prevented a user from manually deleting compliance list limits when the option \u0022Keep limits when a list element is removed\u0022.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86329","ChangeNote":"The \u0022Price compensation\u0022 fund event did not work, when a multi-class fund invested in a pool fund. The error has been corrected.","Products":["Business-FundAccounting"]},{"SimCorpReference":"S-196799","ChangeNote":"Patch for feature E-33870 to 21.01 was implemented","Products":["Performance","Business-Risk"]},{"SimCorpReference":"D-86909","ChangeNote":"Customer-specific fix for a customer-specific issue.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-85860","ChangeNote":"Webrequestcustom throws an exception when the exception message is empty, even though the getErrorResponse attribute is set to true.","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-86942","ChangeNote":"This change fixes a crash of developer tool in external installation. No impact on business functionality.","Products":["Tools-DyalogSession"]},{"SimCorpReference":"D-86923","ChangeNote":"Remove FAP validation, client specific","Products":["Business-FinancialConfiguration"]},{"SimCorpReference":"D-86815","ChangeNote":"Added logging information to provide more information when crash happens","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-86238","ChangeNote":"Prevent crash when delta vectors are not available","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86931","ChangeNote":"[TECHNICAL/3T] restored help functions still used in commands","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-86294","ChangeNote":"For \u0027Open ended\u0027  \u0027Securities Lending\u0027 positions with \u0027Fee paid\u0027 set to \u0027Last in month\u0027  and \u0027Underlying\u0027 \u0027Bonds\u0027 was not possible anymore to create the final  \u0027Premium\u0027 transactions after the position was closed on its \u0027Maturity date\u0027. This has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86965","ChangeNote":"Fixed OTC web API tests. Changes do not affect any customer installations.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-86008","ChangeNote":"ABS accounting values (book values / unrealised P/L) were wrong when simulating in the Asset Manager.  This has now been corrected.","Products":["Business-PortfolioManagement","Business-Transactions"]},{"SimCorpReference":"D-86563","ChangeNote":"The recalculation of current values and settlement amounts should not be triggered for irrelevant field changes in the truGen or truCostPstChg environment for transactions native to the window Exercise Options.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-86803","ChangeNote":"Fix ORA crash in compliance cleanup when there is so much data to be deleted that it is split in chunks","Products":["Business-Compliance"]},{"SimCorpReference":"D-86229","ChangeNote":"DWH: Fix issue with variables coming from Extra tab which led to crash during compare models.","Products":["Business-DWH"]},{"SimCorpReference":"D-84583","ChangeNote":"A client specific change for loading of transactions in the portfolio calculation running on a period closure framework.","Products":["Business-PortfolioCalculation","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86776","ChangeNote":"Disable TM authorization framework for API instruments and adjusted CalcAdjustedCDSINdexAllocations","Products":["CsCode-Trading","XpressInstruments"]},{"SimCorpReference":"D-86713","ChangeNote":"DWH: Fixed \u0022Exception of type ApplicationException was thrown\u0022","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"S-195882","ChangeNote":"Support for Cloud Data Warehouse to use Amazon S3 as storage provider, either using a federated OAuth flow, or a stored Secret Access Key for authentication","Products":["Business-DWH","CsCode-DataWarehouse","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-86652","ChangeNote":"Fixed issue with deleting/modifying private debt transaction with payments","Products":["Business-Cash"]},{"SimCorpReference":"D-86846","ChangeNote":"Clean up patch mess - RVP L3 video recording was set to always saving for some reason in 24.10 and 25.01","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-86620","ChangeNote":"Max length of Order manager message is increased","Products":["Business-FrontOfficeData","Framework-Database"]},{"SimCorpReference":"D-86558","ChangeNote":"Fix of unintended error while preparing for pricing of AUD inflation swaps.","Products":["XpressInstruments"]},{"SimCorpReference":"D-86579","ChangeNote":"Fix problem with \u0022Insert Row\u0022/\u0022Delete Row\u0022 not being visible on Amount lists when the list has some values that are flagged as deleted.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-86282","ChangeNote":"N/A","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-86641","ChangeNote":"Redemption transactions is not visible in the Cash Viewer applet when the Expected Payment Date is shifted on today and historical mode is turned off. This has now been corrected.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"S-196281","ChangeNote":"Modify the ytm calculation for Zero Coupon Inflation Swap in the Trade Mananger such that the yield on the main contract is equal to the yield on the interest leg.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-86747","ChangeNote":"The data cleanup service only deleted performance counter data once a month, even if the performance counter table wasn’t partitioned. This has been corrected.\n\nIf the table is partitioned data will be deleted once a month (drop partition).\nIf the table is not partitioned data will be deleted daily.","Products":["Business-Services"]},{"SimCorpReference":"D-86623","ChangeNote":"Client specific change: Changed error, when reversing a payment with PCL records using the STP/Batch Job, into a warning.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-85954","ChangeNote":"Allow importing dates with timestamps","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-85582","ChangeNote":"Update the custom placement grid behavior to  allow removal of placements where filtering meant that the item being updated no longer meets the filter criteria."},{"SimCorpReference":"D-86684","ChangeNote":"Fixed potential crash when processing Funds.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-86566","ChangeNote":"On creating proxy bonds via the Asset Manager field \u0022New Issue - Existing Security ID\u0022 the Hidden flag was copied from the existing security.  This has now been corrected (the flag is always set to false).","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-195770","ChangeNote":"Rounding error in  OM allocation message processing for CDS orders with fractional index factor  was fixed.\n\nXpressInstruments, \u0022Fixed Income Formula Note\u0022: Corrected error in fixing dates that could occur if underlyings are specified but not used in payoff formulas.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading","Business-PortfolioManagement"]},{"SimCorpReference":"D-86009","ChangeNote":"Some accounting figures natively calculated by the Asset Manager in a \u0022pre-order\u0022 version where not correct.  Their titles have now been changed to be \u0022pre-sim\u0022 and the calculation updated to reflect that. The fields are:Balance book value PC pre-sim\nBalance book value QC pre-sim\nYear-to-date loss book PC pre-sim\nYear-to-date loss book QC pre-sim\nYear-to-date P/L book QC pre-sim\nYear-to-date P/L book PC pre-sim\nYear-to-date profit book PC pre-sim\nYear-to-date profit book QC pre-sim\nUnrealised P/L book PC pre-sim\nUnrealised P/L book QC pre-sim\nBalance cost value PC pre-sim\nBalance cost value QC pre-sim\nBalance discount PC pre-sim\nBalance discount QC pre-sim\nBalance premium PC pre-sim\nBalance premium QC pre-sim\nBalance variation margin PC pre-sim\nBalance variation margin QC pre-sim\nUnrealised P/L cost PC pre-sim\nUnrealised P/L cost QC pre-sim\nYear-to-date P/L cost PC pre-sim\nYear-to-date P/L cost QC pre-sim    \nBalance dissolved discount since EOY PC pre-sim\nBalance dissolved discount since EOY QC pre-sim\nBalance dissolved premium since EOY PC pre-sim\nBalance dissolved premium since EOY QC pre-sim\nBalance dissolved discount since EOP PC pre-sim\nBalance dissolved discount since EOP QC pre-sim    \nBalance dissolved premium since EOP PC pre-sim    \nBalance dissolved premium since EOP QC pre-sim\nUnrealised P/L book PC pre-sim\nUnrealised P/L book QC pre-sim\nUnrealised P/L cost PC pre-sim\nUnrealised P/L cost QC pre-sim","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86548","ChangeNote":"Verify business data crashes due to ASPC being deprecated. Was fixed","Products":["Business-ToolsAccounting"]},{"SimCorpReference":"D-86300","ChangeNote":"DWH: Web API template editor to show detailed information about execution errors","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-81742","ChangeNote":"Changes to the CCDSWAPS table were not always broadcasted to the rest of the SCD One. The error has been fixed.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-86265","ChangeNote":"For security reasons it is now possible to specify SCD user ID for the configuration parameter CfgSvcGrantAllTasks.\nSyntax:\nCfgSvcGrantAllTasks=Enabled [;SCDID]\nEnabled: 0 or 1\nSCDID: SCD user ID\n\nTo be backward compatible the old syntax is still valid.\n\nExamples:\nCfgSvcGrantAllTasks=1 (the option is enabled)\nCfgSvcGrantAllTasks=1;SCDID1 (the option is enabled if the current SCD user is SCDID1, for all other users it will be disabled).","Products":["Framework-Authorisation","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-86407","ChangeNote":"added relevant progcompfile to fix the restoring issue of the dependency","Products":["Framework-CompFiles"]},{"SimCorpReference":"D-85447","ChangeNote":"Exercise Option with Variation Margin using the P/L Method in Derivatives incorrectly calculated the profit and loss on the underlying asset. This has been corrected","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86314","ChangeNote":"When \u0027Decomposition type\u0027 \u0027Criterion\u0027 was used it could happen that in the PFC result \u0027List Calculation\u0027 additional lines appeared for \u0027Fund certificates\u0027 that were not in the scope as per the \u0027Segment \u0027used in the \u0027Criterion\u0027 line(s) of the relevant \u0027Decomposition Profile\u0027. This has been fixed.","Products":["Valuation"]},{"SimCorpReference":"D-85715","ChangeNote":"In rare cases  when creating TRS \u0027Reset\u0027 transactions via the \u0027Create Swap and Dual Currency Payments\u0027 window it could happen that the \u0027Performance amount\u0027 was not filled. This happened only in cases where \u0027create jobs\u0027 \u0027To date\u0027 was earlier than the  \u0027Resets\u0027 \u0027Payment date\u0027 but larger equal the according \u0027Valuation date\u0027. This has been fixed.","Products":["Business-AdministrativeOTCTransactions","Business-ToolsTransactions"]},{"SimCorpReference":"D-85623","ChangeNote":"Correction of side of  development made on D-84150.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-86027","ChangeNote":"Message Broker configuration now takes case-sensitive DNS names from the certificate"},{"SimCorpReference":"D-86240","ChangeNote":"A change to the \u0022term parser\u0022 made in 24.07 could course DFS\u0027s to fail when running in another culture that the data is created in","Products":["Framework-ApplicationFramework","Framework-CoreFramework"]},{"SimCorpReference":"D-86216","ChangeNote":"Fix the problem where asset manager crashes when user loads a formula in Portfolio Sheet that points to a formula value definition that does not exist","Products":["CsCode-Framework"]},{"SimCorpReference":"D-86118","ChangeNote":"Correct FX instrument type is now set  on transaction based on OM allocation of FX spot","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-86142","ChangeNote":"Applied correct mapping for Data extract models to minimize performance impact"},{"SimCorpReference":"D-85652","ChangeNote":"Added check if the trm is empty","Products":["Business-Transactions"]},{"SimCorpReference":"D-85406","ChangeNote":"Trade Manager: Fix performance error related to Asset Manager Performance Monitor.","Products":["XpressInstruments"]},{"SimCorpReference":"D-85797","ChangeNote":"Fixed optimization step to not break parameters initial boundaries.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"S-194634","ChangeNote":"Some test functionality has been cleaned up."},{"SimCorpReference":"D-84713","ChangeNote":"Add outbound DSL fields"},{"SimCorpReference":"D-85941","ChangeNote":"Add StatusCode and StatusDescription to the webrequestcuostm headers and  a better description for TaskCanceledException for versions 25.04, 25.01, 24.10 \u0026 24.07","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-85670","ChangeNote":"Fixed a memory leak in the Front Office Cash Balances Api that would lead to a slowly incresing memory consumption in the Api service","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-85706","ChangeNote":"Calculate spot  on analysis date if analysis on delivery for future","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"S-194953","ChangeNote":"Trade Manager: Fix performance error related to Asset Manager Performance Monitor.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-85510","ChangeNote":"To fix an issue with General processing status in CAM","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-86042","ChangeNote":"A system performance have been made for booking many equities trades on the same date for the same position. This typically happen for TRADING portfolio on internal trades where the P/L method is No P/L.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-85953","ChangeNote":"Fix NPM vulnerability"},{"SimCorpReference":"S-184913","ChangeNote":"Patch OAuth flow to old SCD versions","Products":["Business-DEX","Business-DWH","CsCode-DataWarehouse","Framework-CoreFramework"]},{"SimCorpReference":"D-86014","ChangeNote":"When \u0027Matching\u0027 \u0027Credit Default Swaptions\u0027 transactions it could happen that the \u0027Payment amount\u0027 changed unexpectedly. This has been fixed.","Products":["Business-Match","Business-Transactions"]},{"SimCorpReference":"D-86076","ChangeNote":"Added null checks to avoid exceptions in Document Processing","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-85535","ChangeNote":"The issue happens if the holding for the fund is reduced due to 0 nominal and missing transaction for the date while its components are fetched.  In this case the agreement and payment date are diffrent for the transaction that sells fund. Which leeds to the situation that the fund is found and decomposed and only after this standard analytcs are calculated and fund removed from the saved results. The issue is fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-85746","ChangeNote":"The support token workflow has been updated to strengthen the error handling routines","Products":["Framework-Users"]},{"SimCorpReference":"D-85984","ChangeNote":"Default directory for Filter, DataFormatSetup and Bloomberg log files have been changed from empty to the \u0027log\u0027 directory.","Products":["Business-Connectivity","Business-DataFormatSetup","Business-Filters","Framework-ConfigurationTransport","Framework-File"]},{"SimCorpReference":"D-86031","ChangeNote":"The start date for WM data with new BIDs has been changed to 2027-01-01 to avoid clashes with data from old BIDs.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-78037","ChangeNote":"Fixed composite payments FX translation when RC is changed in performance measurement","Products":["Performance"]},{"SimCorpReference":"S-192374","ChangeNote":"Development increment to support pool funds in compliance manager","Products":["CsCode-Compliance","CsCode-AltInv"]},{"SimCorpReference":"D-84518","ChangeNote":"Published invalidation cache event into all auth service instances","Products":["CsCode-Framework"]},{"SimCorpReference":"D-85725","ChangeNote":"If exporting/importing multiple WIDGETCONFIGS it could fail with a “Missing contents for file(s)...” message. Whereas if exported/imported one-by-one it succeeded. \nThis has been corrected.\nNote: It\u0027s the exported entities which were wrong, meaning a new export is needed before doing the import.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-85933","ChangeNote":"Adedd CloudAgentRequirements to the missed projects. No visible changes for the user."},{"SimCorpReference":"D-85628","ChangeNote":"Internal change: remove unit test","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-85649","ChangeNote":"Do not use  fixing curve for IRF in price method \u0022Quoted price \u002B yield curve\u0022","Products":["MarketData"]},{"SimCorpReference":"D-84939","ChangeNote":"A crash could occur in risk and performance widgets in SimCorp Dashboards when the underlying middle office tree node data got a very large internal key on the database. This has been resolved.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-85851","ChangeNote":"No actual changes on this defect","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-85364","ChangeNote":"Optimize Broker Matrix"},{"SimCorpReference":"D-85700","ChangeNote":"The correction is related for Notify Repo with French GAPP in TM","Products":["Business-Transactions"]},{"SimCorpReference":"D-85580","ChangeNote":"Keep sending the refresh auth cookie response for a while after refreshing the access token.","Products":["CsCode-UP"]},{"SimCorpReference":"D-85497","ChangeNote":"\u0022Parent assignment unit\u0022  is filled in  Alerts inbox for Pre-trade","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-85544","ChangeNote":"Fix crash when calculating delta vectors for price method External pricing when discounting curve is missing but other yield curves are present","Products":["Valuation"]},{"SimCorpReference":"D-85559","ChangeNote":"Assuring that quote is only transformed in Yield Curve manager when quotations are different in Prices window and on static data.","Products":["MarketData"]},{"SimCorpReference":"D-85165","ChangeNote":"For a drawn unit bond, the face value is also considered during redemption","Products":["PositionBasedCalculation"]},{"SimCorpReference":"D-85647","ChangeNote":"For templates and calculation copies the \u0027Segments/Portfolios\u0027 control wasn\u0027t update. This has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-85335","ChangeNote":"advances tests were fixed.","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-85462","ChangeNote":"UnhandledException New security instrument type General does not match existing FX future leg  is fixed.","CustomerApplyNote":"UnhandledException New security instrument type General does not match existing FX future leg  is fixed.","Products":["Instruments"]},{"SimCorpReference":"D-85590","ChangeNote":"running flexAnalytics service with german created a validation error. This has been fixed.","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"S-188801","ChangeNote":"Update validation of Node Types for Investment Structures to reflect the new business requirements in Performance IAP","Products":["Business-Modelling"]},{"SimCorpReference":"D-85325","ChangeNote":"Enables saving of Period closure subledger holdings for inactive transactions when the reversal requested status is lower than originating transaction.","Products":["Business-Cash"]},{"SimCorpReference":"D-84676","ChangeNote":"\u0027Car. book value\u0027 for AOCI amortisation should not be adjusted in smoothing engine.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-83657","ChangeNote":"When pressing \u0027Refresh current message\u0027 in the \u0027Corporate Actions Manager\u0027 in case in the \u0027Close fields for irrelevant golden record options for a holding on each row\u0027 option was set all records were open despite of this setting. This has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-85537","ChangeNote":"Make constraints validation in compliance data cleanup not fail immediately in case of ORA-00054","Products":["Framework-Database"]},{"SimCorpReference":"S-193087","ChangeNote":"Business entities of type \u0022Investment mandate\u0022 and \u0022Product\u0022 including their life cycle dates, reporting currency, portfolio relations, benchmark purposes, and index/SAAM references are added as information to the upload files generated by the two batch job tasks \u0022Performance Calculation - Upload Results\u0022 and \u0022Benchmark Calculation - Upload Results\u0022. This functionality has been patched to SCD version 25.01 and it enables all currently available business entity functionality in Investment Analytics Platform - Performance.","Products":["Performance"]},{"SimCorpReference":"D-85442","ChangeNote":"Web-UC vulnerability fix"},{"SimCorpReference":"D-82200","ChangeNote":"Customer-specific change to solve a customer-specific issue.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-84687","ChangeNote":"In systems configured to use enforced portfolio master logging in as a different user might fail to clear the previous user\u0027s active portfolio master. This has been corrected.","Products":["Framework-CoreFramework"]},{"SimCorpReference":"D-84080","ChangeNote":"This will improve execution time ,for performance measurements using a GIPS setup, for clients having a certain database setup","Products":["Performance"]},{"SimCorpReference":"D-85425","ChangeNote":"Brokers which are not \u0022Valid for Trading\u0022 are streamed via Azure Service Bus OM messaging."},{"SimCorpReference":"D-84997","ChangeNote":"Redo the logic for Price clearance and restrict it by LOC flag on Advance Type.","Products":["Business-Transactions"]},{"SimCorpReference":"D-84656","ChangeNote":"fix the issue with AlterInvestCash-Book value sign change in PL","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-84679","ChangeNote":"Exercise Option with Variation Margin using the \u0027Profit/Loss Method in Derivatives incorrectly calculated the profit and loss on the underlying asset. This has now been corrected.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-85240","ChangeNote":"When changing any field in the \u0027Edit Multiple Securities - Bonds\u0027 window for a Bond with \u0027Interest type\u0027 \u0027Multiple\u0027 the \u0027Coupon rates\u0027 check box was cleared wrongly. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-85228","ChangeNote":"Correction of program error found in the Portfolio Calculation","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-85039","ChangeNote":"The  correction is related for repo rollover with French GAPP in TM","Products":["Business-Transactions"]},{"SimCorpReference":"D-85068","ChangeNote":"Fixed an access violation crash in the MUCS that could happen in rare cases related to infrastructure performance"},{"SimCorpReference":"D-85272","ChangeNote":"In case there is a portfolio authorisation in place it might happen records without portfolio cannot be seen in \u0022AI Market Values and Quotes\u0022 window. Was fixed","CustomerApplyNote":"In case there is a portfolio authorisation in place it might happen records without portfolio cannot be seen in \u0022AI Market Values and Quotes\u0022 window. Was fixed","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-84624","ChangeNote":"The logic of the button \u0022Undo\u0022 of the form \u0022Approval Signature Group User Approval\u0022 has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-85010","ChangeNote":"Detect if AlternativeSecurityCode is null, to prevent crash, when sorting","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-85168","ChangeNote":"The error occurs because the internal PFC transaction cache is not big enough. Current size is 50k and now it is increased to 60k.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-84068","ChangeNote":"on swithing sublayout it is ncessary also update the dynamic fields in pivotselection","Products":["CsCode-Framework"]},{"SimCorpReference":"D-84784","ChangeNote":"When the \u0027Interface option\u0027 \u0027Close fields for irrelevant golden record options for a holding on each row\u0022 is enabled CAM should only use the \u0027Golden option number\u0027 to check the linkage between Silver Records and the Golden copy. This was not working correctly in case there were holdings without a linked message. If all holdings had a message linked it was working as expected. This has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-85257","ChangeNote":"Internal change: adjust internal integration tests pipeline."},{"SimCorpReference":"D-83594","ChangeNote":"introduce new dimension - GL Balance Dates to filter inactive records from GL Balances"},{"SimCorpReference":"D-84267","ChangeNote":"Fixed optimization step in yield curve estimation (bootstrap method) to use YC rate convention during optimization instead of hardcoded continuously compounded.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-84879","ChangeNote":"Enable Specflow test SaveAOCIAllocationTransaction, that was ignored by mistake.","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-85075","ChangeNote":"Minimum/maximun forward term length in Advanced type didn\u0027t distinguish between null and zero. It has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-84984","ChangeNote":"Correction of interest Appreciation calculation on PL level for tax lots with zero nominal when AI per tax lot is enabled","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-84699","ChangeNote":"Key ratios would be incorrectly calculated for US MBS Pools having the ABS check boxed ticked, having a Redemption price of 0, not having Irregular Structure, having Irregular Redemptions and using a factor based Estimated irregular cash flow.","Products":["Valuation","ApplicationSpecificChecksValuation"]},{"SimCorpReference":"S-192733"},{"SimCorpReference":"S-192161","ChangeNote":"This is a customer specific change that will not affect other customers.","Products":["Framework-Authorisation","Framework-Batch","Framework-Database"]},{"SimCorpReference":"D-85018","ChangeNote":"Calculate maturity of standard contracts by actual calendar days instead of coupon day count convention.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-84623","ChangeNote":"Error  in cash flow generation and key ratio calculation for Capitalising ABSs having Irregular coupons.","Products":["Valuation"]},{"SimCorpReference":"D-84341","ChangeNote":"To fix failed CACFD auto test","Products":["Business-AdministrativeSecurityTransactions","Business-CorporateActions"]},{"SimCorpReference":"D-83490","ChangeNote":"When reallocation transaction is raised to tradeGL (or higher) that a finance transaction is generated, which using tax lot characteristic formula, then the matching is not correct. This problem is fixed.","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-84977","ChangeNote":"Fixed code wrt new sonar qube rules","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"S-192309","ChangeNote":"Disable telemetry in closed versions","Products":["CsCode-Framework"]},{"SimCorpReference":"D-84973","ChangeNote":"A new CBU program  for updating to 25.04, witch warn  that all Service Agents needs to be reinstalled after the update.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-84808","ChangeNote":"Fix issue in how empty data values transferred from server to client","Products":["CsCode-UP"]},{"SimCorpReference":"D-84961","ChangeNote":"Compliance reporting helper tables :  Optimize system performance for populating the reporting helper tables.","Products":["CsCode-Compliance","Framework-Database"]},{"SimCorpReference":"D-84505","ChangeNote":"Internal change: an integration test fix","Products":["Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-84969","ChangeNote":"bug fix for standard basemarts, changes to Reference Date IKs, Derivative dimension and Position Calc UDKR"},{"SimCorpReference":"D-84114","ChangeNote":"update date serialization for operation status endpoint","Products":["Business-GeneralTransactions","CsCode-Transaction"]},{"SimCorpReference":"D-83992","ChangeNote":"When creating ’Swap and Dual Currency payments’ for TRS opened with a ‘From date’ earlier then the ‘Effective date’ in rare cases unexpected ‘Reset’ transactions were created. This has been fixed.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"S-192450","ChangeNote":"Trade Manager, swaptions: Solved a problem where validation of the \u0022reference rate\u0022 field could get stuck.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-84774","ChangeNote":"The same instrument, CDS option, now has two forms using the same transaction codes. Based on the transaction context, we identify the relevant form programmatically to solve the ambiguity.","Products":["Business-Transactions"]},{"SimCorpReference":"D-84293","ChangeNote":"Internal change: an integration test fix.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-84690","ChangeNote":"Internal change: integration test fix.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-84551","ChangeNote":"Fixed issue that was cauing mismatching program order quantities after fil","CustomerApplyNote":"Fixed issue that was cauing mismatching program order quantities after fil"},{"SimCorpReference":"S-192439","ChangeNote":"The version of the Web-UC package was updated to 20250404.1000000.1120"},{"SimCorpReference":"D-84562","ChangeNote":"In the \u0027Position Calculation\u0027. In case \u0027Ignore actual transactions after FFD \u0027 was marked on the relevant \u0027Execution label\u0027 and if  \u0027Simulate fund component cash flows\u0027 is marked \u0027Ignore actual transactions after FFD\u0027 was ignored foe the fund components. This has been fixed.","Products":["Business-PortfolioCalculation","Business-Risk"]},{"SimCorpReference":"S-190197","ChangeNote":"Deleted code for deprecated Strategy Definition applet","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-84740","ChangeNote":"In some rare cases system could crash, when user presses \u0027Show manual changes\u0027 in Result Monitor applet (Result Manager) on internal result. This error has been fixed.","Products":["CsCode-Accounting","Reconciliation"]},{"SimCorpReference":"D-84824"},{"SimCorpReference":"S-191704","ChangeNote":"Port Sub-totals  from 2T layouts into 3T","Products":["CsCode-Framework"]},{"SimCorpReference":"D-84214","ChangeNote":"Following Data Source provider types will be deprecated and should not be selectable for the new Data Sources: Real-Time DDE, Falcon 32-bit, Demo, Bridge Feed Handler, Internet Feed, XML Feed and Bloomberg.","Products":["Business-Connectivity"]},{"SimCorpReference":"S-190808","ChangeNote":"Add Formula variable in Position Calc UDKR Result"},{"SimCorpReference":"D-84703","ChangeNote":"Fix culture issues in SCD Web","Products":["CsCode-UP"]},{"SimCorpReference":"D-84372","ChangeNote":"The correction is technical only and does not change the business logic. The length error has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-77618","ChangeNote":"Compliance results of class funds were sometimes inconsistent if several class fund ratios were calculated in the fund figures. This is because the system used the first ratio it found, which might not always be the correct one. Going forward, ratios with \u0022MCF Ratio set 1\u0022 will be prioritised if they exist.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-84667","ChangeNote":"An error could occur when pricing \u0027Structured Bonds\u0027. This has been fixed.","Products":["Valuation"]},{"SimCorpReference":"D-82631","ChangeNote":"A program error occurred when doing a Deep Scan for a \u0027Collateral Manager\u0027 item. This has been corrected.","Products":["Business-Collateral"]},{"SimCorpReference":"D-84398","ChangeNote":"Use the total value in an investment structure for the denominator in calculations for Portfolio Currency Weights instead of just Market nodes.","Products":["Performance"]},{"SimCorpReference":"D-84257","ChangeNote":"A program crash occurred when saving a Total Return Swap using a security type for which a Security Name Generation using ‘* Final maturity date (Swap Legs)’ or ‘* Paid/received leg (Swap Legs)’ where used. This has been corrected.","Products":["Business-NameGeneration"]},{"SimCorpReference":"D-82947","ChangeNote":"The DotTrace sdk has been removed from the SimCorp Dimension installation","Products":["CsCode-Framework"]},{"SimCorpReference":"D-84463","ChangeNote":"Added list of Swift MT304 copy tags to communication gateway service.","Products":["Business-Swift","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-189530","ChangeNote":"Swift MT Changes for SR 2025","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-84031","ChangeNote":"Avoid accessing invalid or empty real-time service buffer data in APL, while also avoiding sending empty matrices from the RTMAIN companion.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-84742","ChangeNote":"Added View Transactions as allowed to be opened form from G/L forms in 3T.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-84670","ChangeNote":"When a portfolio calculation uses period closure, Oracle in some situations used a none optimal plan when fetching data, leading to long execution times. This has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-84351","ChangeNote":"Increased length of risk factor name to 160 in Principia","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-83488","ChangeNote":"It was not possible to delete the Redemption/PayUp transaction after deletion of the opening Buy/Sell. Here it has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-84317","ChangeNote":"Add more logs to the system","Products":["CsCode-UP"]},{"SimCorpReference":"D-84499","ChangeNote":"Prevent crash when showing tooltip for BlockedNominal in View Positions.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-83319","ChangeNote":"Synchronize data in PortfolioSheet and DeltaVectorManager.\nGuard fetching data and add trace statement if exception happens.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-84631","ChangeNote":"Update to the general field access logic to avoid a potential crash related to the fields in the YTM Conventions sub-window in flows where these are absent.","Products":["Business-Transactions"]},{"SimCorpReference":"D-84173","ChangeNote":"The Benchmark Calculation Upload Results batch job did not upload SAAM weights when the related SAAM definition is defined from a mandate profile. This has been corrected so the SAAM weights are included in the upload.","Products":["Benchmarks","Performance"]},{"SimCorpReference":"D-84075","ChangeNote":"Make it possible to distinguish between an expired and a long expired auth token"},{"SimCorpReference":"D-84409","ChangeNote":"Handle Null-Totals","Products":["CsCode-UP"]},{"SimCorpReference":"D-84386","ChangeNote":"This regards the logic that synchronizes certain field values in the 2 elementary components of a business transaction native to the ‘Reallocation Collaterals’ window. Special handling for pSTLMDAYS.","Products":["Business-Transactions"]},{"SimCorpReference":"D-84316","ChangeNote":"Improve exception handling","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-84608","ChangeNote":"Some database selects have been optimized in the \u0027Benchmark Calculation - Upload Results\u0027 batch job. This helps reduce the overall execution time when the job is working on large data sets. For a specific client this results in a 50% decrease in execution time for a full Benchmark calculation upload.","Products":["Benchmarks","Performance"]},{"SimCorpReference":"D-84645","ChangeNote":"In an 3T session it was possible to execute a calculation locally. This has been corrected.","Products":["Framework-Services"]},{"SimCorpReference":"D-84594","ChangeNote":"Export group value when show grouped columns option is enabled","Products":["CsCode-UP"]},{"SimCorpReference":"D-83904","ChangeNote":"It is an internal error on a development SLE.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-84541","ChangeNote":"Fixed broken shortcuts combinations in SCD Web","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-84555","ChangeNote":"Fixed issue with buffer name for dynamic forms.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-84506","ChangeNote":"When using a hosted APL session an value error could occur if a timer event happens prior to a rollback on the database","Products":["Framework-Database"]},{"SimCorpReference":"D-84497","ChangeNote":"Fixed but that was causing program auto-aggregation to not trigger on receiving broker restrictions"},{"SimCorpReference":"D-84302","ChangeNote":"If job has execution time Now(outside commit sequence) and that job is initialized by another auxiliary job it will sometimes be executed twice. This has been corrected.","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"D-83278","ChangeNote":"Null Reference Exception Defensive code added"},{"SimCorpReference":"D-83872","ChangeNote":"User could not change password when the password is reset.","Products":["CsCode-SystemOperation","Framework-Authorisation","Tools"]},{"SimCorpReference":"D-83498","ChangeNote":"Compliance services listen to order side tables changes","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-84150","ChangeNote":"Accrued interest for Call Money instrument was not simulated (PFC and EOP AI transaction) for dead holdings if there are more than one nominal holding due to the booking across portfolios or other PL fwk-specific logic.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-84275","ChangeNote":"Replace table dependencies to CALCDEFSVIEW with configuration dependencies to CALCDEFS.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-83397","ChangeNote":"Fix ORA-14004 from AO package during shema Synchronization having partitioed table in the DWH Model.","Products":["Business-DEX"]},{"SimCorpReference":"D-83886","ChangeNote":"Rounding down nominal to two decimals for PayUp Transactions on holding match","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-84089","ChangeNote":"Rounding error in  OM allocation message processing for CDS orders with fractional index factor  was fixed.  The patch covers only full allocation scenario.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-83907","ChangeNote":"An error could occur in the \u0027Position Calculation\u0027 when decomposing funds and if the calculation ran on a \u0027Nominal Framework\u0027 and a \u0027Swap\u0027 was decomposed from a \u0027Fund\u0027 of \u0027Fund Type\u0027 \u0027Master Fund\u0027. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"S-191402","ChangeNote":"Corrected payment direction on physically delivered swaptions in the TM.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"S-190571","ChangeNote":"The Data Warehouse Web API Template Editor windows now test-runs Web API Requests on the Reporting Data Jobs Service, rather than the local machine. So connectivity to the relevant key vaults and network routes is needed only from the server machine.","Products":["Business-Connectivity","CsCode-DataWarehouse"]},{"SimCorpReference":"D-84136","ChangeNote":"When network was lost, a missing method would prevent compliance  engine to recover. This is now corrected.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-83026","ChangeNote":"The configuration service can now change the \u0027Batch Task\u0027 for a used batch job. Earlier this was not allowed.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-84143","ChangeNote":"Fix multispace aggregator failure when no spaceId found","Products":["CsCode-UP"]},{"SimCorpReference":"D-83758","ChangeNote":"Ensured initialisation completes before dispose","Products":["CsCode-UP"]},{"SimCorpReference":"D-84113","ChangeNote":"Dependency was wrongly declared to table CALCADMMGR instead of configuration dependency to CALCSEGADMMGR, FUNDADMMGR, PORGADMMGR or PORTGRPADMMGR. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-83889","ChangeNote":"Fix webrequestcustom charset by removing default charset when contenttype is passed","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-83492","ChangeNote":"The Default Value column in the Variables window should not be cleared for the \u0022Fund NAV Reporting\u0022 variable","Products":["Business-DWH"]},{"SimCorpReference":"D-82516","ChangeNote":"Fix unique key violation when loading the Process Info fact","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-83938","ChangeNote":"Reacquire proxy in case of communication failure","Products":["CsCode-Framework"]},{"SimCorpReference":"S-182201","ChangeNote":"Added Futures to IMW Model"},{"SimCorpReference":"D-84119","ChangeNote":"Start finding Initial FX rate for setups with Analysis date equal to Effective date for CCy swaps.","Products":["Valuation"]},{"SimCorpReference":"D-84006","ChangeNote":"Benchmark Calculation crashed with a program error when executing with type \u0027Update specific errorneous\u0027. The problem has been solved.","Products":["Benchmarks"]},{"SimCorpReference":"D-83605","ChangeNote":"Fix the issue in Margin Manager when autoallcation could not be booked in case of different margin currency on collateral result","Products":["Business-Collateral"]},{"SimCorpReference":"S-189569","ChangeNote":"Remove deprecated Swift MX pain.002 Aux Message Type and prohibit its use in previous versions when upgrading.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-83990","ChangeNote":"General reconciliation could calculate cash integrity even if it wasn\u0027t needed. This is fixed now","Products":["Business-Reconciliation"]},{"SimCorpReference":"S-190610","ChangeNote":"Fix a crash when clicking \u0022-\u003E\u0022 button in Spread Option Generator.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-84064","ChangeNote":"N/A: Intentional deviations caused by D-83404. So, RVP tests were changed to take into account the system\u0027s new behavior.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"S-190417","ChangeNote":"Switch AI.Search.Compliance to renamed package for security reasons","Products":["Business-Compliance","CsCode-Compliance"]},{"SimCorpReference":"D-83751","ChangeNote":"Fix for attempt to create execution scope when Session or its Parents session are disposing or inactive","CustomerApplyNote":"Fix for attempt to create execution scope when Session or its Parents session are disposing or inactive","Products":["CsCode-UP"]},{"SimCorpReference":"D-83652","ChangeNote":"Fix missing costs for NetCallDistrib transaction created from event.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-82071","ChangeNote":"Added logging to ConfigurationMessagingService request handlers","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-83279","ChangeNote":"Avoid unnecessary default recalculation of cost/tax amounts and derived fields when only a cost text is updated/imported.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-83284","ChangeNote":"External Fund decomposition wrongly failed in case component was a fund that was not decomposable due to missing prices, but was not supposed to decomposed, and at the same time was also contained as direct position. This has been fixed.","Products":["Decomposition"]},{"SimCorpReference":"D-83851","ChangeNote":"Fix crash in ViewHolding Keys app when system change enable state of hidden action","Products":["CsCode-UP"]},{"SimCorpReference":"D-83933","ChangeNote":"3T: Show error message to end user when open item cannot open form because it is not yet approved for production.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-83440","ChangeNote":"After pressing \u0027Net and Export\u0027 in the \u0027Netting Manager\u0027 in case the \u0027Netting Manager\u0027 was set to \u0027Online\u0027 the re-loading of the data was performed twice. This has bene fixed.","Products":["Business-Netting"]},{"SimCorpReference":"D-83010","ChangeNote":"Adding validation when deleting Axioma view item","Products":["CsCode-MiddleOffice","Business-Risk"]},{"SimCorpReference":"D-83539","ChangeNote":"Partial revert of changes made on #3206 (allow disable https to access reinvestment).\nProper solution will be implemented on FEA E-20279","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-83842","ChangeNote":"Fixed default links container in workspace content","Products":["CsCode-UP"]},{"SimCorpReference":"D-83567","ChangeNote":"fixed legacy OperationalException handling to return 500 code by default","Products":["CsCode-Framework"]},{"SimCorpReference":"D-83724","ChangeNote":"The performance of the dropping of compliance partitions has been optimized.\nTechnical: When enabling the constraints after a partition has been truncated, the NOVALIDATE option has been added.","Products":["Framework-Database"]},{"SimCorpReference":"D-82812","ChangeNote":"Make available for CGT matching OpenBalFwk, OpenBalAUCgFwk, OpenBalance","Products":["Business-AustralianCgt","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-83766","ChangeNote":"System performance improvement for database queries in Performance Measurement code.","Products":["Performance"]},{"SimCorpReference":"D-83404","ChangeNote":"The Batch Job \u0022Collateral Manager - Autoallocation - Cover Margin Call - Save Proposed Transactions\u0022 and manual allocation from Margin Manager application → Margin Call Tracker applet → Allocate via Simplex action require that the Payment Date for Cash Transfer transactions to cover Margin Calls with the RecallReceive action be calculated based on:\n\nTransaction Options → Options 5 → \u0022Enable settlement on reallocation\u0022 setting\n\u0022Default Settlement Days - Collateral Pools\u0022 defined in the Pool’s static data","Products":["Business-Transactions","Business-Collateral"]},{"SimCorpReference":"D-83824","ChangeNote":"Changed handled situation to be traced as a warning","Products":["CsCode-UP"]},{"SimCorpReference":"S-186682","ChangeNote":"CBU error patch down to 25.01 and 25.04","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-83252","ChangeNote":"Fixes an out of memory exception that occurs in the WebAPI editor when compiling very large templates","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-83653","ChangeNote":"References to table POSRCMGRSETUPS was returned as table dependencies and not configuration dependencies to RECONCILIATIONMGRSETUP. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-83348","ChangeNote":"At the DataSource level in the SearchFilterToWhereClause we now check against field length and modify the value wrt placement of the \u0027%\u0027 symbol if necessary","Products":["CsCode-UP"]},{"SimCorpReference":"D-83338","ChangeNote":"When \u0027Configuration Importing\u0027 \u0027Portfolio Calculation\u0027 having \u0027Use system options\u0027 marked in the \u0027Advanced Settings\u0027 sub window \u0027System options\u0027 tab and in case in the destination installation the \u0027System Options\u0027 differed from the according setting in the  source instalaltion, wrongly a warning was shown. This has been fixed.","Products":["LocalSystemOptions"]},{"SimCorpReference":"D-83116","ChangeNote":"Resolve the multileg issue in the Axioma Stress Test analytics import process","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-83362","ChangeNote":"No code changes. Just enhancing test coverage","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-83047","ChangeNote":"Not all SystemException are critical are therefore not all SystemException makes APL session invalid.","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"S-179824","ChangeNote":"Make Collateral RVP L3 tests recordable with ffmpeg, test code changes only","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-83426","ChangeNote":"An error could occur in View Finance Transactions activating Functions / View Grouping Fields","Products":["Business-GeneralLedger"]},{"SimCorpReference":"D-83411","ChangeNote":"Enabling support of \u0022Manufactured Coupon Payments\u0022 together with AI per tax lot functionality","Products":["Business-SystematicAdjustments","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-180492","ChangeNote":"clean up expire records for trans cost solution"},{"SimCorpReference":"D-83519","ChangeNote":"Fix possible error in download real-time of standard contract quotes","Products":["MarketData"]},{"SimCorpReference":"D-83415","ChangeNote":"A previous fix caused that windows with the option of loading several records, could fail if opened with initial data with several records.","Products":["Framework-InternalGuiFramework"]},{"SimCorpReference":"D-83385","ChangeNote":"The \u0027Benchmark Calculation - Upload Results\u0027 batch job could crash with an assertion error if SAAM weights have been calculated for a specific portfolio in Benchmark Calculation and the related SAAM definition afterwards have been deleted. The error has been solved by ensuring that we only upload SAAM weights when the portfolio has a corresponding SAAM definition.","Products":["Performance"]},{"SimCorpReference":"D-83425","ChangeNote":"When using authorisation roles for for users the first role returned from AD was used as the default role.\n\nIntroduced a priorisation of the defined roles so that the default role will be the one with the highest priority that is returned from AD","Products":["Framework-Authorisation"]},{"SimCorpReference":"D-83060","ChangeNote":"In PFC, when loop size is \u003E1 and there are multiple call money securities, cash flow is calculated correctly for the call money securities with at least one payout.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-83021","ChangeNote":"Make corrections to identify currency for external fund components","Products":["Business-Risk"]},{"SimCorpReference":"D-83207","ChangeNote":"When having tow identical dividends on an equity but with different \u0027Dividend sequence Nos\u0027 only of those was taken into account when calculating \u0027Dividend adjustments\u0027 in e.g. the \u0027Risk Measurement\u0027 of \u0027Performance Calculation\u0027. This has been fixed.","Products":["Performance","Business-Risk"]},{"SimCorpReference":"D-83154","ChangeNote":"Fixed issue that didn\u0027t allow saving MIT bond with unchecked \u0027Holiday adjust coupons\u0027 checkbox in MIT sub-window of Bonds.","Products":["StaticData"]},{"SimCorpReference":"S-186524","ChangeNote":"Upgrade Web-UC version in 25.01"},{"SimCorpReference":"D-83172","ChangeNote":"Fixed optimization step in fixing curve estimation if discounting curve is not provided.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-82090","ChangeNote":"Fix error, when CAM is not showing the elected position after Dividend transaction gets generated if the holding is based on the Opening balance","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-83303","ChangeNote":"Memory profile showed that be biggest part of loaded data comes from optional fields used by order cache.\nOptional fields are now not  preloaded.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82420","ChangeNote":"The reason is that the amount are stored in the amount type field are only 2 (sometimes 3, depending on environment settings) digits after comma are stored. It is suggested to scale small amounts (multiply by 10x5) before save and scale them back during files generation.","Products":["Business-Risk"]},{"SimCorpReference":"D-83291","ChangeNote":"Supported TopicIDs are included to the SystemCapabilitiesMessage message sent to external clients."},{"SimCorpReference":"D-83361","ChangeNote":"Crash in AM on pivot grid","Products":["CsCode-Framework"]},{"SimCorpReference":"D-82289","ChangeNote":"Fixing crash in RAM when there are no analytics in RF Scenarios","Products":["Business-Risk"]},{"SimCorpReference":"D-83280","ChangeNote":"A program error could occur when importing WIDGETCONFIGS. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-83351","ChangeNote":"Synthetic FX Hedge Return Calculation Settings currently supports four price methods that place the entire market value of the FX forward contract on one leg. It will therefore be the single leg that holds the entire P/L and return of the contract. There is, however, a conceptual problem with these methods, since the start of day market value on the value bearing leg is also zero. TWR is therefore not well defined on the opening date when using these price methods. The existing calculation applies a trick where the return is calculated on each leg and then simply subtracted from each other and put to the value bearing leg. One way to understand this approach is that it calculates a unitized P/L for each leg and moves these to the single leg. This approach is, however, difficult to understand and explain. On top of this, when the synthetic FX hedge returns are used in Investment Analytics Platform - Performance, they are always used on a synthetic FX forward that has two non-zero legs. This might not be the expected behavior if SCD is setup to calculate the returns using a price method that implicitly treats the FX forward as a single-legged instrument. Since these methods are not recommended from a performance perspective, they are removed as calculation options from the Synthetic FX Hedge Return Calculation Settings window. Instead, the four corresponding P/L price methods are added. These are recommended from a performance perspective since they have market value on both legs.","Products":["Performance"]},{"SimCorpReference":"D-82857","ChangeNote":"If using enforced authorization role segregation, and a network drop occurred, leading the session to reconnect, records in the audit trail could miss information about from which role they were generated. This has been corrected.","Products":["Framework-CoreFramework","Framework-Database"]},{"SimCorpReference":"D-83221","ChangeNote":"Corrected placed quantity calculation after partially-failed auto-allocation","CustomerApplyNote":"Corrected placed quantity calculation after partially-failed auto-allocation"},{"SimCorpReference":"D-81845","ChangeNote":"The culture of the Configuration messaging service can now be controlled via the cnf.ini parameter \u0027CfgSvcCulture\u0027. Supported values are US (LCID 1033) and UK (LCID 2057), any other value or not specified the current culture is used.","Products":["Framework-CoreFramework","Framework-Services","Framework-ConfigurationTransport"]},{"SimCorpReference":"D-83245","ChangeNote":"A insufficient windows resources error could occur during FX rate update. This has been corrected.","Products":["Business-Transactions"]},{"SimCorpReference":"D-83435","ChangeNote":"Additional forms have been allowed to be run in 3T production environments.","Products":["CsCode-Framework","Framework-ApplicationFramework","Framework-GuiFramework"]},{"SimCorpReference":"D-82588","ChangeNote":"Fix: Corporate Action Dashboards are failing in case segment has restrictions on sub-table (Extra search condition fields)","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-83253","ChangeNote":"The system failed with the assertion error \u0022Unique nominal level holding key expected!\u0022 if there is more than one nominal holding key for the same P/L holding key and if the booking across portfolios functionality is used.\nThe error was corrected by using the cash portfolio instead of the booking portfolio in the P/L framework to find the correct nominal holding.","Products":["Business-PeriodClosure"]},{"SimCorpReference":"D-83349","ChangeNote":"Additional forms have been made available in 3T UAT","Products":["Framework-ApplicationFramework","Framework-GuiFramework"]},{"SimCorpReference":"S-187175","ChangeNote":"Updated Approved status for 3T IAS Flow forms for InvAcc and FAREP","Products":["CsCode-Framework"]},{"SimCorpReference":"D-83226","ChangeNote":"Fixed a crash related to formulas in the API. Improved the matching between formula return types and parser/formatter types. Added filtering for formulas with unsupported functions.","Products":["CsCode-Framework","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82861","ChangeNote":"FormulaMatrixValue and FormulaGetValue have stopped leaking undisposed Timer instances","Products":["CsCode-Framework"]},{"SimCorpReference":"D-83205","ChangeNote":"This defect is just patching the changes made in D-80816 to lower versions","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-82543","ChangeNote":"Manual serialization for dates passed from APL was introduced.","Products":["CsCode-Accounting","CsCode-IBOR"]},{"SimCorpReference":"D-82647","ChangeNote":"Removing calls to the SYSSAR package which is no longer in use.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-82999","ChangeNote":"Active trades were not included in compliance validations on model portfolios. This error has been fixed now.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-82764","ChangeNote":"Fix error in Axioma Stress Test window while Search state.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"S-187519","ChangeNote":"Improvements to the Data Warehouse Web API load functionality and the Web API Template Editor window, including the availability of Template Methods, and the possibility of batching API calls together for performance improvements.","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-82973","ChangeNote":"We pass payment date when we create transaction from simulation at AM","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-82499","ChangeNote":"Moved specific risk filtering from SQL to C# to improve performance. Filtering of ColumnSecurityKey, RowSecurityKey and Date is now done in-memory using HashSet, reducing database load and optimizing execution time.","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-83113","ChangeNote":"Batch job log was enhanced with a new summary message showing how many files were not imported, batch job status is Completed only if all files were successfully imported.","Products":["Performance"]},{"SimCorpReference":"D-82945","ChangeNote":"Daily maintenance now archive\u0027s un-warehoused placements and their related executions together when the parent order is archived.  This makes the behavior consistent with other artifacts like cancelled or expired placements which are also present in the system until the parent order is archived."},{"SimCorpReference":"D-82564","ChangeNote":"Fetching PCL initHold transactions before the earliest agreement date of the transactions in the trans object, could lead to deviations as the calculation date choosen might be too early. The error has been solved.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-82731","ChangeNote":"Fixed deletion of items in 3T selection trees","Products":["CsCode-Framework","Framework-InternalGuiFramework"]},{"SimCorpReference":"D-83044","ChangeNote":"No business logic changes.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-82666","ChangeNote":"Accrued interest error was corrected for fixed-float MIT bonds with a long first period.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-82873","ChangeNote":"All server certificate DNS names are being accepted as client identifiers for Message Broker authorization"},{"SimCorpReference":"D-81931","ChangeNote":"Doesn\u0027t relevant for release","Products":["CsCode-Framework","CsCode-MiddleOffice","CsCode-TestUtility"]},{"SimCorpReference":"D-81939","ChangeNote":"enhanced system robustness to large program processing"},{"SimCorpReference":"D-82300","ChangeNote":"MarketValueAndQuotes: Restrict the possibly of seeing unauthorized records for user role with specific authorization portfolio segments","Products":["Business-AlternativeInvestments"]},{"SimCorpReference":"D-82598","ChangeNote":"When irrelevant fields are modified, user input expected trade dates should remain unchanged","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82129","ChangeNote":"Fixed yield curve estimation using bonds with non-standard quotation (not 100).","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-82708","ChangeNote":"As starting from 24.01 all Advances transactions are handled on service it means that we should have a correct user who request transaction creation and who can approve such transaction in Asset Manager in Order Outbox. Now, the issue has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"S-187934","ChangeNote":"Enabling access to View Transactions in 3 tier mode.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-82756","ChangeNote":"Make the names for rolled exchange traded contracts future proof.","Products":["Instruments"]},{"SimCorpReference":"D-82913","ChangeNote":"During update of SimCorp Dimension a few settings could default to wrong values if they were not set at all in the cnf.ini","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-82950","ChangeNote":"Sub-forms should not fall into the approved for production check.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-82327","ChangeNote":"Ensure that character set is switch on switch of DBIs","Products":["CsCode-Framework","Framework-CoreFramework","Framework-Database"]},{"SimCorpReference":"S-185171","ChangeNote":"Adds table partitioning to BaseMarts. Partitions are defined via Configuration Manager.","Products":["Business-DWH"]},{"SimCorpReference":"D-82736","ChangeNote":"It is now possible to delete pending program trade underling order in order outbox and pre-trade API.","Products":["Business-PortfolioManagement","Business-Trading","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82982","ChangeNote":"Internal change: Alerts Inbox Document Processing  adjustment","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-82130","ChangeNote":"In Risk Analysis Manager load data from Risk measurement contribution result tables only where results are expected.","Products":["Business-Risk"]},{"SimCorpReference":"D-82830","ChangeNote":"Fixed issue with token cache being distributed amongst several middleware instances","Products":["CsCode-UP"]},{"SimCorpReference":"D-82589","ChangeNote":"When a Trade Manager repo was opened in the ex coupon period of an underlying index bond, the ex coupon balance was not correctly updated. The error has been corrected.","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-82597","ChangeNote":"Fixed a potential crash when using the formula \u0022getrepdatapoolbyfld\u0022","Products":["Framework-Formulas"]},{"SimCorpReference":"D-82667","ChangeNote":"Fixes issue that User Marts cannot be loaded incrementally if they are incremented by an Integer type field and additionally contain the DWH_EXTRACT_PROCESS_IK","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-82874","ChangeNote":"DealingDesk can be used in F# overrides for NewOrderMultileg"},{"SimCorpReference":"D-82695","ChangeNote":"Compliance Pre-trade/Post-trade services:  slow db-query when reacting to changes to SHARECAPITAL","Products":["CsCode-Compliance","CsCode-FrontOfficeData"]},{"SimCorpReference":"S-187351","ChangeNote":"A validation for the fixing tenor was corrected in the Trade Manager.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-82786","ChangeNote":"Information in the calculation log of Adjust Amount batch job shows correct number of saved records.","Products":["Performance"]},{"SimCorpReference":"D-82837","ChangeNote":"In double selector list \u0022pmt control\u0022, if the list of selectable items were sorted before shown in the control, the selected items (both before and after) were not correct.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-82860","ChangeNote":"Fixed failed specFlow tests","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-82537","ChangeNote":"RTRefinitiv time date adjustment from UTC to local time avoids calendar date over and underflow"},{"SimCorpReference":"D-82591","ChangeNote":"Technical 3T","Products":["Framework-InternalApplicationFramework","Framework-InternalGuiFramework"]},{"SimCorpReference":"D-82646","ChangeNote":"Fixed an issue where Assign Values did not prompt the user for necessary values","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82422","ChangeNote":"Partly a rollback of D-79556 and a new solution that only set \u0022usecontext\u0022 if fhand differs from the fhand of the command!","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-82235","ChangeNote":"Fixed System.Text.Json third party library vulnerability in scdUpdate"},{"SimCorpReference":"D-81716","ChangeNote":"scan the OBJ folders to identify which projects are using the Newtonsoft.JSON 13.01","Products":["CsCode-AltInv","CsCode-Trading"]},{"SimCorpReference":"D-82460","ChangeNote":"When pressing \u0027Functions\u0027 -\u003E \u0027Search Criteria\u0027 in the \u0027Edit Multiple Securities/Parties - Classifications with Time Series\u0027 window an error could occur. Tis has been fixed.","Products":["BusinessClasses","Framework-CoreFramework"]},{"SimCorpReference":"D-82190","ChangeNote":"Set Credit impairment stage for \u0027Accrued interest\u0027 depend on CL allowance","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-82637","ChangeNote":"Database error when import file contains duplicate rows has been fixed.","Products":["Performance"]},{"SimCorpReference":"D-82305","ChangeNote":"Changed \u0022Nothing to delete\u0022 error to a warning when encountered through Batch Jobs.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-82318","ChangeNote":"Fixed different Issues in BJG","Products":["CsCode-UP"]},{"SimCorpReference":"D-82612","ChangeNote":"Dates in the json were not formatted correctly (internal and external format).","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-82691","ChangeNote":"Remove link between UserRolePrefix and LdapPrefix parameters.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-82510","ChangeNote":"A zero payment amount should remain zero during “Modify” in the windows ‘Security Transfers’ when it was zero originally on a saved transaction.","Products":["Business-Transactions"]},{"SimCorpReference":"D-82687","ChangeNote":"3T: Command to open \u0027Show Validation Line Check\u0027 is not of type Launch Command. A proper registration of the commandId is needed in order to be able to create the LogicalForm for the command.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-82234","ChangeNote":"Fix vulnerability - System.Text.Json for scRun and scLaunch."},{"SimCorpReference":"D-82430","ChangeNote":"When creating Final Price determination transactions it is no longer possible to have a zero value for both Recovery factor and Loss factor.","Products":["Business-AdministrativeOTCTransactions","Business-AdministrativeSecurityTransactions","StaticData"]},{"SimCorpReference":"D-80898","ChangeNote":"Tables depending on installable domain values as valid values for a column were not altered during update.\nThis was due to that the new ins file were already activated at the time of the check.","Products":["Framework-CoreFramework","Tools-UpgradeProgram"]},{"SimCorpReference":"D-82526","ChangeNote":"Implemented pulling of current Customer ID from APL instance.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-81464","ChangeNote":"Save only formula fields in API with unique case insensitive names","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81884","ChangeNote":"Resolve ambigious column in query for original tables","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-82116","ChangeNote":"To fix a program error that occurred in PFC when Dividends are being calculated","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-82534","ChangeNote":"Enhancement to the internal test framework related to 3T logical form testing. No changes to the business applications.","Products":["CsCode-Accounting"]},{"SimCorpReference":"D-82635","ChangeNote":"Auto test coverage -LFT","Products":["CsCode-UP"]},{"SimCorpReference":"S-186796","ChangeNote":"The support for XCCY lunar basis swaps made made for closed versions.\n\nTrade Manager, equity/index option: Problems with manual update of payment date.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-81713","ChangeNote":"Output list box fields were using a \u0022MultilineTextEdit\u0022 control that has default limit on number of characters. It is now changed to use a ListBox control that hasn\u0027t this limit","Products":["Framework-ApplicationFramework","Framework-GuiFramework","Framework-InternalApplicationFramework","Framework-InternalGuiFramework"]},{"SimCorpReference":"S-185228","ChangeNote":"Logical form tests for all IAS flow need to patch in 25.01 alone with brick tests and projects","Products":["Business-FundAccounting","CsCode-FundAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-82523","ChangeNote":"Populate portfolio alias for OrderCancelReplaceRequests"},{"SimCorpReference":"D-82555","ChangeNote":"A null guard has been added to the code","Products":["CsCode-Framework"]},{"SimCorpReference":"D-81920","ChangeNote":"Format long CLOBs in managed DB.","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-82502","ChangeNote":"Added logic to prevent duplicates in collection of stored favorites","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-82494","ChangeNote":"Appropriate HTTP Status code will be returned when encountered service type exception.","Products":["CsCode-Basic","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81924","ChangeNote":"The checked box filter popup now considers filter conditions from other columns.","Products":["CsCode-Framework","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-82139","ChangeNote":"A wrong authorization rule affected two Advances API endpoints (Details and IndicativeRates). This was fixed.","Products":["CsCode-IBOR"]},{"SimCorpReference":"S-180929","ChangeNote":"Added Reference Rate and Reference Rate Definition"},{"SimCorpReference":"D-82265","ChangeNote":"Corrected expected Price of prepayment","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-82533","ChangeNote":"fixed collateral result calculate on services batch job crash","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-82386","ChangeNote":"When trying to save an \u0027Order\u0027 in the \u0027Portfolio Orders\u0027 window in case the \u0027Transaction Option\u0027 \u0027Check that payment/settlement/maturity date is a business day when saving\u0027 was enabled and in case the orders \u0027Maturity date\u0027 fell on a non business day SCD reported this as error instead of warning with the consequence that is was not possible to save the \u0027Order\u0027. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-82088","ChangeNote":"flaky test","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-82124","ChangeNote":"UP DatabaseSession, does not support SessionInitDwa because the sessons are initialized by the connecion pool","Products":["CsCode-AplInterface","Framework-Database","Tools"]},{"SimCorpReference":"D-82256","ChangeNote":"An error could occur in the \u0027Collateral Manager\u0027 in case a \u0027Collateral Rule Formula Group\u0027 contained more than one \u0027Formula\u0027. This has been fixed.","Products":["Business-Collateral"]},{"SimCorpReference":"D-82128","ChangeNote":"Fixed issue with incorrect NAV performance cash flows due to prices not being adjusted with the quote factor.","Products":["Performance"]},{"SimCorpReference":"D-82324","ChangeNote":"Create cache for each command rules operation","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-180832"},{"SimCorpReference":"D-82223","ChangeNote":"Fix the crash when all pretransaction have errors in the \u0027Autoallocation via Cassini\u0027 process","Products":["Business-Collateral"]},{"SimCorpReference":"D-82264","ChangeNote":"Increased timeout for making Message broker connections in the TLS mode"},{"SimCorpReference":"D-81794","ChangeNote":"In some special cases in the \u0027Redemptions\u0027 window the \u0027Redemption\u0027 transaction was not created with the correct \u0027Agreement date\u0027. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions","Business-Transactions"]},{"SimCorpReference":"D-82413","ChangeNote":"A wrong error message: \u0022A sub or class fund can only be reported by processing the master fund.\u0022 was given, when running the \u0022Reporting data pool\u0022 fund event for a normal fund. The error has been corrected.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-82417","ChangeNote":"Length error when executing Update Adjusted Amount batch job has been fixed.","Products":["Performance"]},{"SimCorpReference":"D-81459","ChangeNote":"Fixed crash occuring in AM on selection loading when selection has both 1st and 2nd Benchmarks specified, BM1 is from Portfolio and BM2 from Index, but they are same Benchmark Index, either of the two Benchmarks is Fixed Benchmark and Asset Allocation applet is present in layout","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"S-181765","ChangeNote":"Patch of E-35290 PCL in Position Calculation","Products":["Business-Risk","Business-Transactions","CsCode-MiddleOffice","Framework-Batch","Framework-Select"]},{"SimCorpReference":"D-81762","ChangeNote":"Disallow filtering on all FxRate fields until it can be fully supported","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-82261","ChangeNote":"Updated test data generation code to include valid instrument types","CustomerApplyNote":"Updated test data generation code to include valid instrument types"},{"SimCorpReference":"D-82259","ChangeNote":"Update to the code that enables the external update of settlement data via the TAPI. The message queue status and the record sequence number must be updated and kept in sync in local transaction data structures.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-82319","ChangeNote":"Added validation for scBlob to avoid truncation.","Products":["CsCode-UP"]},{"SimCorpReference":"D-82073","ChangeNote":"Improved precision of double to OracleDecimal conversion","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-81799","ChangeNote":"An issue has been resolved, so that User details, in the User Assignments tab on trading rules, that are not overridden are now correctly updated based on overridden User group details, when the rule is re-loaded.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-82110","ChangeNote":"Fix for batch job validation of Business Entities.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-82238","ChangeNote":"Order delta publication when we have multiple events in the same data version have wrong completed flag set"},{"SimCorpReference":"D-82205","ChangeNote":"A program error could occur when getting dependencies for DXDDEFS, if the DXDDEF used a schema using external file. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-82299","ChangeNote":"Patching of D-80596 and D-80442 to 25.01","Products":["Framework-GuiFramework","Business-Cash"]},{"SimCorpReference":"D-82242","ChangeNote":"Added the  ‘Constituent’ (Basket Constituent’) from table ‘ ‘Transactions - Special Input Values’. to possible for selection general reconciliation fields\u0027 list.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-82167","ChangeNote":"Introduced separate execution scope for scenario running","Products":["CsCode-Framework","CsCode-FundAccounting","CsCode-UP"]},{"SimCorpReference":"S-179835","ChangeNote":"Improvements to the portfolio calculation\u0027s fetch of holding data, when simulating e.g. accrued interest transactions. This is particularly useful when run through the asset manager and the front office calculation services.","Products":["Business-Cash","Business-TransactionBookingAccounting"]},{"SimCorpReference":"S-185706","ChangeNote":"Date/time fields are excluded from the Compare Performance Calculation batch job.","Products":["Business-Compare","Framework-Batch"]},{"SimCorpReference":"D-81312","ChangeNote":"Used more modern approach with HttpClient class","Products":["CsCode-Mediator"]},{"SimCorpReference":"D-81960","ChangeNote":"Fix defect: DWH load fails because of new line character in free comment field"},{"SimCorpReference":"D-82257","ChangeNote":"If running in a 3T session, it will no longer be possible to Start and Stop a batch job group.","Products":["Framework-Batch"]},{"SimCorpReference":"D-82272","ChangeNote":"This fixes an internal technical issue with the patching of Adjust Amount in Performance Calculation to 25.01","Products":["Performance"]},{"SimCorpReference":"D-81892","ChangeNote":"It was not possible to modify the field \u0027Use utilisation fee\u0027  if transactions existed. This has been fixed.","Products":["StaticData"]},{"SimCorpReference":"D-81535","ChangeNote":"Bind values are checked, against metadata","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-82084","ChangeNote":"Correction of assertion error for External Client Trade  generation via STP when GC is used and cost/tax is present on transaction","Products":["Business-Transactions"]},{"SimCorpReference":"D-82165","ChangeNote":"Updated test","Products":["Framework-Database"]},{"SimCorpReference":"S-183452","ChangeNote":"Changes to IMW subject area - Order Mgmt,  New objects for Reconciliation area, Field size change for pNODENAME, pRATING"},{"SimCorpReference":"D-82097","ChangeNote":"Fix test\u0027s dependency on file system. Move arguments from file to the test itself","Products":["Business-Collateral"]},{"SimCorpReference":"D-82213","ChangeNote":"25.01 Web-UC package version upgrade"},{"SimCorpReference":"D-82136","ChangeNote":"A program error occurred when doing a \u0027Deep scan\u0027 for an entity including a segment referring Parties. This has been corrected.","Products":["Framework-ConfigurationTransport"]},{"SimCorpReference":"D-82078","ChangeNote":"Copy NLS_LANGUAGE Oracle parameters from default database parameters too.","Products":["CsCode-UP"]},{"SimCorpReference":"D-81485","ChangeNote":"Fixed various compatibility","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP","Framework-Batch","Framework-Database","Tools"]},{"SimCorpReference":"D-81927","ChangeNote":"All price timestamps of any price type are updated, even when the updates are received simultaneously."},{"SimCorpReference":"S-184011","ChangeNote":"No Customer impact. Extend test coverage via patch to 25.01 version","Products":["Business-GeneralTransactions","Business-TransactionBookingAccounting","CsCode-Accounting","CsCode-Framework","CsCode-FundAccounting","Framework-Calculations","Framework-CoreFramework","Framework-ToolsInternalAccounting","CsCode-UP"]},{"SimCorpReference":"D-82170","ChangeNote":"Fix FormDescription.GrandTotals json serialization","Products":["CsCode-UP"]},{"SimCorpReference":"D-82014","ChangeNote":"For the non deliverable swap \u0027Instrument sub-types\u0027 \u0027Non-deliverable IR swap, fixed/float\u0027 and \u0027Non-deliverable Cross currency, fixed/float\u0027 in the APL transactions windows like e.g. the \u0027Swap and Dual Currency Payments\u0027 window when changing the \u0027Interest PC\u0027 the \u0027Interest SC\u0027 was not aligned. This has been fixed.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"S-185562","ChangeNote":"Patching of Adjust Amount in Performance Calculation to 25.01","CustomerApplyNote":"Patching of Adjust Amount in Performance Calculation to 25.01","Products":["Business-Compare","Performance","Framework-Batch"]},{"SimCorpReference":"S-185299","ChangeNote":"3T: Only applications with 3T status ApproveForProduction must be accessible from web portal in production installations (5\u003ExcomWhere)","Products":["Framework-ApplicationFramework","Framework-CoreFramework","Framework-GuiFramework"]},{"SimCorpReference":"D-82157","ChangeNote":"Secure value generated"},{"SimCorpReference":"D-81898","ChangeNote":"Support Variable Yield Adjustment for Kassenverein Bonds.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-81705","ChangeNote":"NVL should only be added in field-list when getting data from Oracle - when sending data to Oracle it should be omitted.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81980","ChangeNote":"Add support for order change requests in document link.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-81981","ChangeNote":"Add case for Cancel/Cancel Replace"},{"SimCorpReference":"D-80553","ChangeNote":"Trade Manager, equity options: Workaround for effective date in orders.","Products":["TradeManager","CsCode-Trading"]},{"SimCorpReference":"D-81983","ChangeNote":"A crash could occur when importing Reallocation Collaterals with the DFS. This change fixes the crash.","Products":["Business-Connectivity","Business-GeneralTransactions","Business-Transactions"]},{"SimCorpReference":"S-185373","ChangeNote":"Batch Jobs and Batch Job Groups have now 3T status ReadyForProduction","Products":["CsCode-Framework","Tools-Utilities"]},{"SimCorpReference":"D-82038","ChangeNote":"Reduce the workload on directory service . Limit number of concurrent requests  to post trade service done by compliance online service","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-82045","ChangeNote":"Cosmetic change to Upgrade SQL scripts. Removes \u0022DEV\u0022 from Doc section and spool name. No impact on code."},{"SimCorpReference":"D-82036","ChangeNote":"Fix name of form in JSON for 3T forms.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-82018","ChangeNote":"The error message, when launch of the portal fails, has been improved.","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-81827","ChangeNote":"flaky test","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-81424","ChangeNote":"Cut and paste actions should be present in context menu when called on initial context","Products":["Business-Transactions"]},{"SimCorpReference":"D-80560","ChangeNote":"Update db call to resolve database locks","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-81854","ChangeNote":"added additional pTRCPRICE cleaning for trcSell when pTRCBUSNO is changed","Products":["Business-Transactions"]},{"SimCorpReference":"D-81612","ChangeNote":"Corrected a crash when using drop-down behaviors in list elements.","Products":["XpressInstruments"]},{"SimCorpReference":"D-81881","ChangeNote":"An issue occurred in the \u0027Position Analysis\u0027. When a \u0027Pricing profile\u0027 with fund decomposition and a \u0027Decomposition profile\u0027 was applied. The order of the \u0027Component types \u0027 was altered after updating the analysis, while other attributes (e.g.,  the order of the Issuer\u0027) remained unchanged. This has been fixed.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-81966","ChangeNote":"Compliance cleanup crashed with length error due to typing error. Was fixed","Products":["Business-Compliance"]},{"SimCorpReference":"S-181111","ChangeNote":"New Dimension - Swap Security to handle IRS and TRS"},{"SimCorpReference":"D-81968","ChangeNote":"change note"},{"SimCorpReference":"D-81848","ChangeNote":"The performance of the \u0027Cleanup unused holding keys\u0027 have been optimized.","Products":["Business-TransactionBookingAccounting","Framework-Database"]},{"SimCorpReference":"D-80183","ChangeNote":"An error when creating transactions from events with decomposition has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-79622","ChangeNote":"Fixing crash with time bucket, when swap legs isn\u0027t found","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81887","ChangeNote":"Defect on test installations with empty analytics packages for onboarding fixed.","CustomerApplyNote":"Defect on test installations with empty analytics packages for onboarding fixed. Will be patched down to 25.01.","Products":["CsCode-FlexAnalytics"]},{"SimCorpReference":"D-81754","ChangeNote":"When changing the \u0027Current value PC\u0027 field in the  the \u0027Cash Buckets - Move Cash\u0027 window, sub window \u0027To/From Accounts\u0027, the \u0027Amount\u0027 and the \u0027Current value QC\u0027 fields were always rounded to 0 decimals. This has been fixed.","Products":["Business-DealerSecurityTransactions"]},{"SimCorpReference":"D-81808","ChangeNote":"Importing of Fund Administration Manager configurations werent updating records","Products":["CsCode-FundAccounting"]},{"SimCorpReference":"S-184409","ChangeNote":"Resolving a SonarQube issue about a potential null issue in the transaction connectivity settlementUpdate code.","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-81618","ChangeNote":"Make \u0022Index decomposition\u0022 batch more memory efficient.","Products":["Performance"]},{"SimCorpReference":"D-81055","ChangeNote":"Clean up configuration settings to prevent possible problems"},{"SimCorpReference":"S-183534","ChangeNote":"NFRD updates as per Guidance released 8.11.2024.","CustomerApplyNote":"When having the NFRD FlexAnalytics onboarded, you need to onboard again to get the latest changes and add the new segments for regional bonds, cash, and real estate funds.","Products":["CsCode-FlexAnalytics","CsCode-PortfolioManagement"]},{"SimCorpReference":"S-184988","ChangeNote":"The suspension days are not relevant for lunar OIS and are being disabled in case the chosen index is a lunar OIS index.\n\nThe functionality to support lunar overnight indices is implemented in lower versions.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-81710","ChangeNote":"To fix an issue when From Date didn\u0027t work for CFDs position adjustment transactions","Products":["Business-Transactions"]},{"SimCorpReference":"D-81268","ChangeNote":"To fix an error that occurred if to run BJ \u0027Transfer to static data\u0027 twice.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-81781","ChangeNote":"It was not possible anymore to save \u0027Free comments\u0027 in \u0027General Reconciliation Results\u0027. This has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-81509","ChangeNote":"Enable cash management to process two separate payments when the only difference between two identical dividends is the \u0027Ex-dividend date.\u0027","Products":["Business-CashManagement","Business-CorporateActions","Business-Transactions"]},{"SimCorpReference":"D-81125","ChangeNote":"Add the missing pointer on the decresf listo to avoid crash due to index error","Products":["Performance"]},{"SimCorpReference":"D-81620","ChangeNote":"In the Portfolio Calculation\u0027 when \u0027Simulating Cash flow\u0027 for \u0027Call Moneys\u0027 in case the \u0027Forecast from date\u0027 equaled the \u0027Date latest coupon\u0027 on the relevant holding it cold happen that the \u0027Accrued Interest\u0027 was not calculated on the according \u0027CloseCallM\u0027 transaction. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-81847","ChangeNote":"Configuration import for state control window fails if setup doesnt contain window information.","Products":["Framework-Configuration"]},{"SimCorpReference":"D-81522","ChangeNote":"NLS also copied for DbCommoad alter session.","Products":["CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-81295","ChangeNote":"Various DB optimization fixes.","Products":["CsCode-AplInterface","CsCode-Framework","Framework-Database","Tools"]},{"SimCorpReference":"S-182689","ChangeNote":"In 3T \u0027Execute\u0027 has be removed from Batch Jobs and Batch Job Groups.","Products":["Framework-Batch","Framework-Common"]},{"SimCorpReference":"D-81575","ChangeNote":"Fixed wrong lookup in a ConcurrentDictionary.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81210","ChangeNote":"Reintroduced dump functionality after ScDump was deleted"},{"SimCorpReference":"D-81712","ChangeNote":"It was not possible to delete a Pricing and Key Ratios Definition if it was used in an old service configuration. This has been corrected.","Products":["Framework-Services"]},{"SimCorpReference":"D-79991","ChangeNote":"For \u0027Securities Lending\u0027 positions with \u0027Fee paid\u0027 set to \u0027Last in month\u0027  it was not possible anymore to create the final  \u0027Premium\u0027 transactions after the position was closed on its \u0027Maturity date\u0027. This has been fixed.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-81292","ChangeNote":"Allow to create orders on defaulted bonds after maturity","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-81787","ChangeNote":"A program error could occur when importing Formula Values. This has been corrected.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-81390","ChangeNote":"N/A: Internal change that should not cause any changes in the system\u0027s behavior. Integration tests built with DbInjector may be flaky due to not all DB pointers being initialized during the opening connection to DB. Fixed. Now, DbInjector is not using Database Framework during connection establishing.","Products":["CsCode-Accounting","CsCode-Collateral","CsCode-FundAccounting"]},{"SimCorpReference":"D-80811","ChangeNote":"Set maturity to last irregular redemption in Principia","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"S-181311","ChangeNote":"The functionality to support lunar overnight indices is implemented in lower versions.","Products":["TradeManager"]},{"SimCorpReference":"D-81402","ChangeNote":"TM Open IRS transactions after matching, unexpectedly  got the current value and payment amounts calculated. Fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-81686","ChangeNote":"Suffixes have been removed in portal","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-81590","ChangeNote":"Correction to the code that evaluates the relevant put/call dates with respect to the draw date for the ‘Create Draws’ window.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-81533","ChangeNote":"The \u0027Position Calculation\u0027 could crash in case it was calculating  \u0027Accounting analytics\u0027 for \u0027FX Forwards\u0027 and in case not all \u0027Balance fields\u0027 were to be calculated and we were not calculating \u0027restricted analytics for reinvestment\u0027. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-81398","ChangeNote":"flaky test","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-81593","ChangeNote":"The format of the output text was fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-81362","ChangeNote":"Fix the relative path to FakeItEasy nuget package","Products":["CsCode-UP"]},{"SimCorpReference":"D-81130","ChangeNote":"It was not possible  to create \u0027Restitution\u0027 transactions for holdings tat were Nominal and P/L wise \u0027Model Portfolio\u0027 and \u0027Model Portfolio Restitutions\u0027 reallocated. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-81626","ChangeNote":"Corrections for GUI integration tests","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-81642","ChangeNote":"Change from later versions will be patched to fix issues in 25.01","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81370","ChangeNote":"While booking intraday reallocation with restitution balances - take into account previous reallocation values - not recalculate it","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-81369","ChangeNote":"Replaced test data to not use real IP and hostname","Products":["CsCode-UP"]},{"SimCorpReference":"D-80730","ChangeNote":"Fixed crash in Performance Measurement with:\n\nSecurity ID split in IS\nNode with no MPs added in SAAM\nCalculation of average weight to parent (or parent \u002B top)\nNo portfolio holdings in the calculation period\nUse benchmark calculation results","Products":["Performance","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81514","ChangeNote":"Resolved an issue in the PFC when calculating accrued end of period fees for Call Money instruments and Loan Facilities","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-80554","ChangeNote":"For Off-balance instruments under match-like P/L methods, on the decrementing transactions the P/L calculation for P/L and the sum of the P/L on the tax lots for Book/Cost Sec/Ccy PC fields has been changed: the P/L rounding residual is now assigned to one of the tax lots, instead of the position level.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-80571","ChangeNote":"fix failing APL L1 tests","Products":["CsCode-AplInterface","CsCode-UP","Framework-Database","Business-GroupAccounting"]},{"SimCorpReference":"D-81111","ChangeNote":"Adding support for the non dataowner to use the progUnifiedDbi. The credentials specified on the APL workspace, will also be used in the UP connection pool for creating database connections. Implemented support for Roles, Vault and SAR.","Products":["CsCode-Framework","Framework-Database"]},{"SimCorpReference":"D-81372","ChangeNote":"Add thousands separator in limit type list value grid","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-81143","ChangeNote":"Fixing Bind Values","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81393","ChangeNote":"An update was made that fixes an issue with GCA and cost/taxes. A crash could occur when saving transactions with cost/taxes on from forms not supported by GCA, when GCA is enabled in installation. Now transaction gets saved, but still without GCA.","Products":["Business-Transactions","CsCode-PortfolioManagement"]},{"SimCorpReference":"S-178748","ChangeNote":"Migrate Web-UC pipeline to MG"},{"SimCorpReference":"D-81381","ChangeNote":"No user should be affected. Fix of the flaky autotest in the internal environment.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-81188","ChangeNote":"Show (Blank) option in EditorList filter popup in checked list  mode.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-81056","ChangeNote":"Fixed DateTime type formatting for v2 endpoints","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-81080","ChangeNote":"Quote value from Simulations applet for futures quoted on yield is now passed to Forward yield field on Dealer Futures form when transaction is created from simulation in Asset Manager. You need to have Forward yield field in corresponding filter definition (order filter).","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80535","ChangeNote":"Handle numeric alias of zero (0)","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"S-183245","ChangeNote":"Some unit test are still saving logs on  a fixed internal drive. Make them save logs in the SCD log directory.","CustomerApplyNote":"Some unit test are still saving logs on  a fixed internal drive. Make them save logs in the SCD log directory."},{"SimCorpReference":"D-79497","ChangeNote":"Fixed fetching security static data for multi-legged transactions inside transaction matching service","Products":["Business-STP"]},{"SimCorpReference":"D-81022","ChangeNote":"Problem with getting correct response for Advance Details Web API  endpoint was corrected","Products":["CsCode-IBOR"]},{"SimCorpReference":"D-81216","ChangeNote":"Show BM and MP lines with regular font, when there is a Benchmark or Model either error or warning.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80659","ChangeNote":"Fix the issue with a missing Upfront Amount value on the Order Manager Allocation and corresponding transaction in the SCD for CDS Single Name orders being automatically allocated after fix execution."},{"SimCorpReference":"D-81344","ChangeNote":"Implement patch from 24.04 into 24.01"},{"SimCorpReference":"D-81444","ChangeNote":"add missing function","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81249","ChangeNote":"Fix performance issue in  ggdFetch_CompAggregator","Products":["Decomposition"]},{"SimCorpReference":"D-81262","ChangeNote":"Portfolio calculations running on PCL frameworks could give error messages about enabled booking stop. The error has been corrected.","Products":["Business-PeriodClosure"]},{"SimCorpReference":"D-80932","ChangeNote":"Sell Xpressinstrument transactions created in Trade Manager will no longer have delivery defaults applied.","Products":["Business-SettlementCostDefault"]},{"SimCorpReference":"S-181068","ChangeNote":"The synthetic FX hedge return calculation now supports the two tics based methods that are named \u0027Spot \u002B tics \u002B Int. price Ccy\u0027 and \u0027Spot \u002B tics \u002B Int. price (base Ccy)\u0027.","Products":["Benchmarks","Performance"]},{"SimCorpReference":"S-176342","ChangeNote":"Added New Fact For Performance Analytics Time Series"},{"SimCorpReference":"D-81101","ChangeNote":"Increased length of the fields Risk Factor ID, Risk Class ID, Import Risk Factor Id","Products":["Business-Risk"]},{"SimCorpReference":"D-80724","ChangeNote":"Fixed issue with aliasing tables referenced both via qualified fields and join paths.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"S-162972","ChangeNote":"Add ApiRequestTimeoutSeconds configuration parameter for determination of single API call timeout","Products":["CsCode-SystemOperation","Framework-Configuration"]},{"SimCorpReference":"D-81349","ChangeNote":"Patch of the corrections implemented on S-1802060 and S-178986","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-81086","ChangeNote":"Increasing width for pNODENAME pointer that enables long name for Issuer","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80528","ChangeNote":"Fixed issue with join information in sub queries","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80408","ChangeNote":"File upload fix","Products":["CsCode-UP","CsCode-Framework"]},{"SimCorpReference":"D-81296","ChangeNote":"Fix for mapping null users","Products":["CsCode-Framework"]},{"SimCorpReference":"D-81075","ChangeNote":"When order is excluded from approval because of compliance validation\nand\nrejected by trader ,\nIf we try to delete it, CR is issued and auto-rejected by OM, because OM does not track this order anymore. Removed such delete requests from approval, so that they do not generate CRs.","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80934","ChangeNote":"Fix incorrect names for default fields, which break the Select Fields applet","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81245","ChangeNote":"Three new columns have been added to table SERVERPROCESEXECS, to hold information about CPU and memory used.","Products":["Framework-Services"]},{"SimCorpReference":"D-81097","ChangeNote":"Ensure exceptions during data read is propagated to APL caller","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-81140","ChangeNote":"fix inputBindValues list in UP","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-81036","ChangeNote":"Fixed a compliance related error that could lead to database errors when multiple orders are validated simultaneously.","Products":["CsCode-Compliance"]},{"SimCorpReference":"S-183210","ChangeNote":"Patch the batch job which runs cleanup of the specific risk covariance and volatilities.","Products":["Framework-Batch","Business-Risk"]},{"SimCorpReference":"D-80882","ChangeNote":"When \u0027Security Lending\u0027 maturity transactions using the \u0027\u0027Create Securities Lending Transactions\u0027 .\u0027 window. \u0027Settlement Defaults\u0027 for underlying position legs were not saved. This has been fixed.","Products":["Business-AdministrativeOTCTransactions"]},{"SimCorpReference":"D-80174","ChangeNote":"Use the Risk factor selection from the referenced Risk factor scenario when calculating delta vectors for a Pricing and Key Ratios Definition.","Products":["Pkr"]},{"SimCorpReference":"D-80858","ChangeNote":"Improve stability of the connection between RTMain and its satellites during the initialization phase.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-80676","ChangeNote":"Corrected function definition to comply with the bind information and arguments.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81034","ChangeNote":"Updated Client secret under interface options to fix connection issue when using comore  API"},{"SimCorpReference":"D-81193","ChangeNote":"When simulating \u0027Cash flow\u0027 in the \u0027Portfolio Calculation\u0027 in case e.g. the \u0027Maturity Convention\u0027 \u0027Int. adj. w. spread\u0027 was used for a \u0027Swap leg\u0027 and if a \u0027Fixing curve\u0027 was used for calculating the relevant \u0027Cash flow\u0027 it could happen that the simulated \u0027Payments\u0027 were extremely large and hence wrong. This has been fixed.","Products":["Valuation"]},{"SimCorpReference":"D-80731","ChangeNote":"Prevent Faulty Impersonation attempts"},{"SimCorpReference":"D-81239","ChangeNote":"Fixed calculation of Old notional bal. in Total Return Swap Resets and Payments window when \u0027Use effective date\u0027 checkmark enabled","Products":["Business-DealerOTCTransactions"]},{"SimCorpReference":"D-80900","ChangeNote":"If QC is GC and this is TM transaction where there is no GCA subform, then the GCA values were not recalculated in case the related QC values were changed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-80576","ChangeNote":"Fixed bogus trader after auto-routing block order to Platform"},{"SimCorpReference":"D-80537","ChangeNote":"Change space to empty string for NotNull type when we read it","Products":["CsCode-UP"]},{"SimCorpReference":"D-81042","ChangeNote":"Dates are treated as integer values and the timepart (fraction) is truncated.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-81090","ChangeNote":"Made parser and formatter for formula field matched to formula type","Products":["CsCode-Framework","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81214","ChangeNote":"Have found a conversion program that could take long time, could benefit by using parallel degree on all queries.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-80417","ChangeNote":"We will now show the details for a failing rule in a combined rule. Even if the rule itself is not directly affected by the order.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-81185","ChangeNote":"Remove pCARLAEADATE from BASE_1556 \u002B Patch","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80565","ChangeNote":"Dealing desk is properly updated on Web API classic portfolio order data after portfolio order is added to a program with a dealing desk change."},{"SimCorpReference":"D-80937","ChangeNote":"No visible changes for end user. Move flaky match unit test testMatchIntSimpleRecCo11 to Release Verification Pipeline.","Products":["Business-Match"]},{"SimCorpReference":"D-79236","ChangeNote":"Rename title of some Settlement Trade Status fields","Products":["Business-SettlementManager","CsCode-Settlement"]},{"SimCorpReference":"D-81054","ChangeNote":"DWH: Fix data corruption when loading BD_FUND_SCHEME","Products":["CsCode-DataWarehouse"]},{"SimCorpReference":"D-81017","ChangeNote":"Enhance performance in Position Calculation loops in case there are hundreds of thousands holdings","Products":["Business-Risk"]},{"SimCorpReference":"S-182268","ChangeNote":"Patch to 25.01 Introduced MT 306 type and sub-types","Products":["Business-AuxJobFramework"]},{"SimCorpReference":"S-179737","ChangeNote":"New CDS Security Dimension and transactional fields in Transaction fact"},{"SimCorpReference":"D-80349","ChangeNote":"Remove Balance P/L Fund Income Taxation fields from PCL supported fields and add these fields to list of not supported fields.","Products":["Business-TransactionBookingAccounting","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-81115","ChangeNote":"There was no logging from APL tasks started on the Front Office Data Load Balancer service. This has been fixed now.","Products":["Business-FrontOfficeData","CsCode-FrontOffice"]},{"SimCorpReference":"S-179608","ChangeNote":"Change return form AxiomStressTestApi from entity to info string","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-78607","ChangeNote":"Adding ComplianceFree Comment to render to enable it again","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-80518","ChangeNote":"No change","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-80677","ChangeNote":"In the case of APL Unit Test SQL statement to string was converter to upper case.","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-80795","ChangeNote":"On changing to empty put default value","Products":["Reconciliation"]},{"SimCorpReference":"S-182672","ChangeNote":"change note."},{"SimCorpReference":"D-81091","ChangeNote":"Reduce memory consumption. Benchmarks","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-81007","ChangeNote":"Some exceptions from UP are now propagated to the client side.","Products":["CsCode-UP"]},{"SimCorpReference":"D-80902","ChangeNote":"BM incremental upload job: Fixed an error, where we could end up doing a full upload, if no recent benchmark calculation executions were found.","Products":["Performance"]},{"SimCorpReference":"D-80891","ChangeNote":"Solæved a number of test findings:  F5 did not work\nMissing check for empty Destination type\nShould be possible to save storage destination, when the referenced bus destination is not loaded.\nWhen deleting a destination, ensure there are no references to it in database or in the grid.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80788","ChangeNote":"Before inserting into general reconciliation log table all data will be trimmed according to the max allowed length.","Products":["Business-Collateral","Business-Reconciliation"]},{"SimCorpReference":"D-80395","ChangeNote":"Code refactoring of Corporate Actions core for improving performance of Corporate Action WEB API. No changes visible for users.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80855","ChangeNote":"Correction of program error reported in the Match screen when APL FX Option exercise transactions are being matched.","Products":["Business-Transactions"]},{"SimCorpReference":"D-78694","ChangeNote":"An error in updating order amounts after a high-level transaction was deleted during a booking stop has been fixed","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80407","ChangeNote":"Change type of field PFCFRMLRESIK to big integer on database","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-80815","ChangeNote":"A crash could happen in Batch Jobs of type \u0022Benchmark Calculation - Upload Results \u0022 if running a full upload on a limited time period and uploading data for a constituent based index, where components were disappearing on the start date.","Products":["Performance"]},{"SimCorpReference":"D-80842","ChangeNote":"Remove pLAEADATE  from tables \u002B Patch","Products":["Business-Connectivity","Business-EquityAccounting","Business-GeneralTransactions","Business-GroupAccounting","Business-PeriodClosure","Business-Reporting","Business-Risk","Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting","Business-Transactions","Business-ViewPositions"]},{"SimCorpReference":"D-80913","ChangeNote":"Transformation service correctly monitors message broker"},{"SimCorpReference":"D-80725","ChangeNote":"Fields described as ZeroAsNull on database, will we wrapped in a NVL","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80970","ChangeNote":"Handled Operation canceled exception for post draining op","Products":["CsCode-UP"]},{"SimCorpReference":"D-80225","ChangeNote":"Remove redundant error messages from Risk Measurement, when we are using imported sensitivities when pricing CDS, CDS Option and XpressInstrument","Products":["Business-Risk"]},{"SimCorpReference":"D-80805","ChangeNote":"Carried mark to market adj QC/PC are specially treated in the Tax Lot Corrections form regarding their access","Products":["Business-Transactions"]},{"SimCorpReference":"D-80667","ChangeNote":"Front Office Options: During configuration import we should allow for empty compliance clean-up dates.","Products":["Business-Compliance","CsCode-Compliance","Framework-Configuration"]},{"SimCorpReference":"D-80928","ChangeNote":"Fix error in specified configuration path for NATS port number"},{"SimCorpReference":"D-80657","ChangeNote":"It should be visible on a holding that it has participated in the duration hedging step both as \u0022Duration hedging\u0022 holding and as \u0022Exposure increasing\u0022. We will indicate this in the Selection column via the \u0022mark\u0022 \u0027HD\u0027","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-79297","ChangeNote":"Fix disappearing  BM positions (client specific) in Portfolio sheet while the job is being executed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80296","ChangeNote":"Fix issues with AM formulas in Current Position API","Products":["CsCode-Basic","CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80764","ChangeNote":"Capton should be taken into account on updating grid column."},{"SimCorpReference":"D-80821","ChangeNote":"There is the technical change that does not effect any customer installations."},{"SimCorpReference":"D-80787","ChangeNote":"Fi x refresh AM SAAM data by batch job groups","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80158","ChangeNote":"Capability to override max page size for ims-api","Products":["Business-Match","CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-80698","ChangeNote":"Special characters in the property values of the Formula Attribute are now  escaped properly by the compiler","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80719","ChangeNote":"CDS-specific fields for simulations and orders did not contain any values when used from the Current Positions-Api","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80200","ChangeNote":"Fixes crash by importing Report Properties","Products":["Business-Reporting"]},{"SimCorpReference":"D-80723","ChangeNote":"The length of the literals vector determines if multiple datasets are used or a single query is issued","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80827","ChangeNote":"Change Axioma View Id title","Products":["CsCode-MiddleOffice"]},{"SimCorpReference":"D-80530","ChangeNote":"Fixed issue with autonomous inserts  in APL using UP DBI (outside transaction scope)","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80369","ChangeNote":"Fixed issue with logging incidents with long header having space at position 80","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80769","ChangeNote":"Fix for TaskCanceledException during Draining of Session","Products":["CsCode-UP"]},{"SimCorpReference":"D-80552","ChangeNote":"Fix problems with message broker discovery when message broker is restarted"},{"SimCorpReference":"D-80836","ChangeNote":"Technical/3T: If there was a mix of \u00222T rows\u0022 and \u00223T rows\u0022, changing a value in a newly created  \u00223T row\u0022 could cause wrong data updates from BL code.","Products":["Framework-InternalApplicationFramework"]},{"SimCorpReference":"D-80516","ChangeNote":"Accept outer join as valid field path join","Products":["CsCode-UP"]},{"SimCorpReference":"D-80536","ChangeNote":"Fixed discrepancy between the old and new stack for dbInsert2Sql","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80427","ChangeNote":"Fix the inability to run parallel load plans with a fund scope being applied","Products":["Business-DWH","CsCode-Reporting"]},{"SimCorpReference":"D-79910","ChangeNote":"changing the loading data approach while opening strategy in Amend  to show correct data state"},{"SimCorpReference":"D-80335","ChangeNote":"Updates for log message creation.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80088","ChangeNote":"Change exception to a more self-explanatory one.","Products":["CsCode-SystemOperation"]},{"SimCorpReference":"D-80671","ChangeNote":"Handled issue with selecting empty blobs","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-79500","ChangeNote":"Fixed calculation of I-spread for forward started bonds/swaps and/or bonds/swaps which are interest only or have non-bullet redemption structure. For bonds/swaps priced with zero coupon yield curve, swap rate on bond/swap maturity is calculated from zero coupon yield curve using syntethic swap which has the same payment dates and coupon terms as original one, but bullet redemption. For forward started bonds/swaps, swap rate is calculated on bond/swap effective(start) date.","Products":["CsCode-Basic","CsCode-Connectivity","CsCode-MiddleOffice"]},{"SimCorpReference":"D-80688","ChangeNote":"3T/Technical: As a unintended side effect of D-80390, dynamic popup menus were not included the first time a popup menu was requested.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80831","ChangeNote":"When sending blob id\u0027s to azure service bus, no bus was defined, leading to a crash.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80519","ChangeNote":"Fixed issue with nested aggregate functions","Products":["CsCode-UP"]},{"SimCorpReference":"D-80606","ChangeNote":"There was an error, when after applying autofill rules \u0027Show manual changes\u0027 pop-up showed changes for the field \u0027Reconciliation free code 5\u0027, even when there were no changes for that field (Previous value = New Value = \u0027\u0027(empty)). This error has been fixed.","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-80136","ChangeNote":"Optimize cash bucket assignment when booking new holdings in FO holdings.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-79295","ChangeNote":"Optimizing database queries in the AI Manager area.","Products":["CsCode-UP","Framework-Database"]},{"SimCorpReference":"D-80512","ChangeNote":"Complex matching for e.g. Swaps cold wrongly fail with the error message \u0027Identifier fields do not match or match setup details were not found for an instrument specific match field.\u0027\u0027. This has been fixed.","Products":["Business-Match"]},{"SimCorpReference":"D-80803","ChangeNote":"Fixed integrated Order service discovery of Message  broker"},{"SimCorpReference":"D-79861","ChangeNote":"Auto-allocation fails for CDS block orders with \u0022Allocation will result in an over-allocation\u0022"},{"SimCorpReference":"D-80459","ChangeNote":"To fix a program error that occurred in CAM/Elections if to use Audit trail functionality","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80485","ChangeNote":"\u0027Aux. message sub-type\u0027 caption has been made more understandable.","Products":["Business-Match"]},{"SimCorpReference":"D-79989","ChangeNote":"To fix an issue when not all transaction legs are removed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80126","ChangeNote":"The Performance Calculation now creates synthetic payments for CDS positions that have Position Netting CDS transactions. The transaction closes the positions that should be netted and creates a single new netted position. The transaction does not create any real payments and thus synthetic payments should be created to account for the change in market value.","Products":["Performance"]},{"SimCorpReference":"D-80564","ChangeNote":"GetOrders API can now use roles authorization","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80390","ChangeNote":"3T: Not all type of grid popup menus were handled correctly.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80568","ChangeNote":": Update to the code that initializes cached objects for the Securities Finance Manager. The fields from tTRANSFACILITY for loan facilities data are already excluded in this context but the field ‘Unsettled Trade External Link’ (fpUNSETTRADEEXLINK) was forgotten (S-164336). It should be excluded for the time being.","Products":["Business-SecuritiesFinanceForecast"]},{"SimCorpReference":"D-80475","ChangeNote":"When running the \u0027Corporate Actions Manger\u0027 dashboard service ORA Integrity constraint error could appear. This has been fixed.","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-80678","ChangeNote":"A program crash occurred when trying to import a entry of type INVSTRDEFS. This has been corrected.","Products":["Business-Modelling"]},{"SimCorpReference":"D-80524","ChangeNote":"Use HelpUtilities to create a help URL.","Products":["CsCode-Framework","CsCode-HelpUtilities","Framework-GuiFramework"]},{"SimCorpReference":"D-80440","ChangeNote":"When trying to delete a \u0027Payments Security Defaults\u0027 transaction having \u0027Forced Closed transactions\u0027 an error could occur. This has been fixed.","Products":["Business-Cash"]},{"SimCorpReference":"D-79095","ChangeNote":"What are the problems/motivations for the changes?\nWhen making partial reallocations for positions with a high number of tax lots then a rounding check could end up putting a too big correction on single tax lot. By too big it is meant above 2 times the smallest unit of the currency e.g. 0.02 for EUR or USD). This would cause the golden equation to fail for the corrected tax lot.\nSecondly reallocation values for Initial Premium and Discount values could become incorrect.\nThirdly if a tax lot had an incorrect value for Balance Initial Premium and Discount and was fully sold a check would be made which could cause Balance Initial Premium and Discount not to go to zero on the tax lot.\n\nWhat is the proposed solution?\nFirst the rounding check has been improved so a single lot will not get more than 2 times the smallest unit of the currency. Then later golden equation checks on individual tax lot level will be able to ensure that the golden equation holds per tax lot. As a consequence the rounding check for reallocations will affect more tax lots.\nSecondly a correction has been made to ensure correct reallocation values for Initial Premium and Discount values.\nThirdly a correction has been made so a check on Initial Premium and Discount values is not executed for fully sold tax lots.","Products":["Business-TransactionBookingAccounting","Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-80510","ChangeNote":"Fixed length of message being displayed in popup window from scd.exe as it would be truncated"},{"SimCorpReference":"D-80507","ChangeNote":"The use of tax lot characteristic formulas for formula finance fields did not work for elimination accounting. The error has been corrected.","Products":["Business-GeneralLedger","Business-InitialMarginRequirement"]},{"SimCorpReference":"D-80520","ChangeNote":"Do not use APL tool function in application code.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-80299","ChangeNote":"AM cache should not return simulations when IncludeSimulations is not specified in the create job request","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80173","ChangeNote":"Fix several bugs in processing of programs in OM AzSB messaging"},{"SimCorpReference":"S-179854","ChangeNote":"Fields domain"},{"SimCorpReference":"D-77030","ChangeNote":"An error could occur in the \u0027Covariance Manager\u0027 in case \u0027Merger\u0027 \u0027Corporate Actions\u0027 existed for at least one of the by the \u0027Risk Factor\u0027 implied securities. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-80186","ChangeNote":"Checking for connection string format and content type when destination type is storage and display errors","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80593","ChangeNote":"SystemCapabilities results contain only commands, excluding requests. In this defect we\u0027re introducing to the response the missing requests."},{"SimCorpReference":"D-80489","ChangeNote":"3T: Cleanup ReceivingTimerEvent flay if handling of the timer event crash.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80070","ChangeNote":"Calculation of Amortised currency correction PC is no longer expected for Equity Accounting Business Model Reclassifications.","Products":["Business-EquityAccounting"]},{"SimCorpReference":"D-80141","ChangeNote":"For CDS block orders Ready to Allocate flag calculation need to take into account only lines with non zero quantity as Confirmation and Allocation reports are being sent only for those portfolios."},{"SimCorpReference":"D-79224","ChangeNote":"Apply change for distributions with effect on negative book value in 24.10","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-80356","ChangeNote":"No change in user facing functionality.  Updated various unit tests to make them more stable","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-181030","ChangeNote":"For XpressInstruments, the calculation of Equivalent Life, WAL, and WADP has been improved such that instruments with payoffs in the form of a ratio (like S_t/S_0) are handled better.","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-80360","ChangeNote":"Investigate and locate unit tests with an issue.","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement","XpressInstruments"]},{"SimCorpReference":"D-80155","ChangeNote":"Minor corrections to Messaging Endpoint Configuration window","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-79643","ChangeNote":"When \u0027executing\u0027 \u0027Risk Measurement\u0027  on a \u0027Calculation Service\u0027 an assertion error could occur in case specific errors occurred during the risk calculation and if no alerts to be written were available. This has been fixed.","Products":["Business-Risk"]},{"SimCorpReference":"D-79912","ChangeNote":"Relevant FX Swap quantities are calculated during import fills process."},{"SimCorpReference":"D-80190","ChangeNote":"Add case for Cancel/Cancel Replace"},{"SimCorpReference":"S-179906","ChangeNote":"Changed \u0027Max. age of expired portfolios to be shown in the hierarchy\u0027 to \u0027Max. age of expired portfolios and entities to be shown in the hierarchy\u0027 in \u0027Front office options - Compliance\u0027.  This to reflect that this field is also applicable to business entities.","Products":["Business-Compliance"]},{"SimCorpReference":"D-80319","ChangeNote":"Use TiF from portfolio order for FX allocation instructions"},{"SimCorpReference":"D-80143","ChangeNote":"Fix for an unhandled AppDomain exception was caught.","Products":["CsCode-UP"]},{"SimCorpReference":"D-80104","ChangeNote":"Adding new menu for Messaging Endpoint Configuration window","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData","Framework-MenuTree"]},{"SimCorpReference":"D-80521","ChangeNote":"correct OracleDbType","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-79800","ChangeNote":"Ensure that the Message Broker Host URL field on the Order Manager Configuration Window is optional"},{"SimCorpReference":"D-80197","ChangeNote":"Added mapping for additional quote price types on allocation message for repo orders","Products":["Business-PortfolioManagement"]},{"SimCorpReference":"D-80293","ChangeNote":"Close Security group code name field for modification on group code values form.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80534","ChangeNote":"Fix reading query and query parameters","Products":["CsCode-AplInterface"]},{"SimCorpReference":"D-80359","ChangeNote":"Investigate L1 unit test  in  PortfolioManagement.ManagersWorkBench.Common.Application.Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80358","ChangeNote":"Reenable unit test in Common.GUI.Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80500","ChangeNote":"After D-80298 was fixed we can enable required properties at MPV editor list to run UT VerifyContributionFieldCanBeSelected successfully \u002B enable a few other UTs","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80282","ChangeNote":"Pre-calculation on Front Office Data services causes WS FULL crash in some cases. Fixed.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80260","ChangeNote":"Fix condition of pop-up showing","Products":["Business-Swift"]},{"SimCorpReference":"D-80357","ChangeNote":"Activate disabled L0 in Common GUI Test","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80189","ChangeNote":"When different \u0027Performance Measurements\u0027 ran on \u0027Calculation services\u0027 in parallel and contained/processed the same holdings in rare cases a DB error could appear. This has been fixed.","Products":["Performance"]},{"SimCorpReference":"D-79964","ChangeNote":"Program auto-aggregation check now considers AllowAggregationOfWorkingOrders option"},{"SimCorpReference":"D-80448","ChangeNote":"This change fixes single prefix given in \u0022Track And Analyse\u0022 functionality. This functionality is available to SimCorp consultant only and has no impact on business functionality.","Products":["Framework-Trace"]},{"SimCorpReference":"D-80298","ChangeNote":"Code generator for editorlist has been updated to define the property object once.","Products":["CsCode-Framework","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-80439","ChangeNote":"3T: Running e.g. Transaction Status and trying to request \u0022New Status\u0022 on a transaction, and while running Cancel button were pressed, a crash could occur.","Products":["Framework-Calculations","Framework-GuiFramework"]},{"SimCorpReference":"D-79908","ChangeNote":"Fix booking transactions in case of Return Security, Deliver Security of Cassini substitution","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80066","ChangeNote":"Forecast are split pro rata to the individual positions for the case when the JSON doesn\u0027t contain information about underwriting/model portfolio.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-80002","ChangeNote":"Rollback attempt to fix view update order","Products":["CsCode-Accounting","CsCode-Framework"]},{"SimCorpReference":"D-80503","ChangeNote":"Remove using Name in Id field in some transporters, using Key instead","Products":["CsCode-Framework","CsCode-MiddleOffice","CsCode-PortfolioManagement","CsCode-OrderManager"]},{"SimCorpReference":"D-80058","ChangeNote":"AutocompleteEnumerator doesn\u0027t count start by and sorting featues. These are implemented in GetNext() method","Products":["CsCode-Framework"]},{"SimCorpReference":"D-79638","ChangeNote":"Put needed UCRT DLLs to installation back","Products":["Valuation","Framework-CompFiles","Tools-Repository"]},{"SimCorpReference":"D-80138","ChangeNote":"N/A Fix of internal method for tests purposes - testBrick_DataInsMargManDefaults_Insert","Products":["Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-80092","ChangeNote":"The issue with the erroneous exclusion of instruments with missing MID is fixed.  Descriptive models without MID applied. Plus models are proxied to cash if the underlying MID is missing.","Products":["Business-Risk"]},{"SimCorpReference":"D-80102","ChangeNote":"Some issue was found after test of S-177616 Api finalization strory. Fix on this defect","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-80101","ChangeNote":"Added missed validation for correct Margin Call Process","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80172","ChangeNote":"Added better error message in case APL property is null.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80176","ChangeNote":"Redesign user managing process not to have unnecessary logs in Appinsight.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80028","ChangeNote":"Add Log info to Cash Transfer","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80219","ChangeNote":"The \u0027Position Calculation\u0027 could crash in case it was calculating  \u0027Accounting analytics\u0027 for \u0027FX Forwards\u0027 and in case not all \u0027Balance fields\u0027 were to be calculated and we were not calculating \u0027restricted analytics for reinvestment\u0027. This has been fixed.","Products":["Business-PortfolioCalculation","Business-Risk"]},{"SimCorpReference":"D-78731","ChangeNote":"Roll back of fix by D-75584 that was based on an wrong assumption of how portfolio booking date should work in portfolio calculation.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"S-176348","ChangeNote":"Process the forward starting coupons at HE, pass the new Effective rate from inception date to the scecKeysLog for p2p prices. Move discard fixings to the 2nd loop of hedgeKeyRatGetKeyRat, just before the p2p prices are calculated - corrected side effect. And process the special case when the designation date is before the \u00271st coupon from\u0027 date","Products":["Business-HedgeEffectiveness"]},{"SimCorpReference":"D-79981","ChangeNote":"Fix the communication error","CustomerApplyNote":"Fix the communication error","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80112","ChangeNote":"Certain SimCorp types caused Oracle errors on inserts. This error have now been fixed.","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80492","ChangeNote":"merge to 25.01","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"D-80278","ChangeNote":"In very rear cases Night job was running instead of Date rolling on FOH services. It happens, when the check is running very close to mid night. The issue is fixed.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"D-80041","ChangeNote":"No Business logic changes. Updates for test setups.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-80217","ChangeNote":"When saving an already existing e.g. \u0027LendSec\u0027 transaction one more time in the \u0027Dealer Securities Lending\u0027 window the \u0027Elm. Trans. No\u0027 of one leg was wrongly overwritten with the \u0027Elm. Trans. No\u0027 of another leg. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-79831","ChangeNote":"[TECH/3T] - handled data requests in 3T that occur at the same time with timer events - the request is ignored when triggered by a timer function","Products":["Business-FundAccounting","Framework-ApplicationFramework","Framework-CoreFramework"]},{"SimCorpReference":"D-80285","ChangeNote":"Changing of branch that is used in imsVcsRoot.kt in closed version"},{"SimCorpReference":"D-80149","ChangeNote":"Technical 3T","Products":["Business-PortfolioCalculation","Framework-GuiFramework"]},{"SimCorpReference":"D-80154","ChangeNote":"BJ auto allocate collateral: address the issue during BJ execution. BJ was completely stooped if run against invalid RecallReceive margin call.","Products":["Business-Collateral","Business-Match","CsCode-Collateral"]},{"SimCorpReference":"D-79943","ChangeNote":"Fixed Benchmark IDs and Names not being displayed for not compressed BM lines when Benchmark Compression is On","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-80306","ChangeNote":"Updated the column so empty fields are treated as the \u0022None\u0022 type.","Products":["Business-Modelling"]},{"SimCorpReference":"S-179559","ChangeNote":"rename Front Office subj area to Order Management","Products":["Business-DWH"]},{"SimCorpReference":"D-80251","ChangeNote":"Remove Broker List type restriction from BR service","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-80372","ChangeNote":"3T: If several tabs were open, system could loose track of which form has focus, e.g. when updating data in a field that already had focus when the tab was selected in the browser.","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-80135","ChangeNote":"3T: Second level tabs were visible even when they shouldn\u0027t (e.g. due to authorization).","Products":["CsCode-Framework"]},{"SimCorpReference":"D-80196","ChangeNote":"3T: Output grids without append rows allowed, should not show any rows in the grid","Products":["Framework-GuiFramework","Framework-InternalGuiFramework"]},{"SimCorpReference":"D-80233","ChangeNote":"3T: Grids with dynamically created fields could fail for some specific applications (e.g. \u0022Payment Reconciliation\u0022)","Products":["Framework-ApplicationFramework"]},{"SimCorpReference":"D-80281","ChangeNote":"Fixed issue with scrolling and focus in Select Fields panel"},{"SimCorpReference":"D-80177","ChangeNote":"For \u0027Call money\u0027 positions, if the last interest payment did not fall on the same date as the maturity date, and if the forecast in \u0027Portfolio Calculation\u0027 the \u0027started on a date after the trade date of the last interest date, the expected CloseCallM transaction was not simulated. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-80140","ChangeNote":"Adding support for ≥, ≤ and ≠ operators","Products":["CsCode-AplInterface","CsCode-Framework","CsCode-Trading","CsCode-UP"]},{"SimCorpReference":"D-80228","ChangeNote":"Margin Manager =\u003E Margin Call Tracer applet: Allocation status field of Margin Call result with RecallReceive action was not properly updated after execution of Allocate via Simplex has been done.","Products":["CsCode-Collateral"]},{"SimCorpReference":"S-179357","ChangeNote":"Move data to AIDE_MASTER, corrected AggregationResults.Integration tests results"}]