[{"SimCorpReference":"D-91238","ChangeNote":"Rounding rule field was fixed","Products":["Business-CorporateActions"]},{"SimCorpReference":"D-91425","ChangeNote":"When a SimCorp Dimension installation have too many open alerts (\u003E 10.000) the Business rules alerts service could become unresponsive during processing of alert changes and therefore were shutdown by the service platform. The error has been fixed. In addition the service now logs a warning before every new change processing  in case the SimCorp Dimension installation has more than 10.000 open alerts.","Products":["CsCode-Workflow"]},{"SimCorpReference":"D-91694","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91686","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"D-91226","ChangeNote":"Changed title of \u0022Asset Manager Cache monitor\u0022 from using the \u0022AM\u0022-abbreviation to \u0022Asset Manager\u0022","Products":["Business-EventCalendar","Business-PortfolioManagement","CsCode-PortfolioManagement"]},{"SimCorpReference":"S-212156","ChangeNote":"Add Flexible Analytics IK to Benchmark Aggregation Calculation fact","Products":["Business-Reporting"]},{"SimCorpReference":"D-91642","ChangeNote":"Fix failed tests due to changed output format. Does not affect business logic.","Products":["CsCode-Trading"]},{"SimCorpReference":"D-91445","ChangeNote":"Pre-trade results have grown in size because information irrelevant to the performed pre-trade check is included in the results. This has been fixed.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-91209","ChangeNote":"Load authorisation cache for pre-trade orders API only once","Products":["CsCode-Compliance","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90686","ChangeNote":"Ensure grid properties activated because they contain non-empty data stays active when switching to another layout.","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91586","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-91239","ChangeNote":"Add assertion for call money transactions that do not belong to corresponding collateral pool.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91580","ChangeNote":"This is an internal change for integration tests. The change has no impact on customers.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-91302","ChangeNote":"This regards transactions from the window ‘Exercise FX Options’ and similar transactions  in the Trade Manager. The calculation of the settlement amount as a sum of amount components should not be altered in the classical window.","Products":["Business-SettlementCostDefault","Business-Transactions"]},{"SimCorpReference":"D-90306","ChangeNote":"FX placement now can be auto-allocated when done for day flag is received"},{"SimCorpReference":"D-90470","ChangeNote":"Added validation which prevents auto allocation via MM or batch job for multi-currency calls via CASSINI","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-90945","ChangeNote":"Additional check if the TRS is Forward Starting is added while looking for the relevant position: Forward Started TRSs are not supported at the moment","Products":["Business-CorporateActions","XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-91446","ChangeNote":"Improve validation message for swap rate correlation standard contracts","Products":["MarketData"]},{"SimCorpReference":"D-91551","ChangeNote":"Tests modified to be not flaky","Products":["CsCode-Trading"]},{"SimCorpReference":"S-212403","ChangeNote":"Added Managed Identity connection type for AM cache services","Products":["Business-FrontOfficeData","CsCode-FrontOfficeData"]},{"SimCorpReference":"D-91021","ChangeNote":"Fixed an error that occurred when updating capital event static data for ADRs and Fund certificates with data from a new CA notification for an existing capital event.","Products":["Business-Connectivity"]},{"SimCorpReference":"D-91249","ChangeNote":"In the \u0027Portfolio Calculation\u0027 wrongly an error message complaining about missing prices could appear, incase a position was lend out and part of a hedge relationship at the same time. This has been fixed.","Products":["Business-TransactionGenerationAccounting"]},{"SimCorpReference":"D-90319","ChangeNote":"When finding the settlement date for an XpressInstrument via Capture Trade in the Order Manager, the holiday calendar specified for the instrument was not taken correctly into account.","Products":["Valuation"]},{"SimCorpReference":"D-90621","ChangeNote":"OM Automation service to use unmanaged oracle driver to be consistent with the rest of OM"},{"SimCorpReference":"D-91224","ChangeNote":"In explain price search the Quoted \u002B yield curve price method for mid-curve swaptions was incorrectly labelled as \u0022Theoretical price, mid-curve swaptions\u0022","Products":["MarketData","CsCode-Settlement"]},{"SimCorpReference":"D-87745","ChangeNote":"Fix a possible issue in OM allocation block transaction creation for CDS index. Disable recalculation of notional when dictated by block.","Products":["TradeManager"]},{"SimCorpReference":"D-91171","ChangeNote":"Unit test related. Is not visible to a user of SCD","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90430","ChangeNote":"YieldForMathAdjSold should be calculated for average financial accounting method","Products":["Business-FrontOfficeData","Valuation","CsCode-FrontOfficeData","Instruments","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-91342","ChangeNote":"Feature switch to use the new Front Office Data service is off by default. As a result, for new client Balancer does not work. Fixed. Now new Front Office Data service is used by default.","Products":["Business-FrontOfficeData"]},{"SimCorpReference":"S-211934","ChangeNote":"There was no authorisation for Portfolio Groups (only for Portfolios) in Trade Manager. This was fixed here.","Products":["TradeManager","Instruments","XpressInstruments","CsCode-PortfolioManagement","CsCode-Trading"]},{"SimCorpReference":"D-90839","ChangeNote":"Adding more resilience and logging to internalwebrequest CDL command","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-90893","ChangeNote":"Flaky test ignored","Products":["CsCode-Transaction"]},{"SimCorpReference":"S-201383","ChangeNote":"IMW updates: fix for Dims: Fra Security, Future Security, Performance Investment Structure. New dims/facts for Lineage. New fact PFC Cash Flow","Products":["Business-Reporting"]},{"SimCorpReference":"D-90429","ChangeNote":"The Rule entry - Credit Risk fields Collateral, issuer risk and Collateral, cpt. risk have now been re-enabled for holding base rules.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90297","ChangeNote":"Fix program error during payment reconciliation of private debt for cases when there was not enough data to update subledgers.","Products":["Business-Cash","CsCode-Accounting"]},{"SimCorpReference":"D-91115","ChangeNote":"A database error can occur for appendable portfolio calculation using the \u0022Recalculate changed\u0022 setting. The error has been corrected.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90498","ChangeNote":"Avoid 0 qty orders in blotter after merging programs"},{"SimCorpReference":"D-90444","ChangeNote":"Apply price rounding correctly when allocating multiple Future placements from OM","CustomerApplyNote":"Apply price rounding correctly when allocating multiple Future placements from OM"},{"SimCorpReference":"D-90680","ChangeNote":"Perform single heartbeat when NATS connection dropped and re-established"},{"SimCorpReference":"D-90320","ChangeNote":"When scrolling over templates in AM Settings Template, Cash Viewer tab display is updating.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90766","ChangeNote":"When calculating risk factor standard predictive and successive scenarios, the inflation curves risk factors were previously shocked in a way that was inconsistent with other yield-based risk factors. This inconsistency has now been corrected.","Products":["Business-Risk"]},{"SimCorpReference":"D-90089","ChangeNote":"Skip redistribution of carried nominal for internal trade, so it will not be recalculated.","Products":["Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-90232","ChangeNote":"Suggested allocation date check was added in Allocation handler.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-90353","ChangeNote":"This change corrects some problems when importing into initially closed fields using only a single import sequence group.","Products":["XpressInstruments"]},{"SimCorpReference":"S-206807","ChangeNote":"Update OASYS CBU to handle auxiliary job definitions.","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-91052","ChangeNote":"It was possible to create Reallocation Security No into security with incomplete static data. It has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90532","ChangeNote":"Change  0 values in generated file to empty, fix validations issues","Products":["Business-Risk","CsCode-MiddleOffice"]},{"SimCorpReference":"D-89895","ChangeNote":"Added function that copying Trading Platform field to the second leg","Products":["Business-Transactions"]},{"SimCorpReference":"D-90486","ChangeNote":"YieldForMathAdjSold to be present in MPV and TL","Products":["Business-TransactionBookingAccounting","Valuation","CsCode-FrontOfficeData","Instruments","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90638","ChangeNote":"In the Asset Manager (Order Outbox applet), data is not displayed when the user changes the default role. The resolution is to consume the User Context in the Authorization Handler Provider class.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90829","ChangeNote":"Conversion to dereference OASYS auxiliary job types and functionalities","Products":["Tools-UpgradeProgram"]},{"SimCorpReference":"D-91070","ChangeNote":"The \u0027Economic Benefit\u0027 was calculated wrongly on \u0027Settle Loan Facilities\u0027 transactions. This has been fixed.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90797","ChangeNote":"Ensure online static data updates are coming through for Workflow service"},{"SimCorpReference":"D-89819","ChangeNote":"CompetingBids now contains quotation type IndexedPrice for received FIX bids with PriceType Price when instrument quotation type is IndexedPrice"},{"SimCorpReference":"D-90889","ChangeNote":"Ensure that the minimum version of FNS is 25.10"},{"SimCorpReference":"D-91114","ChangeNote":"Batch job \u0022FIPA Effects Calculation - Upload Results\u0022 can only be seen if FIPA Effects Calculation module is installed.","Products":["Framework-Batch"]},{"SimCorpReference":"S-199219","ChangeNote":"Amend allocation of FX netted placements"},{"SimCorpReference":"S-209755","ChangeNote":"Trade Manager/OTC API: Fix issue with incorrect field name in error messages related to empty security ID fields\n\nTrade Manager Loan facility with GCA enabled: Payment amount GC is now updated when Cost/Tax is changed\n\nDisabled the Corporate action specific transaction codes on the Bond swap for release as feature is not yet complete\n\nUse a different counting mechanism\n\nIn the schema for OTC Search Web API the item pointer \u0027IML_instrument_type\u0027 is replaced with \u0027IML_OTC_instrument_type\u0027. Now GET and DELETE endpoints in the OTC Web API work as expected for XpressInstruments with specified IML instrument sub-type","Products":["Instruments","XpressInstruments","TradeManager","CsCode-PortfolioManagement","CsCode-Trading","CsCode-Transaction"]},{"SimCorpReference":"D-90957","ChangeNote":"Unfunded value PC was not recalculated on Settle Loan Facilities when changing Amount in contract\u0027s in-subform. That has been fixed now.","Products":["Business-Transactions"]},{"SimCorpReference":"D-90699","ChangeNote":"In Asset manager (Simulations applet) in FX Single currency window security is now filled after base/price currency is filled. This ensures correct security selection according to FX simulations defaults.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"S-123456","ChangeNote":"Margin Manager -\u003E Interest Statements tracker applet: Provide a Margin Manager user possibility to choose reason and comment on \u0022Dispute Their Interest Statement\u0022 action."},{"SimCorpReference":"D-90757","ChangeNote":"Do not check mandatory fields from state controls when passing unsettled trades from Asset Manager to Front office Portfolio calculations copy.","Products":["Business-Transactions"]},{"SimCorpReference":"D-91016","ChangeNote":"For External and Internal message queues updated a mechanism that check if the data received from DB is correct and non-ambiguous. Add solution for cases when we retrieve only one data row with data info for requested transaction number.","Products":["Business-STP"]},{"SimCorpReference":"D-90348","ChangeNote":"Collateral Cassini integration:  issue a message to user regarding not recommended AccrIntCalc settings on Pool.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-91047","ChangeNote":"Reverted an earlier data import error formatting change.","Products":["XpressInstruments","CsCode-Trading"]},{"SimCorpReference":"D-86010","ChangeNote":"Crash in Asset manager after deletion of FX Swap simulation. Fixed.","Products":["CsCode-FrontOfficeData"]},{"SimCorpReference":"D-90713","ChangeNote":"Use Pinned Connection","Products":["CsCode-Framework","CsCode-UP"]},{"SimCorpReference":"D-90758","ChangeNote":"Handler for tables which have the same form via different command iks","Products":["Framework-Audit"]},{"SimCorpReference":"D-90923","ChangeNote":"Correction  of programm error found when saving General reconciliation results","Products":["Business-Reconciliation"]},{"SimCorpReference":"D-90364","ChangeNote":"Respect the \u0027min_log_level\u0027 cnf.ini parameter in OTEL.","Products":["CsCode-Framework","Framework-Telemetry"]},{"SimCorpReference":"S-190231","ChangeNote":"High availability of the FIX API service"},{"SimCorpReference":"D-90625","ChangeNote":"Margin Management: Margin Calls with RecalReceive action and Parties Suggested Margin were not applicable for allocation via Simplex if a zero-balance Margin Account existed. Fixed.","Products":["CsCode-Collateral"]},{"SimCorpReference":"D-90468","ChangeNote":"N/A: Internal change: clients should not be affected, SmartQueue performance test improving.","Products":["CsCode-Collateral","Framework-ToolsInternalAccounting"]},{"SimCorpReference":"D-90631","ChangeNote":"GROUPCODEVALS dependency is added to the Compliance Rule configuration transport if Group Code attribute with textual value defines the rule.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90991","ChangeNote":"In some situations the message queue service did not respect the creation order of messages within a discrete group. This has been corrected.","Products":["Framework-MessageQueue"]},{"SimCorpReference":"D-90876","ChangeNote":"The error message \u0027It is not allowed to move cash between different portfolio masters\u0027 could wrongly appear when trying to load a transaction into the \u0027Overnight Account Payments\u0027 window. This has been fixed.","Products":["Business-AdministrativeSecurityTransactions"]},{"SimCorpReference":"D-90768","ChangeNote":"A correction is made to the factor based FIPA fair cash flow on decomposed spot legs of IRF positions in Performance Calculation. This affects the fair cash flow itself as well as the factor based FIPA local return, when this is calculated using the TWR based approach. The correction ensures that the cash flow adjustment is consistently based on exposure, which removes spikes in the factor based FIPA local return on decomposed IRF positions on days with buy or sell transactions.","Products":["Performance"]},{"SimCorpReference":"D-90414","ChangeNote":"[TECHNICAL/3T]  Re-enabled filter viewing. Item fields of item type 1, that are not drop-downs, should still have item sets.","Products":["Framework-InternalGuiFramework"]},{"SimCorpReference":"D-90775","ChangeNote":"An error could occur when processing \u0027Awaited Fund Events\u0027 on the STP service. This has been fixed.","Products":["Business-FundAccounting"]},{"SimCorpReference":"D-90194","ChangeNote":"The performance of the \u0027Portfolio Calculations\u0027 \u0027Recalculation changed\u0027 initialize process has been improved.","Products":["Business-PortfolioCalculation"]},{"SimCorpReference":"D-90668","ChangeNote":"Flaky test ignored","Products":["CsCode-Framework"]},{"SimCorpReference":"D-90841","ChangeNote":"for OneLib Mid curve swaptions, when filling correlation data for interpolation, interpolate first in rows  and then in option maturities","Products":["Valuation"]},{"SimCorpReference":"D-90899","ChangeNote":"Update of internal SimCorp tool, which does not affect any customer installations"},{"SimCorpReference":"D-90955","ChangeNote":"Fixed a possible crash in order auxiliary job functionality. The crash could happen during the order update when the aux job fields include some security static data field.","Products":["Business-AuxJobOrders","Business-PortfolioManagement"]},{"SimCorpReference":"D-90618","ChangeNote":"Read ApiBaseURLPrefix dynamically from cnf.ini","Products":["CsCode-Connectivity","CsCode-Mediator"]},{"SimCorpReference":"D-90771","ChangeNote":"When allocating order block allocations from the Order Manager using a CDS Index standard product, an error message saying \u0022Standard Product ID is a mandatory field and must be specified if Security group is defined as False\u0022 could occur. The missing ID is now populated with a Standard Product ID.","Products":["TradeManager"]},{"SimCorpReference":"D-90557","ChangeNote":"Increasing api test coverage for delta vector","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90577","ChangeNote":"2T GUI update flow was called in 3T which cleared update flags!","Products":["Framework-GuiFramework"]},{"SimCorpReference":"D-90445","ChangeNote":"Resolve leak in UP ConnectionPool and F.Data.Managed","Products":["CsCode-AplInterface","CsCode-UP"]},{"SimCorpReference":"S-198307","ChangeNote":"Converting Order Manager FIX API service to NET8"},{"SimCorpReference":"D-90448","ChangeNote":"After the CDS reversioning transaction, the new position could not be netted due to inconsistency in the security and original transaction number in the nominal match holdings. Here it has been fixed, the position netting transaction can be successfully saved.","Products":["TradeManager","Business-TransactionBookingAccounting"]},{"SimCorpReference":"D-89340","ChangeNote":"Remove A_COLLATERAL_SUBRESULTS.MIN_RETURN_AMOUNT field from Standard Reports","Products":["Business-Reporting"]},{"SimCorpReference":"D-90894","ChangeNote":"When there are several resulrities with imported sensitivties with intercection risk factors - risk infor was formed incorrectly. It has been fixed.","Products":["MarketData"]},{"SimCorpReference":"D-90460","ChangeNote":"Added dynamic reading of swagger.json version for downstream services"},{"SimCorpReference":"D-90863","ChangeNote":"testBrick_UtilEndTransPreConditions removed from the brick test","Products":["Business-PrivateDebt"]},{"SimCorpReference":"D-90025","ChangeNote":"Flaky test has been fixed and re-enabled again.","Products":["CsCode-Compliance"]},{"SimCorpReference":"D-90632","ChangeNote":"QC and PC key ratios were not not calculated for mid-curve swaptions using OneLib valuation. Resolved by setting pool factor to 1","Products":["Valuation","CsCode-Collateral"]},{"SimCorpReference":"D-90299","ChangeNote":"Now, in the CTM screen, if a transaction that has only outgoing messages is selected, then the \u0022Open Match\u0022 button in the form is enabled. If you press the button, the form \u0022Match\u0022 will open and the tab \u0022Deviations\u0022 will be activated. The figures of deviations will look like you get an empty (contains only zeros) confirmation message.","Products":["Business-CentralTradeManager","Business-InvestmentOperations","Business-Swift"]},{"SimCorpReference":"D-90342","ChangeNote":"Change in internal tests, no impact on customer installations","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90640","ChangeNote":"Disabled the Corporate action specific transaction codes on the Bond swap for release as feature is not yet complete","Products":["CsCode-Trading"]},{"SimCorpReference":"D-90300","ChangeNote":"For External and Internal message queues add a mechanism to check if the data received from DB (that is used to update Int and Ext message queues) represents the correct \u0022Security\u0022 in scope of the requested \u0022Transaction No\u0022.","Products":["Business-STP"]},{"SimCorpReference":"D-90547","ChangeNote":"Fix ORA-00001: unique constraint violation (SCDAT.P_DWHSYNCACTIONS) during Import of DATAWAREHOUSE entity","Products":["Business-DWH"]},{"SimCorpReference":"D-90035","ChangeNote":"Update InputFieldDefinition fields when a new row is created","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90252","ChangeNote":"\u0022Value filled PC absolute\u0022 and \u0022Value filled QC absolute\u0022 was 100x the value as expected in OOB for Finished orders with special currency (like GBp/GBP). This was corrected together with Indicative price.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90209","ChangeNote":"Reduce workspace requirement during initialisation phase of position calculation during decomposition","Products":["Business-Risk"]},{"SimCorpReference":"D-90487","ChangeNote":"Fix a crash in OM allocation message processing for FX swaps","Products":["Business-PortfolioManagement","Tools"]},{"SimCorpReference":"D-90558","ChangeNote":"Rounding rules were not applied to the suggested margin amount for Margin Call with Return/Recall actions when the setting in Collateral Manager setup =\u003E Collateral Calculations =\u003E \u0022Ignore MTA and rounding on full return/recall amount\u0022 is On. It was fixed.","Products":["Business-Collateral"]},{"SimCorpReference":"S-210040","ChangeNote":"A tab \u0027Investment Analytics Service - FIPA\u0027 has been made configurable.","Products":["Performance"]},{"SimCorpReference":"D-90765","ChangeNote":"Ensure that for MidCurve Swaptions the interpolated correlation cannot be outside the [-1,1] limits.","Products":["Valuation"]},{"SimCorpReference":"D-90718","ChangeNote":"A problem with generic payment matching using manual payment reconciliation and external netting was found and fixed","Products":["Business-STP"]},{"SimCorpReference":"D-90525","ChangeNote":"UDKR weight fields were not excluded from calculation and streaming, fixed now.","Products":["CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90608","ChangeNote":"Fix Asset Manager Cache API crash when we use GroupBy at web API request","Products":["CsCode-FrontOfficeData","CsCode-PortfolioManagement"]},{"SimCorpReference":"D-90485","ChangeNote":"Two Front office data service load balancers could handle the service queue in case of reconnection to another MUCS and two such services run.  This has now been corrected.","Products":["CsCode-FrontOffice"]},{"SimCorpReference":"D-90396","ChangeNote":"The lifetime for liquidating funds has been slightly adjusted so additional distributions are forecasted.","Products":["CsCode-AltInv"]},{"SimCorpReference":"D-90605","ChangeNote":"Added validation rule to Float Rate Index Definitions form. Now Customer Business Centre only allowed for TRSs","Products":["TradeManager"]}]